{
    "title": "Events for January 10",
    "events": {
        "10\tJanuary\t1616": "Sir Thomas Row, first English Ambassador, submitted his identification to Emperor Jahangir at Ajmer.",
        "10\tJanuary\t1693": "Job Charnock, founder of Calcutta, died in the same city and he was laid to rest.",
        "10\tJanuary\t1818": "The last battle was fought in Rampura between the Marathas and the company.",
        "10\tJanuary\t1839": "Tea from India first arrives in UK.",
        "10\tJanuary\t1888": "Marathas were defeated in the third and last war against the British at Rampura.",
        "10\tJanuary\t1896": "Shri Narhar Vishnu Gadgil (Kakasaheb), famous politician, freedom fighter, lawyer, prolific writer, social reformer, nationalist leader and litterateur, was born.",
        "10\tJanuary\t1897": "Wildemar Modecai Haffkine, famous scientist, innoculated himself with vaccine against Plague publicly to demonstrate the harmlessness of the product in Bombay. The method of preparation of this vaccine has remained the same till now for more then hundred years.",
        "10\tJanuary\t1908": "Gandhiji adopts word, \"Satyagraha\" in place of \"Passive Resistance\".  Sentenced to two months' imprisonment for failure to leave Transvaal.",
        "10\tJanuary\t1912": "Prodosh Kusum Das Gupta, great artist and professor, was born at Dacca, Bangladesh.",
        "10\tJanuary\t1920": "India became member of League of Nations.",
        "10\tJanuary\t1922": "Museum of Prince of Wales, situated at Mumbai, opened for public.",
        "10\tJanuary\t1932": "Gandhi and his wife are arrested by the Indian authorities.",
        "10\tJanuary\t1953": "Opening ceremony of Centre for Scientific and Industrial Research held.",
        "10\tJanuary\t1955": "The Auxiliary Air Force squadrons were equipped with the HAL-designed HT-2 trainer - officially introduced into service.",
        "10\tJanuary\t1959": "Martin Luther King, the US Black leader, arrived in New Delhi.",
        "10\tJanuary\t1963": "Gold Control Measures Plan was started by the Government of India.",
        "10\tJanuary\t1964": "Battles between Muslims & Hindus in Calcutta.",
        "10\tJanuary\t1966": "Tashkent Conference between Pakistan and Indian leaders ended after signing of peace accord by Lal Bahadur Shastri and General Ayub Khan.",
        "10\tJanuary\t1967": "Indira Gandhi, Prime Minister of India, laid the foundation stone of Women's University, Karnataka, founded to pay gratitude to Rani Chainema of Kitur.",
        "10\tJanuary\t1975": "India accords recognition to the Palestine Liberation Organization.",
        "10\tJanuary\t1979": "Anand Gopal Shauri, litterateur and journalist, passed away.",
        "10\tJanuary\t1980": "President Neelam Sanjiva Reddy invited Indira Gandhi to form Government.",
        "10\tJanuary\t1986": "Pakistan decides to lift 8-year-old ban on private trade with India.",
        "10\tJanuary\t1987": "Sikh terrorists murder Punjab prison chief in Chandigarh.",
        "10\tJanuary\t1993": "India asks Pakistan to reduce its diplomatic strength by 40.",
        "10\tJanuary\t1995": "26th International Film Festival of India opens at Brabourne Stadium, Bombay.",
        "10\tJanuary\t1996": "Supreme Court tells Arunachal Pradesh to give protection to Chakma refugees.",
        "10\tJanuary\t1997": "The second leg of the Indian Satellite circuit held in Ahmedabad.",
        "10\tJanuary\t1998": "Nine Ranbir Sena supporters are killed in an ambush at Rampurchauram village in Bihar's Jehanabad district."
    }
}