{
    "title": "Events for December 10",
    "events": {
        "10\tDecember\t1857": "Veer Narayan Singh organised a small group and had an encounter with British army. He was charged treason and sentenced to death. He was executed publicly.",
        "10\tDecember\t1870": "Jadhunath Sarkar, history researcher, was born.",
        "10\tDecember\t1878": "Chakravarti Rajagopalachari, great social reformer, ardent patriot, incisive thinker and eminent literateur was born at Hosur in Tamil Nadu. He was the first Indian Governor General of independent India and popularly known as 'Rajaji'.",
        "10\tDecember\t1886": "Ardeshir M. Irani, producer, director, exhibitor and founder of Star Films Ltd. Bombay, was born at Poona. His first film was 'Veer Abhimanyu'.",
        "10\tDecember\t1902": "Nijalingappa Siddavanahalli, president of Indian National Congress and politician, was born at Haluvagalu (Bellary).",
        "10\tDecember\t1905": "Robert Koch received the Nobel Prize for Medicine for his work on Tuberculosis.",
        "10\tDecember\t1907": "Rudyard Kipling, author of `The Jungle Book' and `Kim', received the Nobel prize for literature.",
        "10\tDecember\t1913": "The Nobel prize for literature was awarded this year to Rabindranath Tagore, the Bengali poet from India.",
        "10\tDecember\t1918": "Rowlatt Act introduced by Lord Chelmsford.",
        "10\tDecember\t1923": "Madhav Gururao Kulkarni, great author and educationist, was born in Rani Bennur, Dharwar.",
        "10\tDecember\t1932": "The Indian Military Academy (IMA) was formally inaugurated by Field Marshal Sir Philip W Chetwode, Bt, GOB, KCMG, GCSI, DSO and was christened as \"The Pioneers\". The crowning event was delivered in the hall, now named after him, and in the address to the trainees, he enunciated three principles: 'the safety, honour, and welfare of your country comes first, always and everytime', which were to guide the future officers of the Indian Army. A passage from this address has come to acquire immortality and has been adopted as the credo of the Academy.",
        "10\tDecember\t1936": "England replaces King Edward VIII stamp series with King George VI.",
        "10\tDecember\t1945": "Aust Services lose third Victory Test Cricket to India by 6 wkts.",
        "10\tDecember\t1948": "Human Rights Day.",
        "10\tDecember\t1952": "World's first official Family Planning programme launched in India.",
        "10\tDecember\t1967": "Earthquake hit Koyna Nagar.",
        "10\tDecember\t1969": "Norman Borlaug, the Iowa-born crop expert, whose research on new strains of high-yielding rice and wheat has led to a Green Revolution in developing countries, was awarded the Nobel peace prize today. Working at the International Maize and Wheat Improvement Center of Mexico since 1944, Borlaug, 56, has directed a team of agronomists working on the development of new crop plant strains that have allowed Third World farmers to multiply yields dramatically. His organization has trained farm technicians from 29 countries, including India, Pakistan and Turkey, enabling them to move steadily toward the goal of self-sufficiency in food production.",
        "10\tDecember\t1978": "Mother Teresa is awarded the Nobel Peace prize.",
        "10\tDecember\t1979": "Mother Teresa wins Nobel Peace prize.",
        "10\tDecember\t1984": "Justice Thakkar Commission appointed to enquire into the assassination of Indira Gandhi.",
        "10\tDecember\t1985": "A. M. Prasad was appointed as the Narcotics Commissioner of India. He headed this office till 30-04-1987.",
        "10\tDecember\t1989": "Janardan Swami passed away.",
        "10\tDecember\t1990": "The communal disturbances between Hindus and Muslims in Hyderabad claim more than 100 lives, and violence spreads to Aligarh and Kanpur also.",
        "10\tDecember\t1992": "The Central Government bans RSS, VHP, ISS, Bajrang Dal and Jamait-e-Islami.",
        "10\tDecember\t1993": "The residence of Mahatma Phule was declared a national monument.",
        "10\tDecember\t1996": "Supreme Court bans employment of child labour in hazardous industries.",
        "10\tDecember\t1997": "Salman Haidar appointed India's High Commissioner to Britain. He succeeded  M. L. Singhvi.",
        "10\tDecember\t1998": "Prof. Amartya Sen receives the 1998 Nobel Prize for Economics.",
        "10\tDecember\t1999": "Pranab Mukherjee and Jaipal Reddy are chosen outstanding parliamentarians for 1997 and 1998 respectively."
    }
}