{
    "title": "Events for October 10",
    "events": {
        "1756": "Clive sailed from Madras, to capture Calcutta, with a large naval fleet consisting of 900 European and 1500 Indian soldiers along with 5 battle ships, and 5 other vessels.",
        "1844": "Badruddin Taibjee, lawyer and leader, was born.",
        "1896": "Jananayak Debeswar Sarmah, freedom fighter, architect and nationalist, was born at Jorhat, Assam.",
        "1899": "Shripad Amrit Dange, socialist and Trade Union Leader, was born.",
        "1906": "Narayan Rasipuram Krishnaswamy, great Indian writer, was born.",
        "1909": "Nagarwala Noshirvan Dorab, cricket umpire of five Tests, was born in Maharashtra.",
        "1910": "Dr. Dwarkanath Kotnis, famous doctor who worked in China, was born at Solapur, Maharashtra.",
        "1927": "Bansilal, leader of  Lokdal Party, was born.",
        "1937": "Anant Bhave, famous Marathi litterateur and news announcer on Doordarshan, was born.",
        "1946": "Noakhali Massacre.",
        "1952": "US mediator Frank Graham told the U.N. Security Council that there was a possibility of war between India and Pakistan over Kashmir.",
        "1954": "First 'President Award' was awarded to film 'Shyamchi Aai'.",
        "1957": "Jagdeep', a children's film, won the first prize at the Ninth International Exhibition of Films for Children at Venice.",
        "1962": "Indies assault up Chinese positions in north India attack.",
        "1964": "Gurudutt, famous film actor, died.",
        "1970": "Union Government ruled out judicial probe into the death of the late PM Lal Bahadur Shastri.",
        "1973": "Vikash Dhorsoo, Soccer(Football) player, was born in Harfleur, Le Havre, France.",
        "1977": "61 people died in an accident between a passenger train and a freight train at Naini.",
        "1978": "Rohini Khadilkar, fifteen years old, became the first woman to win the national chess championship. Presently, she is the editor of a leading Marathi newspaper of Mumbai 'Nava Kaal'.",
        "1990": "Marxist extremists set fire to a crowded train in Andhra Pradesh killing more than 60.",
        "1991": "Anantrao Laxmanrao Kulmarni, editor of monthly magzine 'Sajjangad' and weekly 'Samarth', died.",
        "1993": "Helicopters along with the last batch of personnel were ferried out in an AN-12 from Delhi to Mogadishu. These helicopters were provided by 111 HU.",
        "1995": "G. R Khairnar, the high profile suspended Deputy Municipal Commissioner of Bombay, was reinstated.",
        "1996": "UP polls throw up a hung assembly.",
        "1998": "Uzma Khan and Nitin Kirtane bag the women's and men's crowns in the national tennis championships in Delhi.",
        "1999": "Congress-NCP talks still on forming a Government in Maharashtra.",
        "2000": "The world's first elected woman Prime Minister Sirimavo Bandaranaike died of heart attack in Colombo."
    }
}