{
    "title": "Events for November 10",
    "events": {
        "10\tNovember\t1659": "Chhatrapati Shivaji killed Afzal Khan near Pratapgad Fort by a clever but undignified move.",
        "10\tNovember\t1698": "East India Company purchased Calcutta, which had not more than a village at that time.",
        "10\tNovember\t1848": "Surendranath Banerji, popularly known as Rashtraguru, was born at Taltala, Calcutta. He passed his final ICS Examination in 1869 and joined in 1871, He was President of the Indian National Congress twice, in 1895 at Pune and in 1902 at Ahmedabad.",
        "10\tNovember\t1901": "Formal inauguration of the new North-West Frontier Province created out of the Punjab.",
        "10\tNovember\t1909": "Gandhiji replies to Tolstoy, sends his biography by Doke.",
        "10\tNovember\t1922": "S. K. Raghunath Rao, cricket test umpire for 7 tests from 1960-67, was born in Karnataka.",
        "10\tNovember\t1938": "Mustafa Kemal Ataturk passed away at Istanbul.",
        "10\tNovember\t1960": "B. N. Jha was appointed as the Cabinet Secretary of India. He held this office till 08-03-1961.",
        "10\tNovember\t1968": "Tukdoji Maharaj, modern social reformer, saint and poet, died in his ashram at Mozri in district Amravati.",
        "10\tNovember\t1989": "Foundation stone laid for the Ram Janambhoomi temple at Ayodhya.",
        "10\tNovember\t1990": "Chandra Shekhar Singh sworn in as 8th Prime Minister of India. He remained in this office till June 21, 1991 Devilal was sworn in as the Dy. Prime Minister.",
        "10\tNovember\t1991": "South Africa's first cricket One-day international since 1970 vs India.",
        "10\tNovember\t1992": "Attorney General G. Ramaswamy, under cloud for his dealings with Standard Chartered Bank, resigns.",
        "10\tNovember\t1994": "Dr. K. V. Putappa \"Kuvempu\", first Gyanpeet Awardee for literature and Kannad author, died at the age of 90 years.",
        "10\tNovember\t2000": "R.M. Shankara and Rashmi Kumari lift men's and women's title in the World carrom championship in New Delhi."
    }
}