{
    "title": "Events for February 10",
    "events": {
        "1691": "Job Charnock established the first English factory in Calcutta.",
        "1803": "Jagannath Sunkerseth, great social worker, education lover and one of the sculptors of modern Mumbai, was born.",
        "1806": "Father Kuriakose Elias Chavara, freedom fighter and social reformer, was born at Kainakary , Kerala.",
        "1846": "British forces under Hugh Gough defeated Sikhs in the Battle of Sobrahan in India.",
        "1859": "General Horsford defeats Begum of Oude & Nana Sahib in Indian mutiny.",
        "1897": "Sannidhanam Suryanarayana Sastry, educationist and writer, was born at Chiriwada, (A.P).",
        "1902": "Hemraj, politician, was born at Dera Gopipur, (H.P.).",
        "1910": "Smt. Durga Bhagwat, veteran Marathi writer, was born.",
        "1916": "Revolutionary Sohanlal Pathak hanged.",
        "1921": "Wilhelm Conrad Von Roentgen, professor and nobel prize winner, passed away.",
        "1926": "Rajmata Krishna Kumari, social worker, was born at Dharangadhra.",
        "1927": "Dashrathi (Dashrathi Krishnamacharya), famous Telgu poet, was born.",
        "1930": "Shrikant Kirloskar, director of 'Kirloskar Udyog Samuh', was born.",
        "1931": "Capital of India shifted from Old Delhi to New Delhi, formal inauguration of New Delhi City took place.",
        "1943": "Gandhi begins hunger strike to protest imprisonment. This strike lasted for 21 days till March 3.",
        "1944": "Japanese troops take the Ngakyedauk Pass, cutting off the 7th Indian Division at Sinzweya, Burma.",
        "1946": "Gandhiji revives 'Harijan' and allied group of weekly journals.",
        "1949": "Pune University' established.",
        "1957": "Pranab Pankaj Roy, cricketer (son of Pankaj, Indian batsman 1982), was born in Calcutta.",
        "1961": "P. L. Deshpande played first solo drama 'Batatyachi Chawl'.",
        "1979": "Itanagar was declared as capital of Arunachal Pradesh.",
        "1982": "K. R. Meher-Homji, cricket wicket keeper (one Test, one catch, no stumps), passed away.",
        "1986": "Pope John Paul II ends visit to India.",
        "1990": "Saroj Mukherjee, WB's CPI(M) secretary, died.",
        "1992": "Andaman and Nicobar Islands opened for foreign travellers.",
        "1995": "PM appoints Madhavrao Scindia as Human Resource Minister, Pranab Mukherjee as External Minister, Buta Singh as Civil Supplies, Ajit Singh as Food, and P. Chidambaram as Commerce Minister.",
        "1999": "P. Gopi Chand (A.P.) and Aparna Popat (Karnataka) won the men's and women's singles titles respectively in the National badminton championship in Delhi."
    }
}