{
    "title": "Events for March 10",
    "events": {
        "1873": "Maulana Shaukat Ali, freedom fighter, nationalist and Muslim politician, was born.",
        "1897": "Savitri Bai Phule passed away. She played a prominent role in assisting her husband Mahatma Jyotirao Govindrao Phule in education field. She taught in schools for girls and for downtroddens and untouchables.",
        "1904": "Raghunath Gopal Kokaje, great Hindi writer, was born at Bhoka, district Ratnagiri.",
        "1912": "Anant Ramachandra Joshi, cricket Test Umpire for 12 test from 1948-5, was born in Maharashtra.",
        "1922": "Gandhiji arrested for the first time in Bombay on the charges of sedition at Sabarmati.",
        "1926": "Dilbagh Singh, Air Chief Marshal, the second Sikh Chief of Air Staff and Indian Air Force, was born in Punjab.",
        "1939": "17 villages damaged by hailstones in Hyderabad, India.",
        "1940": "Banwarilal Bhagwandas Purohit, famous leader of Vidarbha, was born.",
        "1945": "Madhavrao Scindia, prince of Gwalior and Congress leader, was born.",
        "1954": "The history of 104 HU, the most prestigious and the oldest Helicopter Unit of the IAF, is studded with more than four decades of glorious past and yeomen service rendered to the country. One-O-Four was raised as Helicopter Flight at Palam on 10th March 1954.",
        "1959": "Mukundrao Ramarao Jaikar, great freedom fighter and famous lawyer, passed away.",
        "1969": "Parliament passed the Act that made Central Industrial Security Force as an Armed Force of the union.",
        "1985": "India beat Pakistan to win \"World Championship of Cricket\". Ravi Shastri is declared champion of champions and Sunil Gavaskar steps down from the captaincy.",
        "1991": "The Army Dental Corps celebrates its Golden Jubilee and proudly recounts its past glory.",
        "1993": "The 12-day-old caretaker ministry in Tripura led by Samir Ranjan Burman resigns.",
        "1995": "Ashok Padbidri, famous journalist and editor, died.",
        "1997": "Maharashtra government renames Osmanabad as Dharashiva.",
        "1998": "B. B. Lyngdoh of the United Democratic Party is sworn in Chief Minister of Meghalaya. The 12-day-old Congress(I) Ministry resigned following the failure of the party nominee to be elected as Speaker.",
        "1999": "Lok Sabha approves the Patents (Amendment) Bill 1999, by a voice vote.",
        "2000": "Nitish Kumar, Bihar Chief Minister, submits his resignation without putting his motion of seeking a trust vote to test in the assembly. The RJD leader Rabri Devi meets the Governor and stakes claim to form the Government."
    }
}