{
    "title": "Events for April 10",
    "events": {
        "1317": "Saint Gora Kumbhar, an intense devotee of the deity Vitthal at Pandharpur, took Samadhi in Ter village in Osmanabad Zilla, near Latur.",
        "1760": "Gerard George Clifford, head of East-Indian Company, passed away at the age of 75.",
        "1875": "Swami Dayanand Saraswati established the Arya Samaj at Bombay and in 1877 in Lahore.",
        "1880": "C.Y. Chintamani, renowned journalist, was born.",
        "1901": "Amiya Chakravarty, educationist, was born at Serampore in West Bengal.",
        "1919": "Miss Mercia Sherwood, an English teacher, was assaulted by a mob in Amritsar. Brig. General. R.E.H. Dyer had given instructions to beat her.",
        "1930": "Police raid the headquarters of the Indian National Congress, Bombay.",
        "1931": "Balasaheb Vikhe Patil, who worked in the region of Sahkar and Education, was born.",
        "1935": "Vasudevaru Kesavaru (K.V. Manalikkera), famous writer and poet, was born at Madras.",
        "1937": "Shridhar Vyanktesh Ketkar, creator of Maharashtra Gyankosh and Sociologist, passed away.",
        "1955": "India and Vietnam affirm the Panchsheel.",
        "1982": "Indian National Satellite (INSAT-1A) launched. First operational multi-purpose communication and meteorology satellite procured from U.S.A.(Cape Canaveral).",
        "1993": "Student hijackers of IA plane overpowered in Lucknow.",
        "1995": "Morarji Ranchhodji Desai, first non-Congress Prime Minister of India (1977-79) and Chief Minister of Bombay, passed away at the age of 99. He was awarded with Bharat Ratna.",
        "1996": "The marketing of Salman Rushdie's novel 'The Moor's Last Sigh' in India was cleared by the Central govt.",
        "1997": "Bill Gates, Chairman and CEO of Microsoft,  announces Rs. 2.5 crore aid to Bharatiya Vidya Bhavan's Gandhi Institute of Computer Education and Information Technology, Mumbai.",
        "1999": "Thakazhi Sivasankara Pillai (87), patriarch of Malayalam fiction, died at his ancestral village at Sankaramangalam in Thakazhi village."
    }
}