{
    "title": "Events for July 10",
    "events": {
        "1909": "Gandhiji arrives in London with the assistance of Lord Ampthill and works ceaselessly to educate influential British leaders and the public, and also to move Imperial authorities.",
        "1924": "Johannes B van Heutsz, Governor General of Dutch Indies (1904-09), died at the age of 73.",
        "1927": "Ganga Ram, great social reformer and founder of Ganga Ram Hospital in New Delhi, died in England while functioning as an active member of the Royal Commission on Agriculture. He was against dowry and child marriages and advocated widow re-marriage and also established institutions for vocational education and education for adults.",
        "1949": "Sunil Manohar Gavaskar, great Indian cricket player (opener, 10,122 Test runs), was born in Bombay. He has received Arjun Award (1975) and Padma Bhushan (1980).",
        "1964": "Bangalore University was established in Karnataka.",
        "1965": "First NCC (National Cadet Corps) College for training girls started at Gwalior.",
        "1971": "Kochin University was established in Kerala.",
        "1972": "Herd of stampeding elephants kills 24 people in Chandka Forest, India.",
        "1977": "The Planning Commission decides to introduce Rolling Plan concept.",
        "1978": "'Mahatma Phule Backward Class Development Corporation' (Mahatma Phule Magaswarg Vikas Mahamandal) was established.",
        "1984": "White Paper on Punjab released by Union Government.",
        "1991": "C. G. Pandit, famous scientist and Padmabhushan awardee, died.",
        "1992": "P.Chidambaram,Union Minister, resigns owning responsibility for investing in 'Fairgrowth'.",
        "1994": "Ramrao Raghoba Rane, Paramveer Chakra awardee, died.",
        "1996": "Budget session of Parliament begins.",
        "1997": "Rafiq Sadiq, Congress(I) leader, escapes attempt on life when armed militants ambush motorcade near Achabal in South Anantnag, Kashmir valley.",
        "1998": "India says it wont sign the CTBT unconditionally and invites Pakistan to join in disarmament efforts.",
        "1999": "The Delhi police arrest Mohammad Javed alias Babu Bhai, an accused in the Jain Hawala case.",
        "2000": "Pete Sampras wins his 7th singles Wimbledon title and his 13th Grand Slam title overtaking Roy Emerson's 12 titles."
    }
}