{
    "title": "Events for August 10",
    "events": {
        "1581": "Akbar, great Mughal Emperor, won Kabul.",
        "1755": "Narayanrao Peshwa was born.",
        "1758": "Marathas won the Atak.",
        "1855": "Alladiya Khan, famous singer of Kolhapur court, was born.",
        "1860": "Vishnu Narayan Bhatkhande, the great architect of the renaissance of Hindustani music and who played a vital role in giving re-birth to North Indian classical music, was born at Balukeshwar, Maharashtra.",
        "1894": "Varahagiri Venkata Giri, the fourth former President of India, was born at Berhampur in Orissa. He was one of the patriarchs of Trade Union Movement of India.",
        "1901": "Narayan Pillai Gopala Pillai, great poet and educationist, was born in Quilon, Kerala.",
        "1904": "Japanese troups were defeated by the Russian Amry at Port Aurther.",
        "1905": "Sundarji Gokuldas Betard, modern Gujrathi poet, was born.",
        "1927": "Manali Kallat Vainu Bappu, first Indian astronomer, litterateur and Urdu poet, was born at Madras.",
        "1930": "In the 'Gandhi Cap Case' in Guntur, the magistrate prohibits wearing of Gandhi caps within a five-mile radius of the town.",
        "1942": "Manju Bala Patil was shot on the road at Mumbai by the British Police.",
        "1948": "Atomic Energy Commission established.",
        "1963": "The Kamraj Plan.",
        "1979": "Rohini Technology Payload (RTP) intended for measuring in-flight performance of first experimental flight of SLV-3, the first Indian Space launch vehicle, failed to be placed in orbit.",
        "1982": "Memorial of 201 martyrs from Maharashtra inaugurated.",
        "1986": "Gen. A.S. Vaidya, who was Chief of Army Staff, at the time of 'Operation Blue Star', was shot dead at Pune.",
        "1988": "Ramakrishna Hegde resigns as CM of Karnataka on moral grounds in connection with phone tapping issue.",
        "1989": "Panchayatraj' and 'Nagarpalika' bills were passed in Parliament's Lok Sabha.",
        "1991": "Delhi airport police foils an attempt by a Saudi national to smuggle out a minor girl named Ameena.",
        "1992": "P. P. Thorat, retired Lt and General, died.",
        "1993": "Narayan Keshav Upasni, famous educationist, passed away.",
        "1994": "President's rule in J&K extended for another 6 months beginning 3rd Sept.",
        "1995": "Harishankar Parsai, famous Hindi litterateur, passed away.",
        "1998": "Sri Bhuteshanandji Maharaj, 97, president of the Ramakrishna Math and Ramakrishna Mission, died in Calcutta.",
        "2000": "Parliament approves the Uttar Pradesh Reorganisation Bill to create a hilly state of Uttaranchal."
    }
}