{
    "title": "Events for September 10",
    "events": {
        "1623": "Shah Jahan entered Rajputana and raided Amber crossing the Tapti. He arrived near the kingdom of Golconda and from there passed on to Orissa which was surrendered to him.",
        "1858": "Manilal Nathubhai Dwivedi, great author and father of modern Gujarati poems, was born.",
        "1872": "Sir Ranjitsinhji Vibhaji \"Ranji\", Maharaj Jamsaheb of Nawanagar and noted cricketer, was born in village Sarodar near Jamnagar, Kathiawad. He was referred as \"The prince of a little state, but the king of a great game\". He also played for Sussex.",
        "1887": "Govind Ballabh Pant was born in village Khunt, Almora District, U.P. He served eight years as the Chief Minister of Uttar Pradesh. He was as outstanding parliamentary figure of his days. He was awarded with Bharat Ratna in 1959.",
        "1911": "Jatin Chakravorty, social reformer, politician and trade unionist, was born at Comilla, Bangladesh.",
        "1912": "B. D. Jatti, former Vice President of India, was born.",
        "1915": "Jatindranath Mukhrjee, great revolutionary, died after being wounded in a pitched battle between the revolutionaries and the police, aided by an army unit, in Balasore.",
        "1918": "Muslim riots break out in Calcutta.",
        "1920": "Subramhanyam Bharti, national poet in Tamil language, orator, author, editor, philosopher and revolutionary, passed away.",
        "1923": "Sukumar Roy, famous Bengali child litterateur, passed away.",
        "1924": "K.T. Gopalkrishnan, famous Hindi writer, was born at Azhicode.",
        "1943": "Satyendra Chandra Bardhan, Vakkom Abdul Khader, Fouja Singh, Boniface Pereira and Anandan were hanged on charges of conspiracy to \"wage war against the King\" under the Ememy Agents Ordinance (which was given retrospective effect) at Madras Jail. They sang Vande Mataram and shouted \"Bharat Mata Ki Jai\" when they were being hanged.",
        "1966": "Parliament approved the Punjab Re-organisation Bill for the formation of Haryana and Punjab as two independent states.",
        "1976": "An Indian Airlines Boeing 737 aeroplane was hijacked for the second time and taken to Lahore, Pakistan.",
        "1977": "The Planning Commission decides to introduce the Rolling Plan concept.",
        "1980": "Mangalore University established.",
        "1992": "All movable and immovable properties of big bull Harshad Mehta, and others involved in the Security scam, attached.",
        "1993": "India and South Korea sign agreement to expand trade and investment.",
        "1995": "87 of the 180 members of the newly constituted JAAC assume office.",
        "1996": "Central Ethical Committee of ICMR on Human Research, constituted under the Chairmanship of  Justice (Retired) M.N. Venkatachaliah, held its first meeting. Several sub committees were constituted to address specific topics viz. Epidemiological Research, Clinical Evaluation of Products to be Used on Humans, Organ Transplantation; Human Genetics, etc.",
        "1999": "Top seeds Bhupathi and Paes finished runners-up in the US Open doubles, losing to Sebastien Lareau and Alex O'Brien in the final.",
        "2000": "Marat Safin wins the men's singles in the US open championship."
    }
}