{
    "title": "Events for December 11",
    "events": {
        "11\tDecember\t1687": "Madras' first presidency chartered with a Mayor s court as a Municipal Corporation.",
        "11\tDecember\t1780": "Goddard General, Bassein fort was captured near Bombay.",
        "11\tDecember\t1783": "Peshwa Raghobadada, who ruled upto Atak, passed away.",
        "11\tDecember\t1843": "Robert Koch, famous French scientist, was born in Clausthal village, Germany.",
        "11\tDecember\t1845": "First battle between Britishers and Sikhs. In 1849, Punjab lost its independence. This is referred as the first Anglo-Sikh War.",
        "11\tDecember\t1872": "Rajkhova Benudhar, modern Assamese poet, was born.",
        "11\tDecember\t1876": "Raobahadur Yeshwantrao Harishchandra Desai, famous architect, was born.",
        "11\tDecember\t1881": "Subramania Bharati was born at Ettaiyapuram.",
        "11\tDecember\t1906": "Mysore Gururaj Vijayasarathi, cricket Test umpire for 13 tests from 1951-60, was born in Karnataka.",
        "11\tDecember\t1908": "New law suspends trial by jury and increases penalties for 'sedition'.",
        "11\tDecember\t1922": "Dilip Kumar, famous film actor, was born.",
        "11\tDecember\t1926": "Kamala Kant Pandey was born at Varanasi. He was the first Indian agriculture graduate to win the London Exhibition Scholarship. He was elected fellow of the Linnean Society of London in 1966. In 1975, he made the discovery of a \"revolutionary technique in plant breeding\".",
        "11\tDecember\t1929": "Subhash Pandharinath \"Fergie\" Gupte, cricketer (brilliant Indian leg-spinner), was born in Bombay.",
        "11\tDecember\t1931": "Bhagwan Shree Rajneesh \"Osho\", guru of the rich, was born.",
        "11\tDecember\t1938": "Mahavir Prasad Dwivedi, famous Hindi  litterateur and editor, passed away.",
        "11\tDecember\t1958": "Wilson Jones became India's first individual World Champion when he won the Amateur Billiards Championship.",
        "11\tDecember\t1963": "Kewalam Madhav Panikkar, veteran politician and famous historian, passed away.",
        "11\tDecember\t1967": "6.5 earthquake in West India, 170 killed.",
        "11\tDecember\t1968": "Indian born Har Govind Khorana receives the Nobel Price for medicine and physiology.",
        "11\tDecember\t1971": "The elite para-commandos and parachute battalions -India's 'Red Devils', as they are affectionately called, have an unsurpassed ethos and elan of their own. 2 Para Battalion executed a superb airborne assault operation at Tangail in East Pakistan, which was the first of its kind in the subcontinent.",
        "11\tDecember\t1976": "Aliyawar Jung, former Governor of Maharashtra, died.",
        "11\tDecember\t1986": "The United Nations Children's fund (UNICEF) completes 40 years of work on behalf of children (11-12-86).",
        "11\tDecember\t1987": "Rajiv Government defeats the first ever no-confidence motion.",
        "11\tDecember\t1988": "Dr. Nagendra Singh, 74, President of the International Court of Justice, passed away in Hague.",
        "11\tDecember\t1990": "T. N. Seshan appointed CEC, and  Mohan Dharia Deputy Chairman of the Planning Commission.",
        "11\tDecember\t1991": "R. G. Sardesai, veteran journalist, died.",
        "11\tDecember\t1992": "UP acquistion of land in Ayodhya quashed by Allahabad High Court.",
        "11\tDecember\t1993": "Shankar Dayal Sharma, President, inaugurates the extended new wing of Nagpur Vidhan Bhavan.",
        "11\tDecember\t1994": "H.D. Deve Gowda, Janata Dal leader, assumes office as CM of Karnataka.",
        "11\tDecember\t1996": "T. N. Seshan retires. M. S. Gill becomes the new election Chief Election Commissioner.",
        "11\tDecember\t1998": "Poet Pradeep (Ramchandra Divedi)  died at 1850 hrs today.",
        "11\tDecember\t1999": "Gopalakrishna Gandhi, former High Commissioner to South Africa, is conferred the honorary doctorate by the University of Natal, Durban, South Africa."
    }
}