{
    "title": "Events for October 11",
    "events": {
        "1737": "A violent earthquake and cyclone hit Calcutta which claimed 3,00,000 lives.",
        "1876": "Saint Gadgebaba, Bengali story writer and novelist, was born.",
        "1894": "Sudhirranjan Das, former Chief Justice of Supreme Court, was born.",
        "1902": "Loknayak Jayprakash Harsudayal Narayan, veteran socialist leader, was born at Sitabdiara village (border of Uttar Pradesh and Bihar) in Bihar. He was awarded Bharat Ratna on Dec. 23, 1998 and played a key role in formation of Janta Party which defeated Indian National Congress for the first time.",
        "1923": "Harish Chandra was born in Kanpur, Uttar Pradesh. His work in a narrow branch of modern mathematics led to its developement to such an extent that it drew the attention of mathematicians all over the world.",
        "1927": "Sarojini Regani, great journalist, was born at Secunderabad.",
        "1941": "Amitabh Bachchan, famous film actor, was born.",
        "1962": "Chinese, Indian troops clash on border, claiming 50 lives.",
        "1968": "Rashtrasant Tukdoji Maharaj took Samadhi at Gurukunj Ashram, Amravati. He was involved in social reforms in rural regions of Maharashtra and started many development programs, including construction of roads. He also wrote GramGeeta which describes means for village development. He had also attended a World Religions and World Peace Conference in Japan. Nagpur University is renamed as \"Rashtrasant Tukdoji Maharaj Nagpur University\" in his honor.",
        "1984": "Khanderao M. Rangnekar, cricketer (33 runs at 5.50 for India), died.",
        "1986": "Mother Teresa escapes unhurt from a plane crash which killed six in Tanzania.",
        "1988": "Janata Dal, a new national centrist opposition party, launched. V. P. Singh elected President.",
        "1991": "Resident Editor of Nagpur Times Ramnarayan Dube assassinated.",
        "1993": "CBI files chargesheet against stock-broker Hiten Dalal and 3 others for defrauding Canbank Mutual Fund over Rs.102 crore.",
        "1994": "Molly Chacko at Hiroshima sets record for 3000m (Women) in 9.06.42.",
        "1996": "Supreme Court ruling on change of venue of Rao's trial.",
        "1999": "Atal Behari Vajpayee is appointed Prime Minister. Two-tier ministry likely."
    }
}