{
    "title": "Events for January 11",
    "events": {
        "11\tJanuary\t1613": "Emperor Jahangir in a proclamation permitted East India Company to establish factories in Surat. And the first British factory was established under Thomas Aldworth.",
        "11\tJanuary\t1858": "Shridhar Pathak, famous Hindi poet, was born.",
        "11\tJanuary\t1859": "Lord Curzon, Governor General and Viceroy, was born.",
        "11\tJanuary\t1921": "Vasudevacharya Kerur, famous Kannad novelist, drama writer and journalist, passed away.",
        "11\tJanuary\t1955": "Production of Newsprint paper factory started for the first time in India.",
        "11\tJanuary\t1958": "Two lakh Indians in East Pakistan were rounded up and lodged in concentration camps.",
        "11\tJanuary\t1960": "Pakistan and India agree on disputed boundary between Punjab and W. at Pakistan.",
        "11\tJanuary\t1966": "Lal Bahadur Shastri was posthumously awarded the \"Bharat Ratna\".",
        "11\tJanuary\t1973": "Rahul Dravid, cricket batsman, was born in Indore.",
        "11\tJanuary\t1975": "Oil struck in third Bombay High rig.",
        "11\tJanuary\t1986": "The Naval Dockyard Bombay celebrates its 250th Anniversary.",
        "11\tJanuary\t1990": "R. Shekhar became the director of Central Bureau of Investigation (till 14/12/90).",
        "11\tJanuary\t1991": "Ravi Naik of Maharashtra Gomanthak party sworn in as the CM of Goa.",
        "11\tJanuary\t1993": "Communal violence in Bombay and Ahmedabad spreads; By-elections postponed.",
        "11\tJanuary\t1994": "Shankarrao Savekar, veteran cameraman of  film industry, passed away.",
        "11\tJanuary\t1995": "Kumari Anandan replaces Vazhapadi K. Ramamurthy as TNCC (I) chief.",
        "11\tJanuary\t1996": "Canadian PM Jean Chretien visits New Delhi.",
        "11\tJanuary\t1998": "C. V. Gadkari, great Indian Test all-rounder 1953-55, passed away.",
        "11\tJanuary\t1999": "Four DRDO scientists and four pilots aboard an Avro plane on a research test flight are killed as the plane crashes after take-off from the Arakkonam INS Rajali Naval air base in Tamil Nadu.",
        "11\tJanuary\t2000": "Mrs. Anju, wife of Shoaib Ilyasi of 'India's Most Wanted' famed serial, dies under mysterious circumstances."
    }
}