{
    "title": "Events for November 11",
    "events": {
        "1675": "Aurangzeb executes Sikh Guru Tegh Bahadur thus beginning the Sikh-Muslim feud that continues to this day.",
        "1793": "English pioneer missionary William Carey, 32, reached Calcutta five months after setting sail for India. Later, Carey founded the Baptist Missionary Society, the first of the British Protestant missions agencies.",
        "1866": "Patthe Bapurao (Shridhar Krishna Kulkarni), famous poet Shahir, was born.",
        "1872": "Abdul Karim Khan, famous singer of \"Kirana Gharana\", was born.",
        "1888": "Acharya Kripalani, nationalist and member of the Parliament, was born at Hyderabad, Sind.",
        "1906": "Chetput Ramaswami Pattabhi Raman, politician and social worker, was born at Madras.",
        "1913": "Gandhi sentenced to nine months' imprisonment at South Africa.",
        "1921": "Gandhi urges Hindus to remove statue of ex-Viceroy Lord Lawrence.",
        "1923": "Shamasunder Gururaj Mudgal, great educationist, was born at Bijapur, Bagalkot.",
        "1924": "SunderLal Munnalal Patwa was born in Kukdeshwar, Distt. Neemuch (Madhya Pradesh).",
        "1947": "Temple of Vithoba in Pandharpur opened for Harijans. Ganpatrao Tapase was the first harijan to enter the temple.",
        "1958": "Inauguration of 'Indian', first one in Indian Explosive Ltd's factory at Gomia.",
        "1973": "India's first International Philatelic Exihibition started in New Delhi.",
        "1979": "President N. Sanjiva Reddy declares the opening of the first International Trade Fair of India.",
        "1980": "The Hindustan Times says the 'British have reverted to what they basically are & a small, little people with small, little minds inhabiting a small, little island in the Atlantic'.",
        "1991": "Supreme Court declares the Anti-Defection Law as constitutional but holds that decisions of Presiding Officers under the law could be subjected to judicial review.",
        "1992": "S.Bangarappa resigns as the CM of Karnataka.",
        "1994": "The Supreme Court stays Karnataka Reservation Act.",
        "1996": "A.P. cyclone toll may cross 2,500.",
        "1998": "V. M. Devaraj (78), DMK leader and former MLA, passed away after a brief illness. He represented Vellore in 1980, 1984 and 1989. He was a close associate of the DMK founder, C. N. Annadurai.",
        "1999": "Mr. Vajpayee, Prime Minister, leaves for Durban summit of the Commonhealth Heads of Government meeting (CHOGM).",
        "2000": "Harin Pathak, Union Minister of State for Defence,  resigns after being chargesheeted by a sessions court in Ahmedabad in a case relating to the murder of a head constable at the height of the anti-reservation agitation in 1985."
    }
}