{
    "title": "Events for February 11",
    "events": {
        "1527": "Babur declared battle against Rana Sangram Singh.",
        "1818": "Britishers captured  the 'Ajinkyatara'  fort which belonged to the Marathas.",
        "1847": "Thomas Alva Edison, great scientist and inventor of electric light lamp, was born at Milan, Ohio.",
        "1861": "Brahma Bandhav Upadhyay was born in Khanyan village of Bengal.",
        "1906": "Daily Tribune' started its printing from Lahore.",
        "1913": "Surendranath Dwivedi, educationist, politician and writer, was born in Khandasahi (Orissa).",
        "1933": "First edition of weekly \"Harijan\" edited by Mahatma Gandhi was published from Pune in English and Hindi.",
        "1935": "Lalita Narhar Bapat, famous marathi novelist, was born.",
        "1942": "Jamnalal Bajaj, greatest iIndustrialist, social reformer, freedom fighter and Gandhiwadi, passed away.",
        "1944": "Buddhadev Dasgupta, director (Charachar, Grihajuddha), was born.",
        "1959": "Vinoo Mankad plays his final Test Cricket (vs West Indies at Delhi).",
        "1968": "Deendayal Upadhyaya, great philosopher, litterateur, social worker, thinker and founder of Jansangh, passed away.",
        "1977": "Dr. Fakruddin Ali Ahmad (1905-1977), the 5th President of India, passed away in office.",
        "1979": "Cellular Jail, which is situated at Andaman Nikobar Islands, was declared as a National Memorial.",
        "1980": "Romesh Chandra Majumdar, great Bengali historian, passed away.",
        "1981": "Australia all out for 83 vs India at MCG. They were chasing 143 to win.",
        "1989": "Pandit Narendra Sharma passed away.",
        "1993": "Kamal Amrohi, famous film producer, director and writer, died at the age of 76 years. He is famous for his Hindi films such as Mahal (1949), Pakeezah (1972) and Razia Sultan (1983). He also established Kamal Pictures (Mahal Films) in 1953 and Kamalistan Studio in Bombay in 1958.",
        "1996": "Wills World Cup Cricket inaugurated at Calcutta.",
        "1997": "NHRC recommends to Central Government measures to prevent government servants from employing children below 14 as domestic servants.",
        "1998": "The Punjab police unearth a plot to kill  Prime Minister I. K. Gujral,  Chief Minister Parkash Singh Badal, and Congress(I) leader Sonia Gandhi by a pro-Khalistan militant group.",
        "1999": "12 dalits are shot by the Ranbir Sena in Narayanpar village in Bihar.",
        "2001": "Objective type paper scheduled in 28 cities in India."
    }
}