{
    "title": "Events for March 11",
    "events": {
        "1399": "While returning to his country, Timur Lung looted and destroyed Delhi and parts of North India including Hardwar, the Ganga pilgrimage town, and crossed Sindhu River.",
        "1689": "Sambhaji, Shivaji's successor, who was captured at Sangameshwar, was assasinated in the prison of Aurangzeb by Mughal officer Muqurab Khan.",
        "1784": "Tipu Sultan and Britishers signed the treaty at Mangalore which is known as the Mangalore treaty.",
        "1795": "Battle at Kurdla India, Mahratten beat Mughals.",
        "1824": "US War Dept creates the Bureau of Indian Affair.",
        "1863": "Maharaja Sayaji Rao III, great nationalist and social reformer, was born at Nasik.",
        "1881": "Ashley Eden unveiled in Calcutta Town Hall the first statue of Indians Ram Nath Tagore and Dwarkanath Tagore.",
        "1886": "Anandibai Gopalrao Joshi became the first Indian lady doctor. She passed the MBBS degree from Philadelphia University of America.",
        "1903": "Shrinagesh M. M, former General, was born.",
        "1915": "Vijay Samuel Hazare, cricketer (prolific Indian batsman 1946-54), was born in Sangli, Maharashtra.",
        "1948": "SS Jal Usha, the first ocean-going steamer made in India, was launched from Visakhapatnam.",
        "1963": "First Railway Engine was produced by Chittaranjan Railway Factory.",
        "1971": "Indira Gandhi wins majority in Parliament.",
        "1975": "Battle between Marathas and Nizam at Kharda.",
        "1984": "India's first modern boas `Jalusha' started from Vishakhapattanam.",
        "1989": "In Bihar, a 13-member ministry headed by Satyendra Narain Sinha, MP, was sworn in.",
        "1990": "Darbarsingh, former Chief Minister of Punjab, passed away.",
        "1992": "Dr. Anita B. Bose-Pfaff, daughter of Netaji, declines to accept the 'Bharat Ratna' conferred on her father.",
        "1993": "Gen. K.V. Krishna Rao returns to Jammu & Kashmir as Governor.",
        "1994": "The Supreme Court upholds sacking of BJP Governments;  Balasaheb Deoras quits as RSS Chief; Rajendra Singh alias Rajju Bhaiya to succeed.",
        "1997": "Chennai police seize a large quantity of powerful explosives and arrest two Muslim fundamentalists.",
        "1999": "Indian Davis Cup player and Asian Games gold medallist Gaurav Natekar announced in Mumbai his retirement from competitive tennis."
    }
}