{
    "title": "Events for April 11",
    "events": {
        "1827": "Mahatma Jyotirao Govindrao Phule, great social worker and founder of `Satyashodhak Samrajya', was born in Pune.",
        "1856": "Lievens Constantly, Flemish missionary in India, was born.",
        "1887": "Jamini Roy, famous artist, was born.",
        "1906": "K.V. Jagannathan, great Hindi writer and journalist, was born at Krishnarayapuram,Tamil Nadu.",
        "1913": "Iron ropes bridge known as 'Laxman Jhula' was constructed over Ganga at Hrishikesh .",
        "1930": "Pandit Motilal Nehru renamed 'Anand Bhuvan' as 'Swaraj Bhawan' and handed it over to the people.",
        "1931": "Mahendranath Yeshwant Gupte, cricket test umpire for 1 test in 1984-85, was born at Mumbai.",
        "1937": "Ramnath Krishnan, well known Indian Tennis player, was born.",
        "1942": "All-India Congress party rejects British offer of dominion status at New Delhi.",
        "1952": "Treaty between France and India, transferring the former French settlement of Chandranagar to India, is ratified by the National Assembly, Paris. It was the last formal step in completing the process of sovereignty.",
        "1964": "Communist Party of India was divided in two parts. Firstly known as Communist Party of India [CPI], its second fragmentation was named as Communist Party of India (Marxist) [CPI(M)]. This division was on ideological differences at the international level.",
        "1984": "Soyuz T-11 returns to Earth which carried 3 cosmonauts including the first Indian Sqn. Ldr. Rakesh Sharma, to Salyut 7.",
        "1992": "Dr. M.M.Thomas, Nagaland Governor, removed from office.",
        "1993": "Laxmanrao Madhav Bhide, senior freedom fighter and history expert, passed away.",
        "1997": "10-month-old Deve Gowde govt. at the centre voted out of power. 292 voting against the motion of confidence in Lok Sabha, 158 for it, 6 abstaining.",
        "1999": "Tamil Nadu men, Railways women emerged National Volleyball League champions in Triprayar.",
        "2000": "Ms. Jhumpa Lahiri, an author of Indian origin, wins the Pulitzer Prize for fiction for her debut collection of short stories 'Interpreter of Maladies'."
    }
}