{
    "title": "Events for May 11",
    "events": {
        "1626": "Malik Ambar of Ahmednagar's Nijamshahi kingdom, passed away.",
        "1885": "Krishnamohan Bandopadhyay, leader, essay writer and journalist of Bengal, passed away.",
        "1888": "Asaf Ali, lawyer, nationalist, writer and connoisseur of music and arts, was born.",
        "1895": "Jiddu Krishnamurti, great Indian profound philosopher of international repute, was born at Madanapalle, Andhra Predesh. His famous book \"Song of Life\" contains most of his philosophical thoughts and teachings.",
        "1911": "Shrimati Lalitadevi, wife of second Prime Minister of India Lal Bahadur Shastri, was born.",
        "1919": "Troops under General Barrett  inflicted a sharp reverse today on the invading Afghans at Bagh Springs. The whole of the frontier area was up in arms with tribesmen threatening Landi Khotal and martial law being proclaimed in Peshawar. It was expected however that General Barrett, well equipped with guns and airplanes, would  soon control the situation. Reports had been reaching London for some time about the possibility of an Afghan incursion following the murder of the pro-British Emir Habibullah. His third son, Amanullah Khan, who took over the throne, was known to be hostile toward the government of India.",
        "1930": "Ganesh Narayan R, great Industrialist, was born.",
        "1965": "The first of two cyclones in less than a month kills 35,000 people in the country.",
        "1970": "A bill for setting up of \"North Eastern Council\" passed.",
        "1985": "Fifteen hundred people were arrested in Sikh violence.",
        "1987": "President's rule imposed in Punjab.",
        "1991": "Naxalities in Andhra abduct P. Sudhir Kumar, son of the former Union Minister Shiv Shankar.",
        "1993": "Toy factory fire kills over 200 people in Bangalore.",
        "1995": "In central Kashmir, militants burnt the Charar-e-Sherif shrine (the tomb of Sufi saint Sheikh Noorudin Noorani) built in 1460 by Zain-ul- Abidin.",
        "1998": "Three momentous events took place on the day that did the nation proud. Firstly, three underground nuclear tests at Pokhran Range in Rajasthan, which included a hydrogen bomb, were tested; secondly, the successful test firing of the 'Trishul Missile' and thirdly, the maiden Certification test flight of 'Hansa-3', the first-all Composite indigenous two seater aircraft.",
        "1999": "Supreme Court confirms the death sentence on four of the 26 accused in the Rajiv Gandhi assassination case, reduces to life imprisonment the sentence on three others and acquits the remaining 19."
    }
}