{
    "title": "Events for June 11",
    "events": {
        "1901": "Pramathanath Bishi, professor and Hindi writer, was born.",
        "1907": "Shantilal Jivanlal Gandhi, famous Hindi writer, was born in Mehmadabad, Gujarat .",
        "1921": "Snehlata, social reformer and politician, was born at Mathura, U.P.",
        "1930": "A cyclonic storm blew a train off the rails near Himmatnagar, Gujarat, killing at least one person and injuring many more.",
        "1931": "Purushottam Vishnu Behre, great editor, story and novel writer, was born.",
        "1932": "Minu Modi, famous industrialist, was born.",
        "1946": "Viceroy interviewed Gandhiji, and mooted proposal of Coalition Government at Centre.",
        "1964": "Dr. Jayant Narlikar, great mathematician of India, submitted his thesis to Royal Society of London.",
        "1976": "Indira Gandhi and Brezhnev sign the Moscow Declaration of Friendship and Cooperation.",
        "1983": "Ghanshyam Das Birla, great freedom fighter, social reformer, pioneer of Indian business, industry, and nationalist, died at London at the age of 89.",
        "1984": "574 Sikh army deserters arrested.",
        "1991": "Over 106.6 million voters go to the second phase of national polls.",
        "1995": "PM leaves for 4-day official visit to France.",
        "1996": "Narasimha Rao's name figures in fresh FIR on bribing JMM MPs case.",
        "1997": "Jaspal Rana and J. Abhijit in the men's section and Nisha Millet in the women's section adjudged best sports persons of the National Games.",
        "1998": "Chetak helicopter of IAF rescued a Border Security Force Jawan stuck waist deep in quicksand.",
        "1999": "India provided incontrovertible tape evidence of Pakistan's involvement in the Kargil sector. The Indian army killed 23 intruders in the Batalik and Dras sectors but lost 15 of its men.",
        "2000": "27 army personnel die after the bus carrying them plunges into a gorge at a spot 80 km from Jammu."
    }
}