{
    "title": "Events for August 11",
    "events": {
        "1347": "Allau'd-din Hasan Gangu alias Jafar Khan. The Muslim kingdom of Bahmani dynasty in the south as Sultan Allau'd-din Khalji. He renamed Gulbarga, his capital as 'Hasanabad'.",
        "1893": "First Hindu-Muslim riots in Maharashtra.",
        "1908": "Khudiram Bose was hanged on this day in Central Jail at Mujaffarpur, Bihar at the age of 19 years. He along with Prafulla Chaki had planned to bomb the carriage supposed to be carrying Kingsford, unfortunately he was betrayed and was caught and finally was sentenced to death and hanged. This day is observed as \"Martyr's Day\" in memory of the great freedom fighter. Even today the soul stirring songs composed in his honour are sung by Bengali folk-singers.",
        "1911": "Prem Bhatia, great journalist, was born.",
        "1916": "Gopal Raghunath Bewur, former Chief of Army and fighter, was born.",
        "1922": "Manmohan Krishna, famous actor, was born.",
        "1954": "Yashpal Barburam Sharma, cricketer (Indian right-handed batsman early 80'), was born in Ludhiana.",
        "1956": "The Lok Sabha passed the States Reorganisation Act.",
        "1961": "Dadra and Nagar Haweli declared as Union Territory States.",
        "1984": "A cloud of toxic chemicals escaped from a Union Carbide plant near Charleston, West Virginia, this morning, and at least 135 residents were treated for eye, throat, and lung irritation. Last December, methyl isocyanate gas escaped from a Union Carbide plant in India, killing 2,000 people. No MIC escaped today, plant officials said. Aldicarb oxime, a much less toxic gas, is declared as one constituent of the gas cloud.",
        "1993": "Brahmaprakash Chaudhary, first Chief Minister of Delhi and former central minister, died.",
        "1997": "Hundreds travelling by Delhi-bound Rajdhani Express from Guwahati have miraculous escape as improvised explosive device planted by suspected Bodo extremists explodes on track near Guwahati.",
        "1999": "Ramnath Parkar, former Indian opening batsman, died in Mumbai.",
        "2000": "Usha Mehta, great Gandhian, passed away."
    }
}