{
    "title": "Events for September 11",
    "events": {
        "1824": "Shivling Surge died at Alpayu.",
        "1875": "Koyaji Jahangir Kuwanrji, famous economist, was born.",
        "1888": "Henry Heras, famous artist and an active member of the Indian Historical Records Commission, was born in Barcelona, Spain.",
        "1889": "Dr. P. Subbarayan, minister and leader of the House in O.P. and President of the Cricket Control Board, was born in Tamil Nadu.",
        "1893": "Swami Vivekananda represented Hinduism at Chicago's Parliament of the World's Religions, the first ever inter-faith gathering, dramatically enlightening Western opinion to the depth of Hindu philosophy and culture. He spoke for the first time in Chicago.",
        "1895": "Vinoba Bhave (real name Vinayak Narhari Bhave), great Gandhian Acharya,  was born at Ganoda village of Maharashtra.",
        "1906": "Gandhiji addressed a mass meeting of Indians at Johannesburg, where they took oath of passive resistance against the newly promulgated 'Transvaal Asiatic Law Amendment Ordinance'.",
        "1911": "Amarnath Lala, right-hand Indian all-rounder of 30s and 40s, was born at Lahore in Pakistan. He was awarded with Padma Bhushan in 1991.",
        "1913": "Waman Ganesh Talwalkar, Marathi journalist and story writer, was born.",
        "1921": "Subramania Bharati, freedom fighter, Tamil poet and editor, passed away at an early age of 39.",
        "1948": "Mohammad Ali Jinnah, father of Pakistan, died.",
        "1950": "Sorabjee Harmasji Colah, cricketer (69 runs in India's first 2 tests 1932-33), passed away.",
        "1954": "Ram Naresh, editor and Hindi author, was born.",
        "1956": "The PM announced in the Lok Sabha the conclusion of the Netaji Inquiry Committee that Netaji did die in an air-crash.",
        "1958": "India and Pakistan announced that most border disputes between the two countries had been settled.",
        "1967": "China and India exchange artillery fire on Sikkim-Tibet border.",
        "1968": "Central Government provides more autonomy to hilly region of Assam.",
        "1985": "Sri Lanka score their first Test victory by 149 runs against India.",
        "1987": "Mahadevi Verma, Gyanpith award winner and one of the greatest luminaries of modern Hindi literature, passed away.",
        "1991": "V. S. Narayan, 'Janmabhumi' Newspaper Group  chief, died.",
        "1993": "Former Andhra CM Rama Rao, 71, weds 44-year-old college lecturer Lakshmi Sivaparvathi.",
        "1995": "PM Narsimha Rao inaugurated the State Panchayat minister's meet for discussing panchayat election, devolution of administrative and financial power to the local bodies.",
        "1999": "India's Sachin Ratti won the men's singles title in the New Zealand International Badminton championship, defeating top seed and world No. 23 Rio Suryana of Australia in the final.",
        "2000": "A Delhi High Court exonerates senior Congress(I) leader and former Union Minister  H.K.L. Bhagat in a 1984 anti-Sikh riot case in Delhi (in Mansarovar Park in East Delhi on November 1, 1984)."
    }
}