{
    "title": "Events for November 12",
    "events": {
        "1762": "Peshwa surrendered in  Battle of Alegaon.",
        "1781": "Nagapatnam of South India was captured by the British troops.",
        "1880": "Senapati Bapat (Pandurang Mahadev), armed freedom fighter, was born in Parnar (Maharashtra).",
        "1885": "Firodia Kundanmal Shobhachand, politician and Gandhian, was born.",
        "1896": "Salim Moizuddin Abdul Ali, explorer, ecologist, teacher, writer and bird watcher, was born.",
        "1929": "First Maharastrian Governor Shripad Balwant Tambe was appointed as Governor of Nagpur.",
        "1930": "First 'Round Table Conference' started in London. Only Muslim League party was present in the conference and there were no representative of Congress. 16 Indian Kings, 23 British representatives and other 56 Indians took part in this conference. The Muslim League consisted of Sir Agha Khan, Mohammed Ali Jauhar, Quaid-e-Azam, Sir Mohammed Shafi, Fazl-ul-Haq, Chaudhary Zafarullah and Ghulam Hussain.",
        "1939": "Pratap Chandra Lal arrived at the training establishment at RAF Station, Risalpur. He then rose to the Air Chief Marcharl of Indian Air Force.",
        "1946": "Pandit Madan Mohan Malaviya  died at the age of 85.",
        "1954": "Bharat Reddy, cricket wicket-keeper (India 1979), was born in Madras.",
        "1958": "Satyajit Ray gets the award for best direction at the San Francisco International Film Festival.",
        "1959": "Keshavrao Marutirao Jedhe, great leader of Harijans and farmers, passed away.",
        "1969": "Indira Gandhi, who was expelled from Congress for indiscipline during President elections, made a large split and formed her own Congress Party with Jagjivan Ram as President. The party is recognised as Congress (I).",
        "1984": "Rajiv Gandhi elected Congress (I) President.",
        "1990": "Uttar Pradesh Government raises the reservation for Backward Classes in direct recruitment to State Services from 15 to 27 per cent.",
        "1996": "Over 350 people die in mid-air collision in Bhiwani district, Haryana.",
        "1997": "India elected to executive board of UNESCO.",
        "1999": "A 50-member BJP ministry led by Ram Prakash Gupta is sworn in Uttar Pradesh.",
        "2000": "Huge voter turnout for Congress Presidential poll. Seven top BSF and IAF officials die after their MI8 helicopter crashes near Lakhpat in the Rann of Kutch in Gujarat."
    }
}