{
    "title": "Events for January 12",
    "events": {
        "1399": "Kritiwas, writer of  Ramayana in Bengali language, was born.",
        "1708": "Shahu was crowned as the Maratha ruler. Shahu, son of Sambhaji, entered Satara and released Aurangzeb's son Azam the previous year.",
        "1757": "Captain Eyre Coote from the Portuguese was captured in Bandel.",
        "1863": "Swami Vivekananda (Narendra Vishwanath Dutta)(1863-1902), dynamic renaissance missionary to West, catalyst of Hindu revival in India and social reformer, was born at Calcutta.",
        "1869": "Dr. Bhagavan Das, great philosopher, freedom fighter, Hindi writer, politician and litterateur, was born at Varanasi.",
        "1895": "Dr. Yellapragada Subbarow, saintly scientist and nobel prize winner, was born at Bhimavaram, Andhra Pradesh.",
        "1901": "Umashankar Dikshit, senior leader of Indira Congress, was born.",
        "1906": "Pandit Mahadeo Shastri Joshi, dictionary creator, was born.",
        "1918": "C. Ramchandra (Chitalkar), famous film music director, was born.",
        "1924": "Gandhiji was operated on for appendicitis in Sassoon Hospital, Pune.",
        "1934": "Surya Sen (Master Da), revolutionary leader of the Indian Republican Army, who attacked the armoury of Chittagong with 62 men of the Indian Republican Army, was hanged at Chittgong Jail by the Britishers.",
        "1946": "De-monetisation of currency notes of the value of Rs. 500 and above.",
        "1948": "Gandhiji decides to fast for communal peace in Delhi for communal riots which broke between Hindus and Muslims at Calcutta. Mountbatten fails to dissuade Gandhiji.",
        "1949": "Tej Bahadur Saproo, liberal leader, passed away. He was a strong believer in constitution and not in revolutions.",
        "1953": "Patel Chest Institute opened by Rajkumari Amrit Kaur. All India Khadi Board constituted with centre at Bombay.",
        "1955": "Pandit Baburao Vishnu Paradkar, eminent Hindi editor and veteran journalist, passed away.",
        "1966": "Shiri Narhar Vishnu Gadgil (Kakasaheb), great freedom fighter, nationalist leader, social reformer, lawyer, prolific writer and politician, passed away.",
        "1990": "Vimal Kumar and Madhumita Bisht retain National badminton titles.",
        "1992": "Kumar Gandharva (Shivputra Siddharamaiya Komkali), famous Classical singer, passed away at the age of 67.",
        "1993": "Ramakanth Rath, well-known Oriya poet, gets the Saraswathi Samman of Rs.3 lakh.",
        "1994": "S. S. Nadkarni, Chairman of National Stock Exchange, appointed SEBI Chairman.",
        "1995": "Kerala's birthrate drops to 17.5 per 1000.",
        "1996": "Supreme Court holds that horse racing is not gambling, but a game of skill.",
        "1997": "Paes-Bhupathi win doubles title in the Singapore Open Challenger hardcourt tennis.",
        "2000": "The Union Cabinet approves a proposal of the Civil Aviation Ministry to privatise the airports at Delhi, Mumbai, Chennai and Calcutta and a new airport in Bangalore on a 30-year lease which can be extended by 19 years."
    }
}