{
    "title": "Events for October 12",
    "events": {
        "1860": "Sir Henry G W Smith, leader of British-Indian forces, passed away at the age of 73.",
        "1907": "Durgaprasad Mandelia, famous merchant and industrialist, was born.",
        "1911": "Vijay Madhavji Merchant Thackersey, cricketer (all-time great Indian batsman), was born in Bombay.",
        "1921": "Jayant Shridhar Tilak, great journalist, was born at Poona.",
        "1935": "Shivraj Vishwanath Patil, former Speaker of Lok Sabha, was born.",
        "1946": "Ashok Vinoo Mankad, cricketer (son of Vinoo, batted for India 1969-78), was born in Bombay.",
        "1952": "Hanif Mohammad scores twin 100s vs New Zealand.",
        "1961": "Sureshchandra Banerjee, great politician, died.",
        "1967": "Dr. Ram Manohar Lohia also known as \"Dauntless Dr. Lohia\", freedom fighter, social reformer and socialist leader, died at the Willingdon Nursing Home, New Delhi. He had founded the 'Praja Socialist Party' in 1952.",
        "1976": "Indian Airlines Caravelle crashed after take off from Bombay.",
        "1990": "Government of India announces a 15\\% cut in oil consumption, exempting LPG and kerosene.",
        "1991": "Sonia Gandhi declineed to contest from Amethi.",
        "1993": "The first operational sortie in Somalia was undertaken with the Brigade Commander and his Deputy on board to recede the area of responsibility in and around Baidoa which was to be the bridage's permanent location.",
        "1995": "Inderjit Gupta re-elected General Secretary of CPI.",
        "1997": "Queen Elizebeth II, accompanied by husband Duke of Edinburgh Philips, arrived in New Delhi on a week-long state visit to mark India's 50th anniversary of Independence.",
        "1998": "Sushma Swaraj is sworn in Delhi Chief Minister in place of Mr. Sahib Singh Verma.",
        "1999": "Sachidanand Sakshi, former BJP MP,  joined SP.",
        "2000": "A Special Court sentences former Prime Minister P.V. Narasimha Rao and his Home Minister Buta Singh to undergo three years rigorous imprisonment and pay a fine of Rs. 2 lakhs each in the 'JMM MPs' bribery case'."
    }
}