{
    "title": "Events for December 12",
    "events": {
        "12\tDecember\t1721": "Balaji Bajirao (Nanasaheb Peshwa), third Peshwa, was born.",
        "12\tDecember\t1872": "Balkrishna Shivram Munje, freedom fighting leader and president of Hindu Mahasabha, was born.",
        "12\tDecember\t1901": "Gurudev Rabindranath Tagore founded the first dance school called as \"Kala Bhawan\" and established the \"Barahamacharya Ashram\", the core of Vishwa Bharati University of Shantiniketan, near Bolpur. It was formally opened on December 22.",
        "12\tDecember\t1905": "Mulkraj Anand, Indo-Anglian novelist and critic of international repute, was born in Peshawar, Pakistan.",
        "12\tDecember\t1908": "Gaandhiji released from Volksrust Gaol. Indian National Congress adopts resolution on South Africa, criticizing the harsh, humiliating and cruel treatment to British Indians in South Africa as injurious to English Empire.",
        "12\tDecember\t1921": "Gandhi organizes a complete boycott of Prince of Wales's visit to Allahabad.",
        "12\tDecember\t1925": "Ghulam Mustafa Guard, cricketer (lefty pace bowler in 2 Tests for India 1959), was born in Surat, Gujarat.",
        "12\tDecember\t1930": "Babu Genu sacrificed his life to stage the boycott of foreign goods.",
        "12\tDecember\t1947": "Patel's statement in the Parliament, \"\"Pakistan will get Rs. 750,000,000 from the balance in cash.",
        "12\tDecember\t1955": "The President promulgated an ordinance providing the usage of Hindi with English for official purposes of Indian Union. B.G. Kher Commission (under article 344(I) of the Constitution) constituted. Hindi Teaching Scheme was introduced under Ministry of Home Affairs.",
        "12\tDecember\t1958": "Fergie Gupte takes 9-102 with leggies vs West Indies at Kanpur.",
        "12\tDecember\t1959": "Krishnammachari Srikkanth, cricketer (big-hitting Indian opener 1981-92), was born in Madras.",
        "12\tDecember\t1961": "Portuguese civilians are evacuated amid fears of an Indian troop invasion at Goa, Daman and Diu.",
        "12\tDecember\t1964": "Maithili Sharan Gupta, famous Indian poet, Hindi litterateur, writer, social worker, patriot and Padma Bhushan awardee, died.",
        "12\tDecember\t1965": "Vijayanta, first India-made millitary tank which was handed over to the Army, was manufactured at Avadi Heavy Vehicles Factory at Madras.",
        "12\tDecember\t1971": "Sadik Gulam Muhammad, Chief Minister of Jammu and Kashmir, died.",
        "12\tDecember\t1976": "Madanlal Dhingra's ashes were brought to India.",
        "12\tDecember\t1989": "Air Chief Marshal (retd.) Arjan Singh named Delhi Lt. Governor.",
        "12\tDecember\t1991": "Violence in Karnataka over the centre's notification on Cauvery.",
        "12\tDecember\t1992": "Jasu Patel, cricketer, 29 wkts for India and best 9-69 vs Australia, passed away.",
        "12\tDecember\t1994": "N.T. Rama Rao, TDP leader in Andhra Pradesh, and Pavan Kumar Chamling, leader of Sikkim Democratic Front, take oath of office; Rishang Keishing of Manipur sworn in as CM; Liquor banned in AP by NT Rama Rao.",
        "12\tDecember\t1996": "India and Bangladesh arrive at a settlement to share Ganga water.",
        "12\tDecember\t1999": "Ram Prakash Gupta, Uttar Pradesh Chief Minister, said Ram temple issue is still on BJP's agenda.",
        "12\tDecember\t2000": "J.H. Patel, (71), senior Janata Dal (U) leader and former Karnataka Chief Minister, died in Bangalore."
    }
}