{
    "title": "Events for February 12",
    "events": {
        "1742": "Nana Phadnavis, one of the important members of Peshwa kingdom and the Maratha master-diplomat, was born.",
        "1794": "Alijabahadar Mahadaji Shinde passed away.",
        "1824": "Maharshi Dayanand Saraswati, founder of Arya Samaj, metaphysician, social reformer, religious leader, was born at Jeevapar Tankara, Kathiawad near Morbi.",
        "1871": "Charles Freer Andrews, great social worker, humanitarian, leader and a true friend of India, was born in New-Castle-on-Tyne in U.K.",
        "1882": "Satyendranath Dutt, famous Bengali poet, was born.",
        "1890": "Shastri A. R. Krishna was born.",
        "1922": "Mahatma Gandhi announce the withdrawal of non-cooperation movement.",
        "1928": "Lalit Mohan Sharma, former Chief Justice of Supreme Court, was born.",
        "1932": "Roby James Francis D. Silva, great industrialist, artist and designer, was born at Bombay.",
        "1946": "14 killed in Calcutta riots; Muslim leader Jinnah threatens civil war.",
        "1949": "Gundappa Ranganath Viswanath, cricketer (prolific Indian batsman of 70s), was born in Bhadravati, Mysore. He received Padmashree (1971) and Arjun Award (1978).",
        "1960": "Chinese army kills 12 Indian soldiers.",
        "1985": "Fire aboard M.V. Chidambaram, an Indian liner sailing from Singapore to Madras, killed 34 people.",
        "1987": "Mahamayaprasad Sinha, former Chief Minister of Bihar, passed away.",
        "1990": "Assembly election in Manipur.",
        "1993": "The baggage rules relaxed further.",
        "1995": "The 3-phase-budget session begins with the address of President Dr. Shankar Dayal Sharma in the joint sitting of Lok Sabha and Rajya Sabha.",
        "1996": "President S.D. Sharma in Kerala.",
        "1997": "Standard Bank tri-series final between India and South Africa abandoned due to rain.",
        "1998": "Om Prakash, 78, Hindi film comedian, passed away in Mumbai.",
        "1999": "The Centre dismisses the Rabri Devi Government in Bihar and imposes President's rule.",
        "2000": "17 persons, including 12 police personnel, die as naxalites strike terror during the first phase of polling for the Bihar Assembly."
    }
}