{
    "title": "Events for March 12",
    "events": {
        "1612": "Usman Khan Lohani, son of Isa Khan, was defeated in the battle of Nekujyal. He died as the last independent ruler of Bengal.",
        "1911": "Daman Div Dayanand Balkrishna Bandodkar, first Chief Minister of Goa, was born.",
        "1913": "Yashvantrao Balvantrao Chavan, first Chief Minister of Maharashtra, was born.",
        "1917": "Googie Withers, actress (1 of Our Aircraft is Missing), was born in Karachi, India.",
        "1930": "Mahatma Gandhi started Dandi March from Sabarmati Ashram near Ahmedabad to break salt law. This march stretched of 375 km. was covered in 26 days with 78 followers. The whole of India joined the campaign to boycott foreign goods and refused to pay taxes. Khan Abdul Ghafar Khan or Frontier Gandhi started Khudai Kidmatgar movement in the North-West Frontier. The Government went back to its brutal force and about 90,000 people were imprisoned within a year. In Peshawar, the Gharwal regiment refused to shoot a demonstrator. In Nagaland Rani Gaidilita, a 13 year old girl raised the flag against the Britishers and was put into life imprisonment in 1932. Nehru hearing this uttered A day will come when India will remember her and Cherish her. She was released after Independence.",
        "1938": "Vijay Laxman Mehra, cricketer (Indian Test batsman from age 17), was born in Amritsar.",
        "1941": "Chinese engineers leave to survey a route for the proposed 1,000-mile-long highway from Ningyuan, China to Assam, India.",
        "1942": "British troops vacate the Andaman  in Gulf of Bengal.",
        "1944": "No. 7 Squadron, which had flown its Vengeances on some missions against dissident tribesmen in North Waziristan, started operations in the Arakan from an airstrip at Uderbund near Kumbigram.",
        "1954": "Indian National Academy of Letters \"Sahitya Academy\" inaugurated by Dr. Radhakrishnan.",
        "1967": "Indira Gandhi became Prime Minister of India for the second time after winning the General Elections.",
        "1969": "Reactor Research Centre established at Kalpakkam. On 18th December 1985, it was renamed as Indira Gandhi Centre for Atomic Research.",
        "1972": "Vote gives Indira Gandhi 70 \\% of regional seats.",
        "1988": "Samresh Basu, famous Bengali writer, passed away.",
        "1991": "Lok Sabha Speaker Rabi Ray admits to an Opposition-sponsored motion for removal of the Supreme Court Judge V. Ramaswamy for alleged misappropriation of public funds, and sets up a three-Judge committee to investigate.",
        "1992": "The four-member break-away group of Telugu Desam recognised by Lok Sabha speaker.",
        "1993": "Powerful bomb blasts at twelve various places in Mumbai takes 317 lives.",
        "1995": "Congress party loses India national election.",
        "1996": "Last session of the 10th Lok Sabha ends.",
        "1997": "Jaspal Rana equals world mark in standard pistol 25m (ISU) event in South Asian shooting in Delhi."
    }
}