{
    "title": "Events for April 12",
    "events": {
        "1621": "Guru Teg Bahadur Singh, Sikh Guru, was born.",
        "1752": "Agreement to save the king between Shinde and Holkar.",
        "1799": "The Church Missionary Society was organized in London under the original name of the Society for Missions in Africa and the East. This Anglican missions agency currently works in fields located in Africa, Ceylon, India, Pakistan, Iran and Palestine.",
        "1801": "Ranjit Singh proclaimed himself Maharaja of Punjab.",
        "1871": "Gangadhar Balkrishna Deshpande, editor in modern era and dictionary creator, was born.",
        "1873": "Kumaran Asan, famous Malyalam poet and social reformer, was born at Kayikkara, Kerala.",
        "1912": "Kirpal Singh Narang, social reformer and educationist, was born at Amritsar (Punjab).",
        "1913": "Gandhiji in Indian Opinion draws attention to new Immigration Bill's failure to fulfil terms of Provisional Settlement of 1911. Kasturba decides to join Passive Resistance struggle.",
        "1917": "Mulvantrai Himatlal Mankad better known as \"Vinoo Mankad\", cricketer (India's greatest all-rounder to his time), was born at Jamnagar.",
        "1936": "Nehru urges Socialism for India.",
        "1942": "Nehru pledges 'no surrender' to the Axis despite the rejection of Britain's plans at New Delhi.",
        "1967": "U. Thant,UN Secretary General, receives the first Nehru Award for international understanding.",
        "1976": "India set 403 to win against the West Indies.",
        "1978": "India's first double decker train was started between Victoria Terminus (CST) and Pune which beared the name as \"Janta Express\", which is now known under the name of Shivaji's fort as \"Singhgarh Express\".",
        "1983": "Richard Attenborough's 'Gandhi' wins 8 Oscars.",
        "1987": "V. P. Singh resigns as Defence Minister of India, K. C. Pant appointed in his place.",
        "1991": "Lok Sabha elections announced for May 20, 23, 26; Punjab Assam, J&K polls deferred.",
        "1992": "The 350-tonne Buddha statue salvaged from the Hussain Sagar where it had sunk in 1990.",
        "1993": "Indian ship MV Vishva-Mohini sinks off Spain, 33 killed.",
        "1997": "Maharashtra assembly adopts bill banning interviews for admitting students to pre-primary schools.",
        "2000": "Ban on LTTE for two more years from May 14, says the Union Home Minister L. K. Advani."
    }
}