{
    "title": "Events for August 12",
    "events": {
        "1602": "Abul Fazal, Akbar's minister, was killed on the instructions of Jahangir.",
        "1868": "Frederick JNT Lord Chelmsford, Viceroy of British-India (1916-21), was born.",
        "1897": "Major Gegeral Himmat Singh, Governor of Himachal Pradesh and Duputy Defence Minister, was born.",
        "1905": "Japan, Britain reach an accord determining spheres of influence in Far East; India to remain with the British.",
        "1919": "Dr. Vikram Ambalal Sarabhai, the father of Indian space technology and scientist, was born at Ahmedabad.",
        "1922": "Chunilal Kalidas Madiya, famous Gujrati one-act player, play wright story writer and novelist, was born.",
        "1928": "The Olympic Games hosted by Amsterdam fully realized Pierre de Coubertin's vision: 'the nations of the world in friendly competition'. After a succession of Olympics dominated by North America and Western Europe, Amsterdam welcomed more than 3,000 competitors.",
        "1946": "Viceroy announces invitation to Congress to form provisional Government.",
        "1952": "Social Welfare Board inaugurated in the Parliament.",
        "1966": "Mihir Sen swam Dadenelis.",
        "1973": "Dayanand Balkrishna Bandodkar, first Chief Minister of Goa, Daman and Diu, died.",
        "1979": "Heavy rains resulted in bursting of a dam thus causing floods in Moorvi and Lilapur in Gujarat, killing over 1,335 people.",
        "1988": "S. R. Bommai elected Karnataka CM.",
        "1991": "Parliament passes the Terrorist and Disruptive Activities (prevention) amendment bill.",
        "1992": "72 militants surrendered before Punjab CM Beant Singh.",
        "1996": "Supreme Court stays further proceedings against Narasimha Rao in Chandraswami-Lakhubhai Pathak cheating case.",
        "1997": "Gulshan Kumar of Super Cassette Industries was shot dead by four unidentified persons in north-west Mumbai.",
        "1998": "Uttarancha State plan meets with difficulty owing to differences on inclusion of Udham Singh Nagar and Hardwar district.",
        "2000": "Neelam Jaswant Singh heaves the discus to a National mark (59.53m) in the Travancore National circuit athletics meet in Thiurvananthapuram."
    }
}