{
    "title": "Events for September 12",
    "events": {
        "1627": "Ibrahim Adilshah died.",
        "1686": "Aurangzeb ended Adilshah's kingdom. The garrison lost heart and surrendered Sikandar who was sent to the state prison at Daulatabad. Bijapur was invested and the city opened its gates to the Mughals. Bijapur as an independent kingdom ceased to exist.",
        "1779": "Garibdas, follower of Saint Kabir and founder of 'Garib Panth', died.",
        "1786": "Lord Cornwallis was appointed, and became Governor General of India, as well as the Commander-in-Chief Army Officer.",
        "1898": "Baldev Prasad Mishra, Hindi litterateur, was born.",
        "1899": "Vibhutibhushan Bandopadhyay, world famous Bengali novelist, was born.",
        "1905": "Anglo-Japanese treaty provides for Japan to help safeguard India at London.",
        "1912": "T. A. Ramachandran, cricket Test Umpire of one test during 1948-49, was born in Tamil Nadu.",
        "1922": "Chandradhar Sharma Guleri passed away.",
        "1931": "Triloki Nath Madan, educationist and journalist, was born at Srinagar, Kashmir.",
        "1932": "Vijaya Shriniwas Jahagirdas, famous Marathi story writer and poet, was born.",
        "1934": "Shantakumar Jagannath Sharma was born in Garhjamula, Distt. Kangra (Himachal Pradesh).",
        "1961": "Nalin Vilochan Sharma, great Hindi critic, died.",
        "1962": "Raghav Rangayya, famous Hindi poet, story writer and novelist, died.",
        "1965": "Army fights back heavy Indian tank attacks at Pakistan.",
        "1966": "Mihir Sen, famous Indian swimmer, crossed Darda Nailes Channel.",
        "1971": "Jaikishen, famous Hindi film music director, died.",
        "1974": "T. C. Yohannan at Teheran, sets record for LJ in 8.07.",
        "1990": "Konkan Railway project formally launched with the opening of a project office in Ratnagiri in Maharashtra State.",
        "1992": "Mallikarjun Bhimramayya Mansoor, famous Hindustani classical vocalist of Jaipur Gharana, died in Dharward, Karnataka at the age of 81 years.",
        "1993": "Former Chief Minister of Gujarat Hitendra Desai died.",
        "1994": "UN Secretary General Ghali visits New Delhi.",
        "1995": "Heavy rainfall in the Himalaya region, resulting in landslide, claimed 70 lives near Kullu.",
        "1998": "India, Malaysia sign an agreement on cooperation in science and technology in Kuala Lumpur."
    }
}