{
    "title": "Events for January 13",
    "events": {
        "1709": "Bahadhur Shah I defeated his brother Kam Bakhsh at Hydrabad as the Mughal Emperor consolidated his position.",
        "1849": "Sikhs again lost in Chillianwala in India but British suffered heavy casualties.",
        "1897": "On landing at Durbanairport, Gandhiji was mobbed by a crowd  excited by reports of his speeches in India on conditions of indentured Indian labour in South Africa.",
        "1911": "Satya Pal Gupta, educationist, was born at Aligarh.",
        "1926": "D. B. Pat, veteran leader OF 'Shetkari Kamgar Party', was born.",
        "1932": "Opening of the Lloyd Barrage or Sukkur Dam, the world's largest irrigation project.",
        "1938": "Shivkumar Sharma, famous Santoor player, was born.",
        "1940": "Sir Michael O'Dwyer, ex-governor of Punjab, murdered by an Indian in London.",
        "1948": "Kenia Hirjee Jayantilal, cricketer (5 at Kingston, 71 his only inns for India), was born in Hyderabad.",
        "1949": "Rakesh Sharma, first Indian cosmonaut (Soyuz T-11) to go in space, was born.",
        "1951": "Chandrika Premji Keniya, social worker, was born.",
        "1964": "200 die in Hindu-Muslim riot in Calcutta.",
        "1967": "Samachar Bharti inaugurated in New Delhi.",
        "1974": "Saraswatibai, famous music expert and classical singer, passed away.",
        "1993": "Bombay death toll rises to 550 raising the toll in the Ayodhya-related violence since December 6 to 753.",
        "1994": "Indian Airlines Bangalore-Madras A 320 Airbus with 56 passengers and seven crew hijacked.",
        "1995": "The 14th Indian Scientific Expedition to Antarctica, consisting of 63 members under the leadership of Dr. S.D.Sharma (Scientist, NPL), reaches Antarctica.",
        "1998": "Shambu Sen, 62, Hindi film music director and dance master, passed away in Mumbai of cereberal haemorrhage.",
        "1999": "Justice (retd.) Anshuman Singh, presently Governor of Gujarat, is appointed new Governor of Rajasthan.",
        "2000": "V.R. Nedunchezhiyan, (79), former Tamil Nadu Finance Minister and AIADMK chairman,  died in Chennai after a heart attack."
    }
}