{
    "title": "Events for November 13",
    "events": {
        "13\tNovember\t1780": "Maharaja Ranjit Singh, \"Lion of Punjab\",  was born.",
        "13\tNovember\t1901": "War Secretary Brodrick claimed that Boers were killing natives in large numbers. He intended to withdraw troops from India to fight in S. Africa at London.",
        "13\tNovember\t1908": "Yeshwantrao Hindurao Ghorpade, former ruler and great industrialist, was born.",
        "13\tNovember\t1909": "Gandhiji left England for South Africa and wrote ''Hind Swaraj'' on board S.S. Kildonan Castle.",
        "13\tNovember\t1917": "Gajanan Madhav, famous modern Hindi poet, critic and storywriter, was born.",
        "13\tNovember\t1922": "Mahadev Sadashivrao Ande, freedom fighter and political leader, was born.",
        "13\tNovember\t1935": "Chandra Prakash Gupta, great educationist, was born at Gaini in UP.",
        "13\tNovember\t1945": "Australian Services draw first Victory Test against India.",
        "13\tNovember\t1953": "Richard Nixon, the US Vice President, arrives in New Delhi.",
        "13\tNovember\t1962": "Yezdani Gulam, great researcher, archeologist and art critic, died.",
        "13\tNovember\t1970": "Flooding ravages Ganges delta. 200,000  million killed.",
        "13\tNovember\t1991": "Supreme Court orders establishment of an all-India judicial service.",
        "13\tNovember\t1992": "Dr. Pundalik Dattatrya Gaitonde, Goa freedom fighter, passed away.",
        "13\tNovember\t1993": "The Indian hospital and aviation was operational immediately. The Indian contingent formally took charge of the responsibility of the capital city of Mogadishu.",
        "13\tNovember\t1995": "The Supreme Court in an unanimous 65-page verdict declares that patients who received deficient services from the medical profession and hospitals were entitled to claim damages under the Consumer Protection Act, 1986.",
        "13\tNovember\t1998": "Tendulkar blazes as India wins the Coca Cola Cup at Sharjah beating Zimbabwe in the final.",
        "13\tNovember\t1999": "Punjab Police men, Railways women emerged Federation Cup basketball champions in Jalandhar."
    }
}