{
    "title": "Events for February 13",
    "events": {
        "1601": "John Lancaster leads 1st East India Company voyage from London.",
        "1713": "Sultan Jahandar Shah was strangled to death. Farrukhsiyar captured the throne of Delhi from Jahandar Shah with the assistance of two Sayyid brothers.",
        "1719": "Jahandar Shah was strangled to death and the Sayyid brothers were killed soon after.",
        "1856": "East India Company captured Lucknow along with Avadh Kingdom.",
        "1861": "Colonel Bernard Irwin attacks & defeats hostile Chiricahua Indians.",
        "1879": "Sarojini Naidu \"Nightingale of India\", was born at Hyderabad. She was the first Governor of Uttar Pradesh. She also holds a place of pride among the women freedom fighters of India. She presided over the Kanpur session of Indian National Congress and took active part in Salt Satyagraha and represented Indian women in Round Table Conference, London, 1931.",
        "1922": "The Indian National Congress suspends its civil disobedience campaign in the face of mounting violence.",
        "1936": "Dinsha Wachha, great Industrialist and social worker, passed away at Mumbai.",
        "1945": "Vinod Mehra, famous Hindi film actor, was born.",
        "1968": "Atal Bihari Vajpayee elected President of the All India Jan Sangha.",
        "1969": "Subroto Tara Banerjee, cricketer (Indian quickie & Dennis Lillee protegee), was born in Patna.",
        "1970": "Man-eating tiger is reported to have killed 48 people at a village 80-km from New Delhi.",
        "1977": "Jasawant Singh, famous physiologist, passed away.",
        "1984": "Indira Gandhi, Prime Minister, inaugurated the first manufacturing work of Indian Submarines at Mazgaon Dock, Bombay.",
        "1989": "Aubrey Menen (76), Renowned writer, passed away in Kerala.",
        "1991": "Surjit Singh Barnala resigns as Governor of Tamil Nadu.",
        "1993": "School collapses killing 21 pupils and 4 teachers.",
        "1994": "Dr. Krishnaprasad Mishra, 'Sahitya Academy Award'  winner, Oria novelist and short story writer, passed away.",
        "1997": "Deve Gowda, PM, dedicates the Rs. 3200-crore 480 MW Uri hydel project in north Kashmir to the nation.",
        "1998": "India signs two agreements with the U.N. Development Fund for a $13.75-million grant for food security and environment support.",
        "1999": "The 5th National Games were inaugurated by  President  K.R. Narayanan in Imphal."
    }
}