{
    "title": "Events for April 13",
    "events": {
        "1699": "Khalsa Panth established.",
        "1772": "Warren Hastings, who  became the president of their Bengal Council, was appointed in the court of Directors of the East India Company.",
        "1796": "The first elephant was brought to America from Bengal, India.",
        "1851": "Ganga Ram, great social reformer and an assistant engineer in the Public Works Department, Punjab, was born at Mangtanwala, now in Pakistan.",
        "1889": "Balkrishna A. Pillai, litterateur and journalist, was born.",
        "1890": "Ramchandra Gopal Torne (Dadasaheb), film director, was born.",
        "1919": "Jallianwala Baug massacre. The great Indian tragedy occured in Amritsar which claimed 389 lives and wounded 1,516 activitists fighting for Indian independence. Early in 1919, the Rowlatt Act (Black Act) was passed. This authorized the Government to imprison any person without any trial and conviction in a court of law. This furious act was under the guidence of cruel Brigedier General R. E. H. Dyer and his 50 men troop. Michael O' Dwyer was then the Governor of Punjab who naturally defended the action. This day is observed as Jallianwala Baug Day.",
        "1940": "Najma Heptulla, Vice President of Rajya Sabha, was born.",
        "1947": "Diplomatic relations between India and Russia established.",
        "1948": "Bhuvaneshwar became the capital of Orissa.",
        "1963": "Babu Gulab Rai, famous hindi critic, passed away.",
        "1971": "Carlton Chapman, Indian Soccer (Football) player, was born in Bangalore, Karnataka.",
        "1972": "Balraj Sahani, famous film actor, passed away.",
        "1982": "Pandit Parmanand, founder member of `Gather Party', passed away.",
        "1984": "Kerala Government drops Silent Valley Project and declares the entire area a national park.",
        "1988": "Mother Teresa asks Margret Thatcher for help to set up a hostel for London's elderly homeless in UK.",
        "1989": "Malayalam film 'Piravi' directed by Shaji N. Karun adjudged best feature film of 1988.",
        "1993": "Lalitadevi Shastri passed away.",
        "1994": "United Arab Emirates lost to India in its first official ODI.",
        "1997": "Paes-Bhupathi corner doubles glory in the Gold Flake Open tennis in Chennai.",
        "1999": "D. Sripada Rao, former Speaker of the Andhra Pradesh Assembly, is shot dead by People's War Group naxalites near Annaram village in Karimnagar district."
    }
}