{
    "title": "Events for May 13",
    "events": {
        "1648": "Construction of the Red Fort at Dehli was completed.",
        "1791": "Lord Cornwallis retreated back to Madras after the battle of Arikera.",
        "1857": "Sir Ronald Ross, bacteriologist, member of Indian Medical service, Nobel awardee and editor of 'Science Progress', was born at Almora, UP.",
        "1883": "Henk JFM Sneevliet, leader RSAP/editor Spartacus (Dutch-Indies), was born.",
        "1905": "Fakruddin Ali Ahmed, the fifth President of India, was born at Delhi.",
        "1916": "Vasudev Mahadev Salgaonkar, great Industrialist, was born.",
        "1918": "Balasarswati, famous dancer of Bharat Natyam, was born.",
        "1923": "Moinul Haque Choudhury, social reformer and politician, was born at Sonabarighat (Assam).",
        "1946": "Sarwate and Banerjee add 249 runs for the 10th wkt stand for Indians v Surrey.",
        "1949": "Maharashtra Granthalay Sangh was established.",
        "1952": "Pandit Jawaharlal Nehru again becomes the Prime Minister of India and forms a new union ministry.",
        "1953": "The first Indian Navy air station INS Garuda was commissioned at Venduruthy, the naval base in Cochin.",
        "1956": "Acharya Vinoba Bhave started the Bhoodan campaign in Tiruvellore.",
        "1962": "Dr. Zakir Hussain became the Vice President (1962-67).",
        "1967": "Dr. Zakhir Hussain became 3rd President of India. He was the first Muslim President of Indian Union. He held this position till August 24, 1969.",
        "1971": "General Insurance nationalized.",
        "1991": "P. Sudhir Kumar released in exchange for a few Naxals in jail.",
        "1994": "Telecom sector opened to private companies under the new national policy announced in Parliament.",
        "1995": "Renowned environmentalist Maurice F. Strong chosen for the Jawaharlal Nehru International Understanding awarded for 1992.",
        "1996": "M. Karunanidhi (DMK) sworn in as Tamil Nadu CM.",
        "1997": "Doordarshan drops plans to enter the direct-to-home (DTH) mode of television transmission.",
        "1998": "World Bank cancels India donors meet.",
        "2000": "The Union Government gives its approval for the creation of the three new states of Jharkhand, Uttaranchal and Chhattisgarh to be carved out of Bihar, Uttar Pradesh and Madhya Pradesh."
    }
}