{
    "title": "Events for June 13",
    "events": {
        "1290": "Firuz Shah captured the throne of Delhi and Sultan Jalal'ud-din Khalji called himself.",
        "1731": "Swedish East India Company was formed. For 15 years King Fredrick of Sweden gave the Company a charter.",
        "1757": "Clive marched to Murshidabad against Nawab Siraj ud-Daulah along with the force comprising of 1800 British and 2000 Indian soldiers with eight canons.",
        "1879": "Ganesh Damodar (Babarao) Savarkar, revolutionary, was born.",
        "1889": "Salarjung, famous administrator, was born.",
        "1905": "Kumar Shri Duleepsinhji, cricketer (England 1929-31), was born.",
        "1909": "E. M. S. Namboodiripad was born in Palghat in Kerala.",
        "1918": "Foundation stone was liad of Sir Kawasjee Jahangir Public Hall in Mumbai.",
        "1927": "Henry C. K. \"Clan\" Petty-Fitzmaurice, Governor of India (1888-94), passed away at the age of 82.",
        "1931": "Gandhi to live in a garret amongst the poor in London.",
        "1932": "Nirmalchandra Sen, great revolutionary, died.",
        "1940": "Revolutionary leader Udham Singh was hanged for charges of assassinating Micheal Odair, who was the Governor General of Punjab at the time of Jalianwala Baug massacre.",
        "1943": "Netaji Subhashchandra Bose started his journey from Germany to Tokyo by a submarine.",
        "1965": "Maninder Singh Harbansingh Billa, cricketer (Indian leftarm spinner in 35 Tests 1982-93), was born in Pune.",
        "1966": "60 people were killed in a collision between two suburban trains of Bombay.",
        "1973": "Sir Ram Nath Chopra, great professor of Pharmacology of  National Drug Research Institute of India, passed away.",
        "1991": "Shiv Sharma, Doordarshan Director General, was shot at in Delhi by suspected Punjab terrorists.",
        "1992": "Purushottam Diwakar Dhavle, famous journalist, passed away.",
        "1995": "India and France sign Bilateral Investment Protection pact.",
        "1996": "Ramakrishna Hegde, JD leader and former Karnataka CM, expelled from the party for 6 years by JD president Laloo Prasad Yadav for anti-party activities.",
        "1997": "At least 60 persons were feared killed and several injured in a fire in Uphaar Grand cinema in South Delhi.",
        "1998": "India rejects G-8 prescriptions saying they are ''coercive and intrusive'' and intend to freeze the nuclear weapon capabilities of New Delhi and Islamabad.",
        "1999": "The Indian army secures the strategic Tololing peak in the Dras sector.",
        "2000": "Yashwant Sinha, Finance Minister, announces a one-time settlement of outstanding loans below Rs. 10 crores in a move aimed at ridding the public sector banks of Rs. 51,000 crores of bad loans."
    }
}