{
    "title": "Events for August 13",
    "events": {
        "1638": "Durgadas Rathore, social reformer, was born at Salwa.",
        "1784": "East India Company was appointed as the centralised Regulatory Authority through India by Pitt's India Act, which was accepted in British Parliament in England.",
        "1795": "Ahilyabai Holkar passed away at the age of 70.",
        "1911": "Guha Phulrenu, social worker, was born.",
        "1913": "Khawtin Khuma, politician, was born at Phuldungsei, Tripura.",
        "1928": "Nationalists issue a draft constitution calling for dominion status and a two-chamber parliament.",
        "1936": "Madam Bhikaji Rustom Cama, freedom fighter, Indian lady revolutionary and politician, passed away at Bombay.",
        "1943": "Chintamanrao Deshmukh was first Indian to be appointed Governor of Reserve Bank.",
        "1947": "Riots sweep Lahore in Punjab; mobs stone Gandhi's house.",
        "1951": "Acharya Kishoridas Vajpayee passed away.",
        "1953": "Durgabai Deshmukh became the founder Chairperson of Central Social Welfare Board, which involved several voluntary organisations and workers carrying  out programs like education, training and rehabilitation of needy women etc.",
        "1954": "Nehru says dispute over Portuguese colonies in India must be settled peacefully.",
        "1956": "National Highways Act was approved by the Parliament of India.",
        "1960": "Marmik' weekly magzine published.",
        "1963": "Sisir Kumar Mitra,  Physics scientist, died at the age of 73.",
        "1988": "Gajanan Jagirdar, great actor and director in Indian film industry, died.",
        "1993": "Rama Rao vows not to return to the house unless the government is ousted.",
        "1995": "Kashmiri separatists behead a kidnapped Norwegian tourist and threatened to kill other hostages unless India freed 15 militants at Srinagar.",
        "1997": "The contentious women's reservation bill put on the back burner with PM Gujral saying govt. would not push through such a major social legislation until there was a consensus on it.",
        "1998": "India signs two agreements with the World Bank for concessional credit through the International Development Association for $115.4 million.",
        "2000": "The Government announces the opening up of the national long distance communication segment with no restriction on the number of players."
    }
}