{
    "title": "Events for November 14",
    "events": {
        "1681": "East India Company declared Bengal as a seperate presidency.",
        "1889": "Jawaharlal Nehru, first Prime Minister of India, was born. To commemorate his birthday, this day is observed as 'Children's Day'  from 1957.",
        "1914": "Eight Language panel were started on the Rs. five denomination again. The printing colour of note was red. These languages were Urdu, Telugu, Kaithi, Tamil, Bengali, Kannada, Burmese and Gujarati.",
        "1919": "Anantrao Bhalerao, freedom fighter, journalist and editor of daily news paper \"Marathawada\", was born.",
        "1926": "Piloo H. Mody, social reformer, politician and architect, was born at Bombay.",
        "1955": "Employees' State Insurance Corporation was inaugurated by the President.",
        "1957": "Children's Day.",
        "1959": "Nehru rejects China's proposal for a mutual withdrawal of troops from a border buffer zone.",
        "1964": "Nehru Commemorative coin is released.",
        "1967": "Kanakaiya Nayudu Colonel Cottari , cricketer (7 Tests for India in 30's), passed away at Indore.",
        "1969": "Jawaharlal Nehru University inaugurated in New Delhi.",
        "1993": "Dr. Manibhai Desai, great Gandhian and social worker, passed away.",
        "1995": "Supreme Court gave patients the right to drag careless doctors to Court.",
        "1996": "Competition Post Card', a new category of postcard, priced Rs. 2 introduced.",
        "1997": "N. V. N. Somu, Union Minister of State for Defence and president of The Hindu Office and National Press Employees Union from 1969, died in Army Helicopter crash at Tezpur in Arunachal Pradesh.",
        "1998": "Prominent Indian Government and private entities are targeted in the Clinton Administration Entities List. American Companies are barred from trading with the listed companies.",
        "2000": "Jharkhand, the 28th State of the Indian Union, comes into being and the new Governor, Prabhat Kumar, and the Chief Minister, Babulal Marandi, take office."
    }
}