{
    "title": "Events for December 14",
    "events": {
        "14\tDecember\t1812": "Lord Charles Caning, Governor General and Viceroy of India (1856-1862), was born.",
        "14\tDecember\t1864": "Jagat Narayan, law expert and educationist, was born.",
        "14\tDecember\t1895": "George VI, King of England (1936-52), was born.",
        "14\tDecember\t1901": "Gandhiji reaches Rajkot via Porbunder.",
        "14\tDecember\t1910": "Upendranath Ashok, noted writer, was born.",
        "14\tDecember\t1920": "Akali Dal established.",
        "14\tDecember\t1924": "Ranbir Raj Kapoor, famous film producer, director and actor, was born.",
        "14\tDecember\t1931": "Viceroy of India issues new powers to seize properties of those who, following independence leader Gandhi, refuse to pay taxes.",
        "14\tDecember\t1936": "Kamalkant Bhattacharya, Assamese thinker and author, passed away.",
        "14\tDecember\t1946": "Sanjay Gandhi, youth Congress leader, was born in New Delhi.",
        "14\tDecember\t1952": "Roshan Harshadlal \"Deepak\" Shodhan scored 110 in his Test Cricket debut vs Pakistan in Calcutta.",
        "14\tDecember\t1953": "Vijay Amritraj, great Indian tennis player and actor (Octopussy), was born.",
        "14\tDecember\t1955": "Henry Heras, famous artist and an active member of the Indian Historical Records Commission, died in Bombay.",
        "14\tDecember\t1962": "Bharathi Arun, cricketer (Indian pace bowler late-80's), was born in Vijayawada.",
        "14\tDecember\t1968": "Chaggan Baba (Chagganlal Karamshi Parekh), great social worker and founder of Mahila Griha Udyog and Lijjat Papad, died.",
        "14\tDecember\t1969": "Bishen Bedi takes 7-98 (career-best) v Australia at Calcutta.",
        "14\tDecember\t1979": "Nirode Ranjan Chowdhury, cricketer, two Tests for India and bowling average of  205, died.",
        "14\tDecember\t1984": "First MIG 27M aircraft assembled by Hindustan Aeronautics Ltd. takes off.",
        "14\tDecember\t1985": "Rajiv Gandhi joins the leaders of Greece, Sweden, Tanzania, Mexico and Argentina in a tele-conference as part of the UN ceremony at which they are honoured with the 'Beyond War' award.",
        "14\tDecember\t1990": "Vijay Karan became the director of Central Bureau of Investigation (till 01/06/92).",
        "14\tDecember\t1992": "Balasaheb Deora, RSS chief, kept under house arrest. National head quarters of the party in New Delhi sealed.",
        "14\tDecember\t1994": "10 IAF personnel of the first batch were reinducted and the last batch left on 20th Dec 94. Cpl Nasir was left as a lying casualty due to injuries sustained in the RPG explosion.",
        "14\tDecember\t1998": "The Supreme Court allows Karnataka to begin skeletal work on erection of 26 crest gates at the Almatti dam on the Krishna at ''its own risk and cost'', but directs it not to raise the dam height beyond the present 509 metres.",
        "14\tDecember\t1999": "The Prime Minister informs the Lok Sabha that  Ram Prakash Gupta has denied the remarks on temple construction.",
        "14\tDecember\t2000": "The Government declares the 10-day old postal strike illegal as per the provisions of the Industrial Dispute Act."
    }
}