{
    "title": "Events for January 14",
    "events": {
        "1592": "Sjihab al-Din Sultan Choerram Sjah Djahan, leader of India, was born.",
        "1641": "United East Indian Company conquers city of Malakka, 7,000 killed.",
        "1758": "Emperor of England's charter allowed the East India Company to keep to any booty taken in war against the enemies of the king and the company. The confisticated goods, after the war, could be kept with them.",
        "1760": "Eyree Coote, British Army Captain, captured and surrendered Pondicherry, capitulated French General Lally.",
        "1761": "The third and last battle of Panipat, fought between the Marathas and the Afghan invader Ahmad Shah Abadli, started. The Marathas lost 28,000 soldiers and were virtually routed in North India thus ending the Maratha hegemony.",
        "1773": "Amstored Lord William Piet, governor, was born.",
        "1843": "Fakir Mohan Senapati, great writer and nationalist, was born.",
        "1851": "Peshwa Bajirao Raghunath, last Peshwa of Marathas, passed away at Brahmawart.",
        "1882": "Maharshi Raghunath Dhondo Karve, father of Family Planning and Sex Education, was born.",
        "1896": "Chintaman Dwarkanath Deshmukh, former Finance Minister of  India, was born.",
        "1905": "Durga Khote, Marathi stage artist and actress, was born.",
        "1926": "Mahashweta Devi was born at Jinda Bahar Lane, Dhaka.",
        "1927": "M. Aram, famous Hindi writer and educationist, was born in Kulasekharapatnam at Madras .",
        "1938": "Belur Math, new temple, was consecrated in Calcutta.",
        "1946": "Two jetties collapse in Ganges; 160 Hindu pilgrims are crushed.",
        "1948": "First issue of Marathi daily newspaper 'Loksatta' was published.",
        "1959": "Indira Gandhi, Nehru's daughter, emerges as leading choice for president in New Delhi.",
        "1964": "Bapu Nadkarni bowled 32-27-5-0 vs England, 21 maiden overs in a row.",
        "1969": "Madras State renamed Tamil Nadu.",
        "1980": "Indira Gandhi was sworn in as the Prime Minister of India. She held the office till she was assassinated on October 31, 1984.",
        "1982": "First Antarctic Expedition on December 1981-Jan 1982; group of 21 Indian scientists team led by S. Z. Qasim reached Antarctica successfully.",
        "1984": "Gujarati Daily 'Samkalin' of Indian Express Group published.",
        "1985": "Dr. Nagendra Singh elected World Court Chief.",
        "1989": "'Poorna Kumbh', India's largest religious gathering held once in 12 years, begins at Allahabad.",
        "1990": "J&K Governor quits.",
        "1991": "Chitragupta, famous film music director, passed away.",
        "1993": "The Supreme Court absolves Railway Minister Jaffer Sharief of corruption charges in the wagon deal with Asea Brown Boveri.",
        "1994": "C. V. Waran, veteran freedom fighter and social worker, passed away.",
        "1995": "Ban on VHP re-imposed.",
        "1998": "The Prime Ministers of India, Pakistan and Bangladesh come together for a three-nation business summit in Dhaka.",
        "1999": "At least 51 persons are killed and several injured in a stampede at a hilltop at Pampa on the foothills of Sabarimala in Kerala."
    }
}