{
    "title": "Events for October 14",
    "events": {
        "1884": "Lala Har Dayal, revolutionary, nationalist and freedom fighter, was born at Delhi.",
        "1885": "Mukandi Lal, famous Hindi writer, was born in Chamoli at U.P.",
        "1910": "Further unrest took place in Lhasa, Tibet, following the arrest of Dalai Lama's agent by the Chinese on the Chinese frontier with India.",
        "1919": "Raghu Karmkar, famous cinephotographer, was born.",
        "1930": "The Flag of Freedom' or 'Swaraj Toran' a feature film produced by Prabhat Film Co.Kolhapur was prohibited by the Censor Board on October 14, 1930 on the grounds that it was objectionable in the existing political situation. The film, however, was cleared only after deleting certain portions and the title changed to 'Udaykal'.",
        "1940": "Cliff Richards [Harry Webb], rock vocalist, was born in Lucknow, India.",
        "1947": "Narsingh Chintaman Kelkar, great litterateur, politician and editor, died.",
        "1953": "Raghunath Dhondo Karve, Family Planning and Sex Education preacher, died.",
        "1955": "Colombo Plan conference held at New Delhi pleas for technological aid to Asia .",
        "1956": "Dr. Bhimrao Ramji, Ambedkar and about two lakh scheduled caste men and women embraced Buddhism in Nagpur.",
        "1980": "S. N. Banerjee, cricketer--one Test for India and 249 runs 10th wkt stand on tour, died.",
        "1985": "Assam Ganparishad established.",
        "1989": "Election Commission accepted Shiv Sena as a political party.",
        "1991": "Prasannakumar Abhyankar, senior journalist, died.",
        "1992": "10 Indians sentenced to six years in jail in the UAE on account of staging a play in Sharjah.",
        "1994": "Setu Madhavrao Pagdi, researcher and historian, died.",
        "1996": "Sukh Ram granted bail.",
        "1997": "Queen Elizabeth and Prince Philip visit Amritsar and spend time at the Jallianwala Bagh and Golden Temple complex.",
        "1998": "Prof. Amartya Sen was awarded the 1998 Nobel Prize for Economics. He became the sixth Indian, by birth or citizenship, to win a Nobel.",
        "1999": "Sheikh Shamim, an Indian, is hanged for espionage in Pakistan."
    }
}