{
    "title": "Events for February 14",
    "events": {
        "1483": "Zahir Al-Din Muhammad Babur Shah (1526-30), prince and founder of Mughal dynasty in India, was born.",
        "1556": "Mughal Emperor Akbar was proclaimed as successor of Humayun at the age of tewelve years at Kalanur, Gurudaspur district, Punjab.  Akbar (1542-1605), grandson of Babur, became third Mughal Emperor at the age of 13 years. He de-established Islam as state religion and declared himself impartial ruler of Hindus and Muslims. He also encouraged Art, Culture and Religious Tolerance.",
        "1628": "5th Mughal Emperor Shahjahan was crowned.",
        "1658": "Dara Sulaiman Shukoh was defeated in the struggle for Delhi throne Shuja's in the battle of Bahadurpur near Varanasi.",
        "1755": "Raghuji Bhosle, great fighter of Bhosle gharana in Nagpur, passed away.",
        "1807": "Khanderao Holkar, one of the sardars in Peshwa kingdom, passed away.",
        "1881": "Rajendra Lal Dutta and M.M.Basu established the first Homoeopathic Medical College and Hospital  in Calcutta.",
        "1891": "Stephen Smith, greatest pioneer of air borne mail, was born at Strawberry Hill, Shillong, Assam.",
        "1901": "King Edward VII open's his first parliament.",
        "1914": "Vinaya Kumar Parashar, journalist and social worker, was born at Hemgir, M.P.",
        "1922": "Bhimsen Joshi, great singer and composer, was born.",
        "1924": "Ikramullah (Ikram Sagri) Khan, famous Hindi poet, was born at Rehli in Madhya Pradesh.",
        "1925": "Mohan Dhariya, politician and nature lover, was born.",
        "1929": "Devendra Lal was born in Varanasi. He made extensive studies of meteorites of Lunar rocks brought by the Apollo and Luna Missions and of material from the Ocean bed. He also evolved techniques to understand post events in the solar system from cosmic ray \"Signatures\". One of his most significant findings is that the intensity of cosmic rays during the last few million years has been the same as it is today. He was a geophysicist associated with the Physical Research Laboratory, Ahmedabad.",
        "1932": "Madhubala (Mumtaj Begam), film actress, was born.",
        "1933": "W. R. Sonar, famous marathi poet, author, playwright, editor and publisher, was born.",
        "1952": "Smt. Sushma Kaushal Swaraj was born in Ambala Cantt. (Haryana).",
        "1959": "Nehru tells the International Conference on Planned Parenthood that Indian family planning efforts have not stopped population growth.",
        "1967": "4th Parliamentary Lok Sabha Election was held and the election process was completed on 15/02/1967.",
        "1970": "Supreme Court holds nationalization of banks illegal. Presidential ordinance revalidates nationalization.",
        "1976": "Urban Land Ceiling Regulation Act comes into force.",
        "1985": "Dr. Nagendra Singh elected World Court Chief.",
        "1989": "Supreme Court orders Union Carbide Coporation of USA and Union Carbide India Limited to pay $470 millions (about Rs. 710 crores) in full and final settlement of all claims out of the Bhopal gas Disaster Litigation tragedy of 1985.",
        "1990": "An Indian Airlines Airbus crashes at Bangalore killing 92 people.",
        "1994": "V. P. Singh elected JD Chief in place of S.R. Bommai who stepped down.",
        "1996": "Supreme Court orders CBI probe into a housing scam in which 8,700 govt. houses were allotted out-of-turn.",
        "1998": "13 bomb blasts take place in Coimbatore an hour before the BJP president Advani was to address a campaign meeting; 52 people killed.",
        "1999": "Fifth National Games inaugurated at Imphal.",
        "2000": "The Supreme Court stays the Karnataka High Court judgment quashing the State Government's Ashraya scheme for providing plots to the poor."
    }
}