{
    "title": "Events for April 14",
    "events": {
        "1469": "Sikh Guru, Guru Nanak Dev, was born on Baisakhi in a Khatri family in Talwandi Rae Bhoe in Pakistan, known as Nankana Sahib. Guru Nanak's birthday has been traditionally celebrated on Katik Poornamashi. Althought the correct birth date has been established as Vaisakh 1 (April 14), it will continue to be celebrated on Katik Poornamashi until such time as it is changed to Vaisakh 1. (Most Sikhs in the present day consider themselves members of a separate religion.).",
        "1563": "Guru Arjun Dev, Sikh Guru, was born.",
        "1659": "Aurangzeb defeated his brother Dara Shukoh to capture the throne of Delhi.",
        "1772": "Ahmadshah Abdali passed away.",
        "1891": "Dr. Bhimrao Ramji 'Babasaheb' Ambedkar, India's great social reformer, politician, author, architect, lawyer and agitator, was born in Maharashtra.",
        "1905": "Earthquake at Kangra region in Himachal.",
        "1907": "P. C. Joshi, famous Leftist leader and thinker, was born.",
        "1914": "Takli Shivshankar, famous Malyalam novelist and short story writer, was born.",
        "1916": "Commandur Rajagopalachari Rangachari, cricketer (India 1947-48), was born at Mamandur, Tamil Nadu.",
        "1919": "Gandhiji confesses at Nadiad his \"Himalayan Miscalculation\" regarding satyagraha martial law declared in Punjab.",
        "1925": "Harisingh Gogumal Kishanchand, cricketer (5 Tests for India 1947-52), was born in Karachi.",
        "1941": "Julie Christie, actress (Dr Zhivago), was born in Assam, India.",
        "1944": "Blast in ammunition loaded on 1,318 tonned freighter 'S. S. Fort Stikine' which was anchored in Victoria Dock at Bombay. The explosion killed 1376 people, wrecking 27 ships and destroying 40,000 tons of food.",
        "1948": "Law about Atomic Energy implemented in India.",
        "1950": "Sri Raman Maharshi, modern south Indian saint, passed away .",
        "1952": "Three integrated Railway Zones, Northern, North Eastern and Eastern inaugurated.",
        "1962": "Sir Mokshagundam Vivesvaraya, father of modern engineering, passed away at the age of 102. He was receipent of \"Bharat Ratna\" Award.",
        "1963": "Maha Pandit Rahul Sanskrityayan, great Hindi writer, politician and professor, passed away at Darjeeling.",
        "1979": "Sanjiva Reddy,President, flagged off the first electric train in Madras.",
        "1988": "Ashok Kumar, actor,  recieved the Dada Saheb Phalke Award.",
        "1989": "Ranjan Roy, captain of Indian Navy, and his wife Rupali Roy started off in a Maruti car.",
        "1990": "Veena Vidwan S. Balachander passed away.",
        "1991": "NF promises 5-10\\% jobs to economically backward sections among the upper castes.",
        "1992": "The 79th Plenary session of the Indian National Congress opens in Tirupati.",
        "1993": "The Cabinet Committee approves delicensing of car, refrigerator and leather goods industries.",
        "1995": "India beats Sri Lanka to win the Asia Cricket Cup final in Sharjah.",
        "1998": "Kushabhau Thakre is declared elected BJP president.",
        "2000": "The AIADMK expels senior leaders Sedapatti R. Muthiah,  S. Raghupathy and Karuppusamy Pandian for ''anti-party activities''."
    }
}