{
    "title": "Events for May 14",
    "events": {
        "1657": "Dharmavir Chhatrapati Sambhaji Maharaj was born on Purandar fort.",
        "1907": "Muhammad Ayub Khan, Pakistani president, was born.",
        "1914": "Ekanath Dattatreya Kulkarni, educationist and writer, was born at Bhaloni, Tal Pandharpur.",
        "1923": "Narayan Ganesh Chandavarkar, one of the founder members of Indian Congress and social reformer, passed away.",
        "1953": "Y. N. Sukthankar was appointed as the Cabinet Secretary of India. He held this office till 31-07-1957.",
        "1954": "President issues an order extending application of Indian Constitution to Kashmir with the concurrence of the State government.",
        "1956": "Govt announces that decimal coinage will be introduced in India from April 1, 1957.",
        "1960": "The first plane of India flew upto New York.",
        "1963": "Dr. Raghuvir, a famous linguist and President of Jansangh, passed away.",
        "1972": "Fighting between Indian and Pakistani forces along the Kashmir border reported.",
        "1976": "Pakistan and India agree to resume diplomatic ties.",
        "1978": "Jagdishchandra Mathur, modern Hindi playwright, passed away.",
        "1982": "All India Radio renamed as 'Akashwani' but it's Urdu service yet announces that it's All India Radio.",
        "1992": "LTTE banned in India.",
        "1993": "Justice V. Ramaswamy decides to resign.",
        "1994": "RBI announces tight monetary policy.",
        "1995": "Major train accident near Salem when KK Express collides with goods train killing 51 people.",
        "1996": "H.D. Deve Gowda elected leader of the third front as its prime ministerial candidate.",
        "1998": "India will not sign CTBT unconditionally, says the Prime Minister.",
        "1999": "Gurucharan Singh Tohra is expelled from Shiromani Akali Dal.",
        "2000": "L. K. Advani, Union Home Minister, announces extension of the ban on the LTTE by two more years."
    }
}