{
    "title": "Events for November 15",
    "events": {
        "1621": "Jahangir captured Kakda Fort.",
        "1817": "Battle of Yerwada.",
        "1830": "Ram Mohun Roy sailed for England. He was the first Indian Brahmin (then 'Brahmo') to go to England.",
        "1875": "Birsa Munda, freedom fighter and leader, was born at Ulihatu, Ranchi district, Bihar.",
        "1911": "First meeting of the governing body of the Indian Research Fund Association (IRFA) was held at the Plague Laboratory, Bombay, under the Chairmanship of Sir Harcourt Butler.",
        "1913": "Rabindranath Tagore (1861-1941), received the message that he was awarded with Noble Prize in literature for his collection of poems \"Gitanjali\" . He was the first Indian to be awarded with Noble Prize.",
        "1920": "Assembly meeting of the League of Nations.",
        "1921": "16 Gurkha troops killed by anti-British rebels.",
        "1932": "Surinder Kumar Mehra, Air Chief Marshal, was born in Delhi.",
        "1937": "Jayshankar Prasad, famous Hindi writer, died. His works include the epic (mahakavya) \"Kamayanee\" and plays \"Chandra Gupt\" and \"Skand Gupt\".",
        "1949": "Nathuram Vinayak Godse and Narayan Dattatreya Apte were hanged in Ambala Jail for Gandhi's murder.",
        "1982": "S. N. Katkar, famous poet and former editor of 'Yugvani', died.",
        "1988": "Dalai Lama agreed for less then independent country to save the cultural heritage of Tibet.",
        "1989": "Test debut of Sachin Tendulkar and Waqar Yunus at Karachi.",
        "1991": "Insurance official Dr. S.L. Khosa freed in Kashmir in exchange for a militant.",
        "1992": "Praveen Amre scores century (103) on Test Cricket debut vs South Africa at Durban.",
        "1993": "Supreme Court rules that the CEC is supreme.",
        "1995": "Qiao Shi, Chairman of the standing committee of the Chinese National Peoples' Congress, arrives in New Delhi to advance Sino-Indian relations.",
        "1997": "INS Delhi' commissioned.",
        "1998": "Naresh & Girdhari Lal Yadav win the National Enterprise sailing championship in Mumbai.",
        "1999": "The no-confidence motion moved against Om Prakash Chautala by the opposition failed in Haryana.",
        "2000": "Congress(I) gives a thumping mandate to Sonia Gandhi."
    }
}