{
    "title": "Events for December 15",
    "events": {
        "15\tDecember\t1675": "Guru Tegh Bahadur was beheaded in Delhi by Aurangzeb for his refusal to embrace him.",
        "15\tDecember\t1749": "Shahu Chattrapati, grandson of Shivaji, died.",
        "15\tDecember\t1803": "East India Company captured Orrisa state.",
        "15\tDecember\t1859": "S. Kasturiranga Ayengar, owner of Hindu newspaper, was born.",
        "15\tDecember\t1894": "Saraswatibai, famous singer and classical music expert, was born.",
        "15\tDecember\t1908": "Swami Ranga Natahananda, was born at Trikkur, Kerala.",
        "15\tDecember\t1912": "Aspy Merwan, engineer and who became the Air Marchal of India, was born.",
        "15\tDecember\t1932": "Tirunellai Narayana Iyer Seshan, Chief Election Commissioner of India, was born.",
        "15\tDecember\t1943": "The Vengeance suffered numerous defects and teething troubles, necessitating temporary withdrawal from the two IAF squadrons, but the problems were eventually mitigated if not eradicated, and No. 8 Sqn flew its first operational Vengeance sorties against Japanese targets from Double Moorings, Chittagong.",
        "15\tDecember\t1950": "Sardar Vallabhbhai Patel, first deputy Prime Minister of independent India also known as the 'Iron Man' and Bharat Ratna awardee, died.",
        "15\tDecember\t1951": "Scindia's SS Jal Pushpa launched.",
        "15\tDecember\t1957": "60 Harijans enter the Vishwanath Temple at Varanasi.",
        "15\tDecember\t1965": "Third cyclone of the year kills another 15,000 at mouths of Ganges river.",
        "15\tDecember\t1974": "Rasulatbai, veteran classical music expert, died.",
        "15\tDecember\t1976": "Daily newspaper \"Lokmat\" published it's first Jalgaon edition.",
        "15\tDecember\t1980": "Hema Chengkalath, female Soccer(Football) player, was born in Calgary, Canada.",
        "15\tDecember\t1988": "Landslide victory for GNLF in Darjeeling Gorkha Hill Council elections.",
        "15\tDecember\t1991": "Satyajit Ray, film maestro, awarded Special Oscar for his lifetime achievement.",
        "15\tDecember\t1992": "BJP Governments of Sunderlal Patwa (MP), Shanta Kumar (HP) and Bhairon Singh Shekhawat (Rajasthan) dismissed.",
        "15\tDecember\t1995": "Rajya Sabha approves extension of President's rule in J & K for a further period of 6 months and also passes Government resolution approving imposition of President's rule in UP.",
        "15\tDecember\t1997": "Orissa Janata Dal unit splits with 29 of 43 Legislature Party members forming 'Biju Janata Dal'.",
        "15\tDecember\t1999": "Yashwant Sinha, Finance Minister, arrives in Berlin to attend G-20 meet."
    }
}