{
    "title": "Events for October 15",
    "events": {
        "1542": "Akbar Abul-Fath Djalaluddin,  third Mughal Emperor of India (1556-1605), was born at Amarkot in Sind under the protection of Rana Virsal. Humayun had also taken refuge at Amarkot.",
        "1676": "King of England permitted the East India Company to mint the Rupee and Paisa coins at Bombay.",
        "1686": "Aurangzeb attacked and conqured Bijapur and this was the end of the Muslim Adilshahi's era.",
        "1866": "Vasudevacharya Kerur, famous Kannad novelist, playwright and journalist, was born.",
        "1888": "Gopal Ganesh Agarkar started daily newspaper 'Sudharak'.",
        "1899": "Menka (Lady Lila Sokhi), famous Indian dancer, was born.",
        "1902": "Bhaurao Krishnarao Gaekwad, great leader, was born. He was a colleagu of Dr. Babasaheb Ambedkar.",
        "1915": "Dr. I. Gopalkrishnan, Cricket Test Umpire for 7 tests from 1960-67, was born in Tamil Nadu.",
        "1918": "Shirdi ke Saibaba' better known as 'Saibaba' passed away at Shirdi near Nashik, Maharashtra. He was around 70. Born in a Brahmin family at Patri village in Hyderabad, he was saint to all caste and creed people.",
        "1921": "Suryanarayannamurty Rebbapragada, social reformer, college principal and journalist, was born at Rajahmundry in A.P.",
        "1931": "Avil Pakir Jalaluddin Abdul Kalam better known as \"APJ Abdul Kalam\", famous Indian scientist and past President of India, was born in the temple town of Rameswaram in Tamil Nadu. He is the pioneer of India's missile programme and was awarded  the country's highest civilian award, Bharat Ratna, in 1997, for his immense and valuable contribution to  scientific research and modernisation of defence technology.",
        "1932": "First Indian commercial airliner service 'Tata Sons Ltd' (Tata Airlines) started.",
        "1943": "Baba Kanshi Ram, freedom fighter and social reformer, passed away.",
        "1946": "Victor Banerjee, actor (A Passage to India), was born in Calcutta, India.",
        "1949": "Process of the integration of the Indian State was completed when the last three states - Tripura, Manipur and Banaras were merged.",
        "1961": "Suryakant Tripathi 'Nirala', famous Hindi poet, writer, editor, social worker and litterateur, died in Allahabad.",
        "1972": "Nirmalkumar Bose, great Indian human scientist, died.",
        "1977": "The Congress party denies bid by Indira Gandhi to regain leadership.",
        "1987": "Times Eye Research Foundation was established in Amritsar, India.",
        "1990": "Bharat Ratna, India's highest award, was given to Dr. Nelson Rolihlahla Mandela (b-1918), the South African black nationalist leader who arrived in India on a five-day visit. He is the first non-Asian to get this honour.",
        "1992": "Talwinder Singh Parmar, the Babbar Khalsa founder who masterminded the Kanishka jumbo explosion of 1985, was shot by security forces in Punjab.",
        "1994": "SROSS-C2, Indian Remote Sensing Satellite (IRS-P2), which carried remote sensing payload,  was placed in orbit. It was the second developmental launch of PSLV.",
        "1995": "PM leaves for a 12-day tour of Egypt, NAM Summit at Cartagena in Columbia and  50th year United Nations celebrations at New York.",
        "1996": "Kerala CM Nayanar says Governors are not necessary in states.",
        "1997": "Arundhati Roy, Delhi-based author wins Britain's most prestigious literary award 'Booker Prize' for her novel \"The God of Small Things\".",
        "1999": "Maharashtra Governor P. C. Alexander asks both the BJP-Shiv Sena combine and the Congress(I) for proof.",
        "2000": "Sachin Tendulkar becomes the highest run-getter in one-day internationals (9379 runs) during his innings of 69 in the final of the ICC cricket tournament against New Zealand."
    }
}