{
    "title": "Events for January 15",
    "events": {
        "1592": "Shahjahan, great mughal emperor of India, was born at Lahore.",
        "1656": "Chhatrapati Shivaji conquered Javali state.",
        "1784": "Sir William Jones, Judge and linguist, and Sir Warren Hastings established the Asiatic Society of Bengal at Calcutta. This was the first scholastic institution.",
        "1887": "Shri Tripuraneni Ramaswamy Chowdary, freedom fighter and a great native poet, was born in village Angaluru, Krishna District, Andhra Pradesh.",
        "1888": "Saifuddin Kitchlew, freedom fighter and President of the Punjab, was born at Amritsar.",
        "1898": "Nanasaheb Ramji Tawde, educationist and scientist, was born at Taluq Malvan, Maharashtra.",
        "1899": "Musaffir, Giani Gurmukh Singh, writer and politician, was born at Udhwal (Pakistan).",
        "1918": "K.C.D. Brahaspati, great poet, playwright and orientalist, was born at Rampur, UP.",
        "1919": "Ahmed Mohammad Mamsa, cricket Test Umpire for 6 tests from 1963-73, was born at Mumbai.",
        "1921": "Babasaheb Anantrao Bhosle, eighth Chief Minister of Maharashtra, was born.",
        "1929": "Dr. Martin Luther King,  civil rights leader of the United States of America, freedom fighter and Nobel Prize awardee, was born at America.",
        "1934": "Nearly 20,000 lives were claimed in a  tremendous earthquake measured 8.4 on the Ricther Scale, in Bihar and parts of Nepal. Munger City was completely destroyed.",
        "1947": "Pritish Nandi, famous journalist, was born.  Abul Kalam Azad became Minister of Education in the Government of India.",
        "1948": "Gandhiji hails Indian Cabinet's decision to release Pakistan dues of Rs. 550 million. Fast continues for establishment of communal peace.",
        "1949": "General K. N. Kariappa became the first Indian Commander-in-Chief. He was the first Indian to reach to this post in Indian Army. In 1956, he was designated as Chief of the Army Staff - General, later Field Marshal. This event is commemoratively observed as Army Day.",
        "1956": "Erach Jahangir Sorabji Taraporewala, famous Indian language expert, passed away.",
        "1958": "Tamil becomes the official language of Madras.",
        "1965": "Food Corporation of India inaugurated in Madras.",
        "1966": "The Indian Air Force achieved equal status with the Army and possessed in excess of 70,000 personnel and was nearing its 45-squadron goal. Its composition in the autumn of 1968 included 23 fighter category squadrons, three tactical bomber squadrons, a maritime patrol squadron (with ex-Air India L. 1049G Super Constellations), 11 transport squadrons, four AOP squadrons, a number of helicopter units and a few SAM squadrons.",
        "1971": "Dinanath Damodar Dalal, great artist, passed away.",
        "1973": "Air Chief Marshal Pratap Chandra Lal, Padma Vibhushan, Padma Bhushan, DFC. retired as the Air Officer Commanding, India Command.",
        "1977": "Rashid Ahmed Siddiqui, modern Urdu writer, passed away.",
        "1988": "Narendra Hirwani makes a world record by capturing 16  West Indies wickets on Test debut at Chidambaram Stadium in Madras.",
        "1993": "PM asks for judicial probe into Bombay riots, sanctions Rs. 1 crore aid for victims.",
        "1996": "Victoria Terminus (VT) station in Mumbai renamed Chhatrapati Shivaji Railway Terminus by the Centre.",
        "1997": "Pakistan's pilotless surveillance aircraft intrudes into Indian air space for the first time.",
        "1998": "Gulzari Lal Nanda, Gandhian freedom fighter and twice acting Prime Minister in 1964 and 1966, died in Ahmedabad at the age of 100 years.",
        "1999": "Mi. Pa. Somasundaram (79), writer, poet, litterateur and associate of Rajaji, died in Chennai.",
        "2000": "Baba Amte, social artist, receives Gandhi Peace Prize 1999, from the President  K. R. Narayanan."
    }
}