{
    "title": "Events for March 15",
    "events": {
        "1564": "Akbar removed 'Jeziya' or toll-tax for his non-Muslim subjects.",
        "1831": "First Marathi Almanac (Panchang) started by Ganpat Krishnaji.",
        "1901": "Guru Hanuman was born at Jhunjhunu, Rajasthan. He was the pioneer and contributor of wrestling in India. He was bestowed with the Padamshri in 1983. His pupil Satpal and Kartar Singh won Gold Medals in Asian Games.",
        "1904": "Annada Shankar Rai, modern Oria and Bengali poet, was born.",
        "1908": "Police shoot four people in rioting.",
        "1919": "Osmania  University was established at Hyderabad.",
        "1920": "Ranganandhan Francis, field hockey (Olympic-gold-1948, 52, 56), was born.",
        "1931": "M.I.Mohammad Ghose, cricket test umpire for 8 tests from 1976-80, was born in Tamil Nadu.",
        "1936": "Vasudevrao Apurao Changre, leader in Maharashtra, was born.",
        "1941": "Gorkha Rifles Battalion Group (INDBATT) unit was raised as the 4th Battalion, the 2nd King Edward VII's own Gorkha Rifles (The Sirmoor Rifles) by Lt Col O'de T Lovett at Deharadun.",
        "1946": "Attlee offers India full independence after agreement on constitution in London.",
        "1950": "Planning Commission Day.",
        "1969": "Indian Navy's first Helicopter Squadron was commissioned in Goa.",
        "1983": "Farukh Abdul Latif, great politician and journalist, was born.",
        "1992": "Dr. Rahi Masum Raza, film screenplay, story and dialogue writer, passed away at the age of 64 years.",
        "1993": "Vinod Kambli scores 227 vs Zimbabwe. This was his second consecutive Test 200.",
        "1996": "Kashmiri militants and Central govt. hold talks on ending violence and to initiate the democratic process in J&K.",
        "1997": "Lok Sabha passes Income Tax (Amendment) Bill, 1997.",
        "1998": "Mr. Vajpayee is appointed Prime Minister. The number of MPs supporting the formation of a government by the BJP stands at 264 in a house of 539, just short of the working majority of 270. However, the President sees the figure as crossing the half-way mark as the Telugu Desam decides to remain neutral. Earlier, the Congress(I) conveys to the President its decision not to stake claim to form a government."
    }
}