{
    "title": "Events for April 15",
    "events": {
        "1658": "Raja Jaswant Singh was defeated at Dharmat. He was sent by Shahjahan and Dara Shukoh to resist Aurangzeb's advance towards Agra.",
        "1794": "Moropant Paradkar, great poet of Marathi in Peshwa kingdom, passed away.",
        "1874": "Tryambak Sitaram Karkhanis, founder of `Maharashtra Natak Mandali', was born.",
        "1883": "Narhar Raghunath Phatak, famous journalist and historian, was born.",
        "1890": "Gaganvihari Lalubhai Mehta, famous Indian economist, politician and journalist, was born.",
        "1895": "Bal Gangadhar Tilak inagurated the Shivaji Mahotsav at Raigad Fort.",
        "1901": "Balakrishna Janardan Mohoni, cricket Test Umpire for 11 Tests from 1948-57, was born in Maharashtra.",
        "1919": "British troops kill 400 Indians, who were demonstrating against the British rule at Amritsar for the forced marshall law on Punjab.",
        "1926": "Gurvel Singh Pannu, famous Hindi writer, was born in Lauhka, Punjab.",
        "1927": "Abha Gandhi, servant to Gandhi, was born.",
        "1932": "Suresh Shridhar Bhat, famous poet, was born.",
        "1938": "Madhurima. Ch, educationist and artist, was born in Begusarai, Bihar .",
        "1942": "George VI awards the George Cross to the people of Malta.",
        "1946": "Triumphant over flesh and pain they passed away our day of peace to Cain. The original memorial was erected from local stone and the main epitaph displayed above is of black Naga stone.",
        "1947": "Issues with Jinnah a joint appeal for communal peace.",
        "1948": "Purushottamdas Tandon was honoured with the title of 'Rajashri' at a huge rally by Devaraha Baba. He was awarded the Prestigious 'Bharat Ratna' award.",
        "1950": "Acharya Vinoba Bhave  requested to the villagers of Panchampalli Telangana, Andhra Pradesh to give 80 acres of land, and with this he had started his 'Bhudan Andolan'.",
        "1956": "A combined army and police action against well armed Naga rebels.",
        "1962": "S. S. Khera was appointed as the Cabinet Secretary of India. He held this office till 18-11-1964.",
        "1963": "Manoj Prabhakar, cricketer (Indian opening batsman & opening bowler), was born in Ghaziabad.",
        "1975": "Janata Party's `People's March' to Parliament.",
        "1976": "India announces it will send an envoy to Peking, first time in 15 years.",
        "1980": "Six more private sector banks nationalized.",
        "1984": "Extremist Sikhs plunder 40 stations in Punjab, India.",
        "1992": "D. T. Lakdawala, former member of Planning Commission, passed away.",
        "1994": "India signed `GAT' agreement.",
        "1996": "Shyam Benegal's film \"The Making of a Mahatma\" released in South Africa.",
        "1997": "Interest rate on domestic term deposits brought down from 10 to nine per cent by RBI.",
        "1998": "Punjab men and Railways women emerge champions in the National Volleyball League in Patna.",
        "2000": "Baichung Bhutia became the first Asian-player to score a goal in the professional English game."
    }
}