{
    "title": "Events for August 15",
    "events": {
        "1772": "Divani and Faujdary courts seperated by East India Company.",
        "1854": "The first  train of the East Indian Railways steamed out of Howrah station destined for Hoogly, which was at a distance of 24 miles. It was the first passenger train catering to public traffic. Officially, it was inaugurated in 1855.",
        "1867": "Bhartendu Harishchandra publishes a Hindi monthly 'Kavi Vachan Sudha'.",
        "1872": "Sri Aurobindo Man Mohan Ghosh born in Calcutta. He was a renaissance yoga philosopher, freedom fighter and teacher. His 30-volume work discusses the 'superman', a metaphor for the divinely transformed individual soul. He withdrew from the world in 1910 and founded International Ashram in Pondicherry.",
        "1918": "Hans Kumar Tiwari, famous poet and translater, was born.",
        "1921": "Amrit Rai, novelist and translater, was born .",
        "1925": "Sadashiv Pandurang Jantre, great freedom fighter and social worker, was born .",
        "1942": "Mahadev Haribhai Desai, an activist and Mahatma Gandhi's personal secretary, died of heart failure at Aga Khan's Palace.",
        "1947": "Brigadier Thakur Mahadeo Singh was the first Indian Commandant. He was the DSO of Indian Militery Academy.",
        "1949": "Chandernagore joins the Indian Union. Panchayati Raj inaugurated in 114,000 villages.",
        "1950": "Earthquake measuring 8.6 on Richter Scale hits Assam in north eastern India claiming 11,000 lives.",
        "1955": "Satyagrah started for the freedom of Goa.",
        "1960": "Maharashtra State Sahkari Grihvitta Corporation was established.",
        "1965": "Television starts in New Delhi.",
        "1968": "Marathwada', a daily newspaper, published.",
        "1969": "Indian Space Research Organisation (ISRO) formed under Department of Atomic Energy.",
        "1972": "Postal Index Number (PIN Code) of 6-digits was introduced.",
        "1979": "Tukoji Holkar, a leader of Peshwa kingdom, dies.",
        "1982": "Doordarshan's national programme and the first nationwide colour transmission started by Delhi Doordarshan.",
        "1985": "Accord reached on the Assam foreign nationals issue, agitation called off.",
        "1990": "India successfully test fires 'Akash', an advanced medium range surface to air missile.",
        "1992": "Karnataka seeks army help to nab sandal wood smuggler Veerappan.",
        "1993": "Five more Doordarshan channels launched.",
        "1994": "Sukumar Gupta, a socialist, dies.",
        "1995": "P.V Narasimha Rao introduces the mid-day meal scheme for the primary school children under the Central Government Welfare Programme.",
        "1996": "Deve Gowda speaks in Hindi on the occasion of the 50th Independence Day.",
        "1997": "K. R. Narayanan, President, posthumously confers nation's highest peace-time gallantry award 'Ashok Chakra'  to second Lieutenant Puneet Dutta.",
        "1998": "Golden jubilee celebrations of the Indian Independence ends.",
        "1999": "Atal Bihari Vajpayee, Prime Minister, says Agni-2 to be inducted in the defence arsenal.",
        "2000": "Atal Bihari Vajpayee, Prime Minister, says in his Independence Day address, \"Borders cannot be redrawn either in the name of religion or on the strength of the sword\"."
    }
}