{
    "title": "Events for September 15",
    "events": {
        "1860": "M. Visveswarayya, maker of  modern Karnataka, was born. He was a notable engineer too.",
        "1861": "Dr. Sir Mokshagundam Visvesvaraya, famous architect, engineer and a diplomat, also a  Bharat Ratna awardee, was born at Chickballapur in Mysore (Karnataka) in a poor Brahmin family.",
        "1862": "Gaurishankar Hirachand Oza, famous historian, was born.",
        "1876": "Sarat Chandra Chatterji, famous Bengali novelist and writer, was born at Debanandapur in Hoogly district.",
        "1903": "Wazir Syed Ali, right-hand batsman and right-arm fast medium bowler, was born at Jalandhar.",
        "1909": "Thiru Conjeevaram Natarajan Annadurai, ''Anna'', founder of DMK (Dravida Munnetra Kazhagam) and former Chief Minister of  Tamil Nadu, also an editor, writer, orator and patriot, was born in a weaver community of Kanchipuram.",
        "1912": "Rusi Karanjia, journalist and publisher, was born.",
        "1916": "Margaret Lockwood, film actress  of 'Lady Vanishes' fame, was born in  Karachi, India.",
        "1926": "Vande Mataram', a lengthy feature film produced by Vande Mataram Film Co, Bombay, was prohibited on September 15 by the Censor Board on the grounds that it was an underlying attack on the prestige of University Education in India. The film, however, was cleared on December 7 after deleting the objectionable scenes.",
        "1927": "Sarveshwar Dayal Saxena was born.",
        "1940": "Anil Yashwant Tipnis, Air Chief Marshal, was born.",
        "1947": "Gandhi deplores the idea of population transfer.",
        "1948": "The India flag carrying vessel reached Bombay Port.",
        "1953": "S. Vijayalakshmi Pandit was elected as the first lady President of the eighth session of the United Nations Organisation's (UNO) General Assembly.",
        "1965": "President Ayub Khan appeals to the US to use its influence to end Indian-Pakistani hostilities.",
        "1967": "Ramkrishnarao Burgula, Chief Minister of Hyderabad, died.",
        "1992": "Price of petrol, diesel and cooking gas hiked.",
        "1993": "Election Commission announces polls in the former BJP-ruled states of UP, MP, HP, Rajasthan and in Delhi and Mizoram.",
        "1997": "Prasar Bharati Act comes into force seeking to free Doordarshan and Akashvani from government control.",
        "1999": "Palvai Purushottam, the sitting Sirpur MLA and TDP candidate, shot dead."
    }
}