{
    "title": "Events for November 16",
    "events": {
        "16\tNovember\t1713": "Chhatrapati Shahu appointed Balaji Vishwanath, a very remarkable man in Maratha history, as 'Peshwa'.",
        "16\tNovember\t1860": "First group of Indian worker's reached Natal, South Africa.",
        "16\tNovember\t1877": "Ardaseer Cursetjee Wadia, professor, pioneer and innovator, died. He was the first Indian who was elected as a Fellow of the Royal Society, London. He introduced lighting by gas and was the first to build \"INDUS\", a steam-ship in India in 1833. He also introduced sewing machine, photography and electro-plating.",
        "16\tNovember\t1883": "Pandit Baburao Vishnu Paradkar, eminent Hindi editor and journalist, was born at Varanasi. His journey in journalism moved from Hindi Bangwasi-1907, Hitwarta (1910),  Bharatmitra (1916). He was arrested being accused of revolution and assassination and was imprisoned for three and a half years. After his release from Jail in 1920, he went back to Varanasi. In 1920, he was editor of Hindi daily Aj and through his editorials, his thoughtful critic, superb writer and the pioneer of ideological revolution, struggle for India’s freedom and establishment of Rashtrabhasha Hindi. National Press Day is also celebrated on his birthday.",
        "16\tNovember\t1887": "Padmacharan Patnaik, famous Orria poet, was born.",
        "16\tNovember\t1908": "Bommi Narsingh Reddy, famous film story writer, was born.",
        "16\tNovember\t1913": "Agnihotri Ambadas Shankar, journalist and litterateur, was born.",
        "16\tNovember\t1915": "Vishnu Ganesh Pingle, martyr, died.",
        "16\tNovember\t1921": "Nearly 700 Mopalh rebels were killed by the Gurkhas as they attacked the Pandikkad post at Delhi.",
        "16\tNovember\t1947": "Kamta Prasad \"Guru\" died at Jabalpur. He was renowned for his contribution in the field of Hindi Grammer. He was the editor of a monthly 'Saraswati' and 'Balasakha', children magazine.",
        "16\tNovember\t1958": "India and U.S.S.R. sign trade agreement to exchange Soviet industrial and agricultural equipment for farm commodities at Moscow.",
        "16\tNovember\t1962": "Chinese troops launch a major offensive in the frontier war.",
        "16\tNovember\t1983": "Kapil Dev took 9-83 vs West Indies at Ahmedabad. India still lost the game.",
        "16\tNovember\t1986": "Second SAARC summit held at Bangalore.",
        "16\tNovember\t1988": "India gives full recognition to the state of Palestine.",
        "16\tNovember\t1989": "66 out of 71 trapped miners at Raniganj rescued.",
        "16\tNovember\t1990": "Chandrasekhar Government wins confidence motion of 280 for 214 against and 11 abstained (17 members were absent).",
        "16\tNovember\t1991": "Madhukar Karekar, famous journalist, died.",
        "16\tNovember\t1992": "Reservation, Supreme Court rejects economic criteria.",
        "16\tNovember\t1993": "Kashmir's 32-day-old Hazaratbal impasse ends with militants' surrender.",
        "16\tNovember\t1995": "The Pension scheme ordinance for 18 million Provident Fund subscribers takes effect with an initial corpus of Rs. 85.00 billion.",
        "16\tNovember\t1997": "Sandalwood smuggler Veerappan offers to surrender.",
        "16\tNovember\t1998": "Kiran More, former Indian stumper, calls it a day from first class cricket at Baroda.",
        "16\tNovember\t1999": "Suraj Bhan, Bihar Governor, dismisses the Horticulture and Weights and Measurements Minister Samrat Chaudhary in the Rabri Devi cabinet for being 'underaged'.",
        "16\tNovember\t2000": "The Government to reduce equity holding in nationalised banks from 51 per cent to 33 per cent."
    }
}