{
    "title": "Events for January 16",
    "events": {
        "1620": "Amarsingh I, Rajput's guhilot lineage king of Mewad, died.",
        "1681": "Sambhaji was crowned as the successor of Chhatrapati Shivaji Maharaj in a function held at Raigad Fort.",
        "1818": "The Rana of Udaipur signed a treaty with the British to protect Mewad.",
        "1858": "Baithi, Laikha, Ratna, Maani, and the women who participated in Mairath Kranti at Gudgaon, all were hanged.",
        "1896": "Jaideva Singh, famous musician and educationist, was born Shohratgarh, U.P.",
        "1901": "Mahadeo Govind Ranade, eminent social worker and thinker, passed away.",
        "1916": "Amat Debananda, politician, was born in Balani village at Orissa .",
        "1919": "Nasikrao Khantadu Tirpude, former Duputy Chief Minister of Maharashtra, was born.",
        "1920": "Nani Palkhiwala, famous law expert, was born.",
        "1924": "In a tragic ship wreck, Kumaran Asan, famous Malayalam poet & eminent social worker, died.",
        "1938": "Sarat Chandra Chatterji, famous Bengali novelist and  writer, passed away.",
        "1941": "Ashok Vajpai, veteran critic and Hindi poet, was born.",
        "1942": "Jawaharlal Nehru succeeds Gandhi as head of Indian National Congress.",
        "1945": "Kabir Bedi, famous Hindi and foreign actor (Thief of Baghdad, Terminal Entry), was born.",
        "1948": "Pakistan charges India with systematic campaign to wipe out Muslims.",
        "1954": "Baburao Painter (Baburao Krishnaji Meshri), famous artist, sculptor, filmmaker and producer, died.",
        "1966": "Sadhu Thanwardas Lilaram Vaswani, noted thinker and saint poet, great orator, professor and prolific writer, died at Pune.",
        "1973": "Om Prakash Mehra, Air Chief Marshal PVSM, became the Air Officer Commanding, India Command. He was in this office till 31/01/1976.",
        "1985": "Balram Jakhar elected Speaker of the Lok Sabha.",
        "1988": "L. K. Jha, famous economist and member of Rajya Sabha, died.",
        "1989": "Prem Nazir, famous actor of more than 620 Malayalam films, died at the age of 59 yrs.",
        "1990": "Dr. R.R. Diwakar, Gandhian and former Union Minister, passed away.",
        "1992": "For the first time in a decade, India decides to import one million tonnes of wheat.",
        "1995": "Missile carrier vessel 'Vidhrut' dedicated to nation.",
        "1996": "Union Cabinet Minister V.C. Shukla, Balram Jhakar, Madhavrao Scindia, and others including BJP President L.K. Advani, Arjun Singh and Devi Lal chargesheeted in the multi-crore Jain `Hawala' case. CBI seeks sanction to prosecute them. L.K. Advani resigns from Lok Sabha membership.",
        "1997": "Dr. Datta Samant, Trade Union leader, shot dead in Mumbai.",
        "1999": "Ritwick Bhattacharya (Delhi) and Mekhala Subedar (Maharashtra) won the men's and women's titles in the National squash championship in Calcutta.",
        "2000": "Punjab men, Railway women win the Senior National Volleyball championship in Salem."
    }
}