{
    "title": "Events for December 16",
    "events": {
        "16\tDecember\t1515": "Affonso de Albuquerque, who is regarded as the real founder of Portuguese power in India, died at the age of 73 years.",
        "16\tDecember\t1770": "Ludwig Van Beethoven, greatest musician, poet and innovator, was born.",
        "16\tDecember\t1867": "Amy Carmichael, Scotch Irish missionary, was born. She went to India in 1895 under the Zenana Missionary Society, remaining there without furlough until her death 56 years later. An invalid during her last 20 years, she worked to rescue children from the Hindus.",
        "16\tDecember\t1909": "Lal Singh Narayan Singh, cricketer (scored 15 & 29 in India's 1st Test match), was born near Kuala Lumpur, Malaysia.",
        "16\tDecember\t1921": "Calcutta Electric Supply Corporation started tunnel construction under Hoogly river.",
        "16\tDecember\t1922": "Parvati Devi, orator, was arrested for delivering revolutionary speeches in meetings at Hapud and Merrut. She was the first Indian women to get two years long imprisionment during the freedom struggle.",
        "16\tDecember\t1924": "Nissim Ezekiel, educationist and author, was born.",
        "16\tDecember\t1951": "Salarjung Museum opened in Hyderabad.",
        "16\tDecember\t1952": "Sri Ramalu Potiu sacrificed his life for the demand of seperate Andhra Pradesh state for the Telugu- speaking people.",
        "16\tDecember\t1960": "Ganesh Chintaman Karve, creator of Marathi dictionary and author, passed away.",
        "16\tDecember\t1971": "Bangladesh was formed. President Yahya Khan of Pakistan changed his position dramatically and announced he would accept a ceasefire with India. After his forces in East Pakistan surrendered unconditionally, Yahya Khan vowed to keep fighting in the West against his political enemy. His reversal today undermines his administration, and there are growing indications he will step down as head of the military government. Yahya has already been criticized for his brutal repression of the Bengali separatist movement, which has renamed East Pakistan as Bangladesh. It appears that the separatists may actually benefit from the fighting, because India has managed to defeat most of Yahya's military forces in East Pakistan.",
        "16\tDecember\t1980": "Fisher Wealthy Hornsinger, an American social worker and who worked for Adult Education in India, passed away.",
        "16\tDecember\t1990": "Dr. M. Channa Reddy resigned as Andhra Pradesh CM.",
        "16\tDecember\t1992": "The Parliament adopts resolution condemning the demolition of the mosque at Ayodhya and centre appoints a one-man judicial commission to enquire into the Ayodhya incidents.",
        "16\tDecember\t1994": "Pratap Singh Rane of Congress (I) takes oath of office.",
        "16\tDecember\t1997": "Mamata Banerjee, Congress(I) rebel, declares that she would seek recognition and separate symbol for her \"Trinamul Congress'' and contest elections on her own.",
        "16\tDecember\t1998": "The Government introduces in the Rajya Sabha the Patents (Amendments) Bill 1998 amid Left protests.",
        "16\tDecember\t1999": "The second phase of national AIDS programme is launched.",
        "16\tDecember\t2000": "Kalyan Banerjee becomes the first Indian to head the Rotary Foundation, one of the richest bodies of the Rotary International."
    }
}