{
    "title": "Events for October 16",
    "events": {
        "1788": "Maratha's crowned Shahaalam as king of Delhi.",
        "1878": "Vallathol Narayana Menon, great freedom fighter, poet and writer, was born at Chennara village in Kerala.",
        "1896": "Govindas Seth, hindi litterateur and politician, was born.",
        "1905": "Bengal was partitioned by Lord Curzon on the pretext of it being too big to administer. Instead of dividing it on the basis of non-Bengali areas, the division was on the basis of Hindus and Muslims. Britishers thought that would succeed in increasing Hindu - Muslim tensions. The tremor of partition was felt throughout India and was regarded as an insult and challenge to Indian Nationalism. A movement was launched by the moderates. New method of protests 'Swadeshi and Swaraj' became the slogan of the common man and the whole of India was drawn into the n]ational movement.",
        "1906": "Shankar Damodar Chitale, famous author and teacher, was born in Secundarabad.",
        "1920": "B. Sathyaji Rao, cricket Test umpire for 17 tests from 1960-79, was born in Karnataka.",
        "1922": "M.V. Desai, social reformer and journalist, was born.",
        "1936": "35 killed in Hindu-Muslim riots at Bombay.",
        "1942": "Cyclone in Bay of Bengal kills some 40,000 people in south of Calcutta, India.",
        "1945": "Food and Agriculture Organisation (FAO) established.",
        "1952": "Pakistan's first Test vs India starts at Delhi.",
        "1959": "National Council  of Women's Education was inaugurated in New Delhi.",
        "1968": "Hargovind Khorana, Indian scientist, was awarded 1968 Nobel Prize for Medicine and Physiology on man-made synthetic gene.",
        "1971": "David Jude Johnson, cricketer (Karnataka fast bowler, India 1996), was born in Arasikere.",
        "1976": "Jalgaon Radio Station started broadcasting.",
        "1978": "Test debut of Kapil Dev, India vs Pakistan, at Faisalabad.",
        "1983": "Harish Chandra, great Indian scientist, died. His work in a narrow branch of modern mathematics led to its developement to such an extent that it drew the attention of mathematicians all over the world.",
        "1990": "Om Shivpuri, famous film and theatre artist, died.",
        "1992": "Colonel Prem Kumar Sahgal of Azad Hind Fauz died. During the trial at the Red Fort, he said, \"Beacuse I wanted freedom for my motherland, I was ready to shed my blood for it\".",
        "1994": "IRS P-2 successfully placed in orbit.",
        "1997": "Queen Elizabeth visits Kalakshetra where she witnesses Bharatanatyam show and film shooting at MGR Film City, Taramani in Chennai. She also goes to Kancheepuram and Sriperumbudur (Rajiv Gandhi memorial).",
        "1999": "Dr. Najma Heptulla, Deputy Chairperson of the Rajya Sabha, is elected president of the 138-nation Inter-Parliamentary Union (IPU).",
        "2000": "Rest of India wins the Irani Trophy cricket tournament. Murali Karthik scalps nine for 70, the best figures by a bowler in 38 Irani cup matches."
    }
}