{
    "title": "Events for February 16",
    "events": {
        "1745": "Thorle Madhavrao, fourth Peshwa in Maratha kingdom, was born.",
        "1896": "Suryakant Tripathi 'Nirala', great Hindi poet, litterateur, writer, social worker and editor, was born.",
        "1905": "Padmabhushan Aliyawar Jang, former Governor of Maharashtra, was born.",
        "1911": "Bhalchandra Gopal Bapat, newspaper editor and educationalist, was born.",
        "1923": "Vishnu Moreshwar Mahajani, famous author, poet and playwright, passed away.",
        "1927": "Rail service started between India and Nepal.",
        "1931": "Viceroy Lord Irwin meets Mahatma Gandhi for the first time.",
        "1932": "Sibnath Banerjee, trade union movement leader, passed away. He founded several organisation like Congress Socialist Party, A.I.T.U.C. and Hind Mazdoor Sabha, etc.",
        "1933": "Surya Sen Masterda, revolutionary freedom fighter, who attacked the Armoury of Chittagong with 62 men of the Indian Republican Army and was underground on Jalalabad Hills, was arrested.",
        "1942": "The third IAF unit to operate the Lysander was No.4 Squadron, formed with four aircraft on 16 February 1942. This squadron was to continue to operate the Westland aircraft until it too was re-equipped with the Hurricane in June 1943.",
        "1944": "Dadasaheb Phalke passed away in Nasik at the age of 74. He is remembered as the 'Father of Indian Cinema'. He produced India's first feature Film, 'Raja Harishchandra'. He was Director, Producer, Writer, Editor & Laboratorian. Dada Saheb Phalke Award issued by Government of India is given in his memory.",
        "1955": "Maghnath Saha, famous scientist, passed away.",
        "1962": "General Election ( 3rd) of India begins.",
        "1968": "Beatles George Harrison and John Lennon along with their wives fly to India for transcendental meditation study with the Maharishi Mahesh Yogi.",
        "1969": "Mirza Ghalib centenary stamp released.",
        "1980": "The first visible Total Solar Eclipse of the 20th Century was seen. This succeeded the total solar eclipse after 22 June 1898.",
        "1982": "Sibnath Banerjee, great social worker and leader, passed away.",
        "1986": "The Silver Jubilee of I.N.S.- Vikrant, India's only aircraft carrier, fails.",
        "1992": "Abbas Musawi, leader of Hezbollah, assassinated.",
        "1993": "Dr. U.R. Ananta Murthy elected President of the Kendra Sahitya Academy.",
        "1994": "Nivrittibuwa Sarnaik, veteran singer of  'Jaipur Gharana', passed away.",
        "1997": "Tribal militants kill 21 persons in Tripura.",
        "1998": "Delhi-Tamil Nadu Ranji Trophy super-league encounter in Chennai comes to an abrupt halt with Delhi skipper and batsman Ajay Sharma sighting boot marks short of the good length area."
    }
}