{
    "title": "Events for March 16",
    "events": {
        "1527": "Rana Sangram Singh, King of  Mewad, attacked on Mughal Emperor Babur near Kanwa at Agra.",
        "1556": "Amarsingh, Rajput king of Mewar, was born.",
        "1599": "Shahaji Raje Bhosale, father of Chhatrapati Shivaji Maharaj, was born.",
        "1832": "Sarfoji Bhosle, King of Tanjawar, passed away.",
        "1860": "Dr. W.M. Haffkine, great scientist, bacteriologist and professor, was born at Odessa in Russia.",
        "1877": "Nanalal Dalpatram Kavi, famous poet, Gujarati litterateur and Headmaster, was born.",
        "1880": "Parshuram Rajshekhar Basu, famous Bengali writer, was born.",
        "1901": "Pralhad Balacharya Gajendragadkar, Chief Justice of Supreme Court of India, was born.",
        "1902": "A. Appadorai, educationist and author, was born at Angadipuram, Kerala.",
        "1910": "Iftikhar Ali Khan Pataudi, cricketer (Nawab of Pataudi sr, England & India), was born in Pataudi, Punjab.",
        "1912": "Gandhiji commends Gokhale's attempts for abolition of indenture system.",
        "1924": "Bhupendranath Basu, great freedom fighter, President of Congress and fluent orator, passed away.",
        "1928": "C.V. Raman announced his discovery of ''new radiation'' to an assembly of scientists at Bangalore.",
        "1939": "Subroto Mukherjee became the first Indian Officer to command a squadron when he took over No.1.",
        "1945": "Ganesh Damodar Savarkar, who was a revolutionary and brother of Swatantriya  Veer Vinayak Damodar Savarkar, passed away.",
        "1946": "Alladiya Khan, famous singer of Kolhapur Darbar, passed away.",
        "1966": "Judge Amal Kumar Sarkar became the Chief Justice of India. He held  this office till 29/06/1966.",
        "1977": "Sixth General Election of India begins.",
        "1986": "Internationally wanted criminal Charles Sobharaj and 6 other prisoners escape from Tihar Jail.",
        "1992": "Satyajit Ray, veteran film producer and director, was presented the honorary Oscar by a three-member Oscar committee at a Calcutta nursing home.",
        "1993": "Central government introduces pension scheme for 170 million EPF subscribers.",
        "1995": "World's best 7th wkt stand of 461 runs by Bhupinder Singh Jr. & P. Dharmani.",
        "1997": "Saidian Shafi, correspondent, Ankhon Dekhi', TV news magazine, and his personal security officer killed by militants in Srinagar.",
        "1998": "Sonia Gandhi is elected chairperson of the Congress(I) Parliamentary Party.",
        "1999": "The Shiromani Akali Dal creates a record by unanimously electing Bibi Jagir Kaur Begowal as the first woman president of the SGPC.",
        "2000": "Rabri Devi, Bihar Chief Minister, wins trust vote."
    }
}