{
    "title": "Events for April 16",
    "events": {
        "1801": "Warrior Vithoji Holkar of Peshwa kingdom was assassinated.",
        "1848": "Kandukuri Veeresalingam, Telegu author and social reformer, was born in Andhra Pradesh.",
        "1853": "The first Railway Train on Indian sub-continent ran over a streach of 21 miles i.e. 35 kms from Bombay to Thane. In the inauguration ceremony, 14 railway carriages carrying about 400 guests left Bori Bunder (presently C.S.T.) at 3.30 pm, amidst the loud applause of a vast multitude and to the salute of 21 guns.",
        "1903": "Kalka-Simla Railway line section was opened for public conveyance.",
        "1918": "Spike Milligan, famous actor and comedian (Digby, 3 Musketeers), was born in India.",
        "1930": "Rioting continues in India as British police fire on mob of 10,000.",
        "1934": "Ram Damodar Naik was born in Sangli (Maharashtra).",
        "1958": "Raghuram Adwai Bhat, great Indian left-arm spinner 1983-84, was born at Mangalore.",
        "1959": "Raurkela Iron Project's first furnace started functioning.",
        "1962": "Third Lok Sabha constituted after the third general election in India. J. L. Nehru forms the third Congress ministry.",
        "1963": "Gopal Singh Nepali, famous poet, passed away.",
        "1966": "Nandlal Bose, who established modern painting in Bengal, passed away.",
        "1974": "Dr. Sarvapalli Radhanakrishnan, former President of India, Philosophist and litterateur, passed away.",
        "1976": "The govt. announces its new birth-control program to curb population growth.",
        "1980": "Delhi beat Bombay by 240 runs to win Ranji Trophy final.",
        "1991": "President's rule imposed in Haryana.",
        "1992": "The PM gives a new slogan to the nation, 'Desh banao, desh bachao'.",
        "1993": "The Supreme Court stays the operation of M.P. High Court's order quashing President's rule in the state.",
        "1996": "Narasimha Rao, PM,  visits Kerala (2 days).",
        "1997": "G. Kishenchand, former Indian Test cricketer, died.",
        "2000": "India wins the second leg of the pre-olympic hockey tournament at Perth."
    }
}