{
    "title": "Events for November 17",
    "events": {
        "17\tNovember\t1525": "Babur came to India , and conquered it through Sindh in his fifth attempt.",
        "17\tNovember\t1835": "James Todd, researcher and writer of Rajput history, passed away.",
        "17\tNovember\t1857": "Sir Colin Campbell, British Army Officer, managed to supress Indian Mutiny sepoys at Lucknow.",
        "17\tNovember\t1915": "Vishnu Gopal Pingle was hanged for revolting against the Indian Army in Talegaon prison of Pune.",
        "17\tNovember\t1921": "Princes of Wales came to India.",
        "17\tNovember\t1925": "Jemini Ganesh, film actor, was born.",
        "17\tNovember\t1928": "Lala Lajpat Rai died in Lahore after being seriously wounded in the barbarous lathi charge of 30th October. He is referred as the \"Lion of Punjab\" or \"Punjab Kesari\" and is remembered as freedom fighter, nationalist, educationist, lawyer, thinker, writer, social reformer, orator and a passionate fighter for the revival of the ancient Indian culture and values.",
        "17\tNovember\t1932": "The Third Round Table Conference began in London. It was not attended by the Congress as the real Indian participation in the making of the constitution was negligible. Since Gandhi was in prison because of his civil disobedience movement he could not attend it either. This conference ended on 24th November 1932 without achieving anything.",
        "17\tNovember\t1935": "Deodhar Gopal Krishna, great social worker and architect of \"Seva Sadan, Pune\", passed away.",
        "17\tNovember\t1947": "Rajendra Prasad elected the President of Indian National Congress.",
        "17\tNovember\t1948": "Despite the scepticism on the part of the US and British advisers concerning the feasibility of the scheme, the first half-dozen HAL-reconditioned B-24s were ready by November 1948 and, on the 17th of that month, No. 5 Squadron was formed with these heavy bombers.",
        "17\tNovember\t1953": "Sadanand Swaminathan, famous journalist, passed away.",
        "17\tNovember\t1966": "India's beauty queen Rita Faria was crowned as 'Miss World' in World Beauty contest held in London. She was a medical student.",
        "17\tNovember\t1973": "Mother Pondicherry, greatest teacher and religious leader, died.",
        "17\tNovember\t1986": "SAARC Summit at Bangalore decides to set up permanent secretariat at Kathmandu; India elected new Chairman.",
        "17\tNovember\t1991": "Sharad Pawar wins in Baramati.",
        "17\tNovember\t1994": "Dr. Harbhajan Singh, Punjabi poet, wins Saraswati Samman.",
        "17\tNovember\t1999": "India beats New Zealand by seven wickets to win the one-day cricket series in New Delhi. Saurav Ganguly adjudged the 'man of the match' and 'man of the series'."
    }
}