{
    "title": "Events for January 17",
    "events": {
        "1601": "Akbar, after eight month's siege, entered Asirgarh one of the strongest forts in India.",
        "1771": "Govind Patwardhan Mirajkar, first Rao of Peshwai, passed away.",
        "1833": "William Rush, Indian sculptor (Spirit of the Schuylkill), passed away.",
        "1888": "Babu Gulab Rai, famous Hindi essy writer, critic and historian, was born.",
        "1889": "Shri Baldev Ramji Mirdha, great social worker, leader and politician, was born in village Kuchera, district Nagaur of Rajasthan.",
        "1905": "Dattaraya Ramchandra Kaprekar was born at Dahanu near Bombay. He discovered the shortest possible routes to solve mathematical problems. In 1927, he won the wrangler R. P. Paranjpe Mathematical Prize for an Original Piece of work in mathematics. He discovered 'Kaprekar Constant' in 1946. It is the number \"6174\". The constant 6174 is arrived at and this number then generates itself into one set of numbers called \"self numbers\" that is also known by his name. Kaprekar passed away in 1988.",
        "1908": "Akkineni Lakshmi Varaprasada Rao Prasad, film producer, was born.",
        "1909": "Bejoy Kumar Sinha, journalist and social worker, was born at Kanpur.",
        "1913": "Yadvendra Singh, HH LtG. Maharaja of Patial, cricketer (scored 24 & 60 in only Test India vs England), was born in Patiala, Punjab.",
        "1917": "Dr. Maruthur Gopala Ramachandran, (M.G.R.), Indian film star, politician and charismatic Chief Minister of Tamil Nadu, was born at Kandy, Sri Lanka. He was also the founder of All India Anna Dravida Munnetra Kazhaga (AIADMK).",
        "1922": "T. A. Pai, former Central Minister and bank expert, was born.",
        "1923": "Rangey Raghav, famous hindi writer, was born.",
        "1925": "Abdul Hafeez Kardar, cricketer (Pakistan 1st Test captain, previously played for India), was born in Lahore.",
        "1933": "Aga Khan, religious leader (Muslims), was born.",
        "1941": "Subhashchandra Bose went underground at Calcutta. He appeared in Moscow after sone days.",
        "1952": "The pension work of CDA (Factories), Calcutta and the Defence civilians in ordnance factories was transferred to the office of the CDA (P), Allahabad.",
        "1981": "Central Government offers full statehood to Mizoram.",
        "1985": "Azharuddin scores second Test century in second Test  vs England.",
        "1987": "Tata Football Academy was opened in Tatanagar.",
        "1989": "Colonel J. K. Bajaj was the first Indian to reach the geographic South Pole.",
        "1992": "Shankar Ramchandra (Mamrao Date), veteran journalist, passed away.",
        "1993": "LTTE commander Sadasivan Krishnakumar alias Kittu was killed in a ship blaze off Madras coast.",
        "1997": "Supreme Court bans all non-forest activities including running of saw mills and mining in forest areas.",
        "1999": "Madhya Pradesh won its maiden Wills Trophy championship, defeating Bengal in the final of the limited overs cricket championship in Calcutta."
    }
}