{
    "title": "Events for October 17",
    "events": {
        "1817": "Syed Ahmad Khan, great social reformer, educationist, journalist, leader and one of the most eminent builders of modern India, was born in Delhi.",
        "1859": "Keshavlal Harshrai Dhruv, researcher and translator, was born.",
        "1903": "7th Madras Infantry was re-established as 67th Punjabi Infantary.",
        "1906": "Swami Ramtirtha, great social reformer and poet, died at the age of 33.",
        "1915": "Virendra Kumar Jain, great Hindi writer, was born in Mandsaur.",
        "1919": "The Khilafat Movement was launched under the leadership of Maulana Jauhar Ali, Maulana Shaukat Ali and Abdul Kalam Azad.",
        "1920": "Bhartiya Communist Party was formed at Tashkent with seven members including M.N. Roy, Birendra Chattopadhyay and Abani Mukherji.",
        "1932": "Rani Gaidinliu, freedom fighter, social reformer and political leader, was captured by the British army.",
        "1940": "Mahatma Gandhi called for Individual Satyagrah and Vinoba Bhave started it.",
        "1949": "The Constituent Assembly of India adopted Article 370 of the Constitution making special provisions for J&K.",
        "1970": "Anil Radhakrishna Kumble, cricketer (great Indian leg spinner since 1990), was born in Bangalore.",
        "1979": "Supreme Court stays the execution of all death sentences.",
        "1990": "S. Bangarappa sworn in as CM of Karnataka following revocation of President's rule.",
        "1994": "Seshan's controversial biography ''DMK'' obtains stay.",
        "1995": "BJP withdraws support to Mayavati Government in Uttar Pradesh. UP Governor Motilal Vohra accepts the resignation of Mayawati and her cabinet but asks her to continue as caretaker government. BJP's top brass takes the final decision to break with the BSP.",
        "1996": "President's rule reimposed in U.P.",
        "1997": "SEBI asks investors to adopt paperless trading through depository.",
        "1998": "Nine women are buried alive as the roof of the 200-year-old Balaji temple in Varanasi's Ramghat area caves in.",
        "1999": "Indian men bagged bronze in the Asian team chess championship in Shenyang."
    }
}