{
    "title": "Events for December 17",
    "events": {
        "17\tDecember\t1645": "Noorjahan Begum passed away.",
        "17\tDecember\t1715": "Banda Bahadur Bairagi surrendered at Gurdaspur of Farrukhsiyar to the Mughal army.",
        "17\tDecember\t1740": "Chimaji Appa, Peshwa warrior, died.",
        "17\tDecember\t1830": "Simon Bolivar, great dynamic leader and social reformer, died.",
        "17\tDecember\t1877": "Feroz Shah died at Makka, Saudi.",
        "17\tDecember\t1905": "Judge Mohammad Hidayatullah, Chief Justice and Supreme Court of India, was born.",
        "17\tDecember\t1910": "Keki Khursedji Tarapore, cricketer (0-72 in his only Test for India), was born in Bombay.",
        "17\tDecember\t1914": "Syed Mushtaq Ali Takub Khan, cricketer, prolific Indian batsman of 30's & 40's, was born in Indore.",
        "17\tDecember\t1929": "Bhagat Singh and Rajguru killed Sanders, Asst. Suprintendent of Police.",
        "17\tDecember\t1933": "Lala Amarnath scores a century (118) in his Test Cricket debut.",
        "17\tDecember\t1934": "Khandesh Gandhi Mir Sukrulla, great patriot and freedom fighter, died.",
        "17\tDecember\t1938": "Charuchandra Bandopadhyay, famous Bengali story writer and novelist, died.",
        "17\tDecember\t1959": "Pattabhi Sitaramayya, president of Indian National Congress and politician, died at the age of 78.",
        "17\tDecember\t1961": "Provocative action against our nationals in the vicinity of Anjadip Island and Portugal's belligerent attitude to the problems of its colonial possessions in this country, resulted in the Government of India's decision to liberate Goa, Daman and Diu. Operations were launched at night.",
        "17\tDecember\t1970": "Judge Jayantilal Chhotalal Shah became the Chief Justice of India. He helded this office till 21/01/1971.",
        "17\tDecember\t1971": "Ceasefire between India & Pakistan in Kashmir and end of Indo-Pak war.",
        "17\tDecember\t1972": "New line of control agreed to in Kashmir between India & Pakistan.",
        "17\tDecember\t1974": "Ustad Gulam Sabir, famous Sarangi player, died at Kanpur.",
        "17\tDecember\t1978": "Dhirendranath Ganguly, father of Bengali film industry, died.",
        "17\tDecember\t1987": "Bhopal court orders the Union Carbide to pay Rs. 350 crore as interim relief to 1984 gas victims.",
        "17\tDecember\t1990": "N. Janardhan Reddy sworn in as CM of Andhra Pradesh.",
        "17\tDecember\t1991": "Narasimhan committee on Monetary Reforms recommends that there should not be any further nationalisation of banks.  Loan-melas assailed.",
        "17\tDecember\t1996": "Virendrakumar Jain, famous writer, died in Mumbai.",
        "17\tDecember\t1998": "P. M. Sayeed of the Congress(I) was unanimously elected Deputy Speaker of the Lok Sabha.",
        "17\tDecember\t1999": "Pramod Mahajan, Parliamentary Affairs Minister, announces that Women's Bill will be introduced in the Lok Sabha.",
        "17\tDecember\t2000": "The 13-day nationwide postal strike called off."
    }
}