{
    "title": "Events for February 17",
    "events": {
        "1618": "First English Ambassador Sir Thomas Roe returned to England after meeting Emperor Jahangir in his court.",
        "1670": "Shivaji won SinghGarh Fort from Mughals. This victory was on the shoulders of Tanaji who was martyred in this attack. Shivaji proclaimed \"Garh Aalaa Pan Singh Gela\" which means that Fort was won but the Lion was lost.",
        "1698": "Aurangzeb fell to Jinjee fort, seat of Maratha power, after eight-year siege.",
        "1883": "Vasudeo Balvant Phadke, great revolutionary, freedom fighter and social reformer, passed away in prison at Aden.",
        "1907": "Henry Olcott, co-founder (Theosophical Society-Madras), passed away.",
        "1917": "Fali Mistry, film director and cameraman, was born in Bombay.",
        "1918": "S. V. Kumaraswamy, cricket Test Umpire for 1 test from 1961-62, was born at Tamil Nadu.",
        "1931": "Viceroy of India Lord Irvin accepted Mahatma Gandhi as leader of people and invited him at Vicregal Lodge (now known at Rashtrapati Bhavan). After the event, Winston Churchill, who later became Prime Minister of Britain, referred Gandhiji as \"the Half-Naked Fakir of India\".",
        "1948": "Gorkha Rifles Battalion Group (INDBATT) unit was re-designated as the 5th Battalion the 8th Gorkha Rifles (the Sirmoor Rifles).",
        "1968": "Dr. Kailas Nath Katju, freedom fighter, politician, leader, Governor of Orissa and West Bengal, passed away.",
        "1976": "Urban Ceilings Act comes into force.",
        "1980": "Indira Gandhi dissolves nine state assemblies led by opposition. She imposed presidential rule in Tamil Nadu, Maharashtra, U.P., Bihar, Orissa, M.P., Rajasthan, Punjab and Gujarat.",
        "1986": "Jiddu Krishnamurti, famous Indian philosopher (Kingdom Happiness), passed away at the age of 90 yrs at Ojai, California, USA.",
        "1991": "Krishnabai Mote, famous author and social worker, passed away.",
        "1992": "Tripura's Congress (I) ministry falls as TUJS withdraws support.",
        "1993": "Rani Gaidinliu, freedom fighter, social reformer and political leader, died at her native village in Manipur. The British army made a surprise attack on her position and captured her. On 17th October, 1932, Pandit Nehru once wrote \"A day will come when India will remember her and cherishe her\".",
        "1994": "Gopikrishna, internationaly famed 'Kathtak' exponent, died at the age of 61 years.",
        "1997": "Anand finishes sixth in the City of Linares category 19 chess where Kasparov makes in four-in-a-row.",
        "1998": "Re-poll is ordered in 599 polling stations spread over nine states, following reports of largescale booth capturing. The Election Commission is to probe malpractices in Madhepura, Baghpat and Patna."
    }
}