{
    "title": "Events for March 17",
    "events": {
        "1527": "Rana Sangram Singh, King of  Mewad, fought Babur near Kanwa at Agra and lost the battle and died thereafter. He had vowed not to enter Chittogarh without a victory.",
        "1769": "To establish the business of  English Mill's Cloth, East Indiian Company had imposed various restriction on weavers of Bengal to destroy the Muslim and textile industry in Bengal , which was meant to destroy the Indian cloth and 'malmal' industry.",
        "1782": "Salby Teaty was singed between Anderson (British) and  Scindia for the Maratha and East India Company.",
        "1798": "Rani Shiromani anounced to attack the British Army.",
        "1863": "Sayajirao Gaekwad of Baroda was born.",
        "1882": "Vishnushastri Chiplunkar, father of modern Marathi language, passed away.",
        "1905": "Narsinghcharya Purohit Tirunarayan Iyyangar, famous Kannad poet, music director and critic, was born.",
        "1909": "Pandit Ramchandra Narayan Dandekar, educationist and internationally famed Sanskrit scholar, was born at Satara, Maharashtra.",
        "1910": "Smt. Anutai Wagh, great social worker, passed away.",
        "1920": "Mujiburr Rahman, the first Prime Minister of Bangladesh, was born in Tungipara now in Bangladesh.",
        "1943": "Indian troops retreat from Rathedaung to Buthidaung in the face of a renewed Japanese offensive on the Arakan front in Burma.",
        "1955": "Indian Standard's Institute started working to control the quality of  Indian products and the ISI mark was issued to quality products.",
        "1957": "New Central Cabinet under J. L. Nehru sworn in.",
        "1959": "Dalai Lama XIV flees from Tibet after Chinese military occupied Tibet.",
        "1967": "4th Parliament (Lok Sabha) was formed.",
        "1982": "President's rule in Kerala.",
        "1985": "Dattu Phadkar, cricketer (Indian all-rounder, 31 Tests 1947-58), passed away.",
        "1987": "Sunil Gavaskar ends his Test career with an innings of 96 v Pak.",
        "1988": "First operational Indian Remote Sensing Satellite (IRS-1A) launched by a Russian Vostok. IRS system under National Natural Resources Management System (NNRMS) coordinated at national level by the Planning Committee of NNRMS (PC-NNRMS) and the data from IRS satellites is processed by the National Remote Sensing Agency, Hyderabad. SI, a US Company, also receives and markets IRS data worldwide under a commercial contract with Antrix Corporation of the Department of Space.",
        "1989": "Hemwati Nandan Bahuguna, president of Lok Dal (B) and former Union Minister, passed away.",
        "1991": "The first Indian Remote Sensing Satellite IRS-IA completes three years of successful operation. (18-3-91).",
        "1992": "Suburban rail fare increase cut; 20\\% hike in first class, second class A/C sleeper and chair car reduced to 15\\%.",
        "1994": "Wali Mohammad Itto, former Speaker of J&K Assembly shot dead by militants.",
        "1995": "Congress-I in Arunachal Pradesh wins two-third majority.",
        "1997": "A Delhi court sentences former Union Minister Kalpnath Rai to 10 years RI.",
        "1999": "GM Dibyendu Barua and IWM S. Vijayalakshmi (both India) won the men's and women's titles respectively in the Asian Zonal chess championship in Mumbai.",
        "2000": "V.C. Pande, Bihar Governor, accords sanction to the CBI to prosecute  RJD president  Laloo Prasad Yadav  in a disproportionate assets case."
    }
}