{
    "title": "Events for April 17",
    "events": {
        "1479": "Acharya Surdasji, famous poet in Hindi and great devotee of Lord Krishna, was born.",
        "1675": "Chhatrapati Shivaji Maharaj attacked the Fonda fort and won Karwar.",
        "1799": "Srirangapatnam was surrounded by British Army  in the fourth and last Mysore war which began in 1798. Tipu Sultan' was killed in the battle on 4th May. The East India Company announced the Seringapatanam Medal (1799).",
        "1904": "Naoomal Jeoomal Makhija, cricketer, pioneer Indian Test opening batsman, Right Arm Bowler and played 3 matches, was born at Karachi.",
        "1917": "V.Sp. Manickam, famous Hndi writer, was born at Melasivapuri (Pudukkottai).",
        "1923": "Lindsay Anderson, director (Thursday's Children), was born in Bangalore, India.",
        "1941": "Office of Price Administration was formed which handled the rationing of essential commodities.",
        "1945": "Gandhiji, in a statement regarding the ensuing San Francisco Conference, says that 'peace is impossible without equality and freedom of India'. Also demands a just peace for Germany and Japan.",
        "1946": "Bellary Raghava, famous actor, social worker, lawyer and dramatist, passed away.",
        "1952": "First Lok Sabha was formed. Ananthasaynam Ayyangar, was elected as the first Deputy speaker of Lok Sabha (1952).",
        "1975": "Dr. Sarvapalli Radhakrishnan, India's second president, died at Madras.",
        "1977": "Swatantra Party was merged in Janata Party.",
        "1983": "Rohini (RS-D2), placed in orbit, was used for conducting some remote sensing technology studies using a landmark sensor payload. Launched by the second developmental launch of SLV-3.",
        "1990": "Dinkar Gangadhar Kelkar, famous Director of Raja Kelkar Museum, passed away.",
        "1996": "Indian Railways bars AIDS patients from using trains.",
        "1997": "Biju Patnaik, 81, Janata Dal leader and important personality in Orissa politics, died.",
        "1998": "BJP Prof. Chaman Lal Gupta retains his Lok Sabha seat in the Udhampur-Doda-Kathna constituency defeating National Conference's  Rajinder Kumar Chib by over 50,000 votes.",
        "1999": "The Vajpayee Government resigns after it loses the confidence vote in the Lok Sabha by one vote - 269 to 270."
    }
}