{
    "title": "Events for May 17",
    "events": {
        "1498": "Admiral Dom Vasco-da-Gama (c.1469-1524)-I, Portuguese navigator, arrived in India. He sailed around the Cape of Good Hope to Calicut, Kerala with three vessels and was the first Westerner to sail to India from Europe.",
        "1540": "Sher Shah defeated Humayun for the second time at Hardoi in U.P. in the battle of Kanauj.",
        "1775": "Marathas were badly mauled in the battle of Arras by Col. Keating in the first Anglo - Maratha war.",
        "1857": "Bahadhur Shah II declared as the emperor of India.",
        "1865": "Raobahadur Govind Sakharam Sardesai `Riyasatkar' was born.",
        "1873": "Hindi daily 'Bharat Mitra' started from Calcutta.",
        "1887": "Ranglal Bandopadhyay, Bengali poet, essay-writer and journalist, passed away.",
        "1897": "Dhirendra Varma, famous linguist, was born.",
        "1916": "Gurusiddappa Sivappa, great industrialist, was born at Bangalore.",
        "1927": "A.N. Radhakrishnan, great educationist, was born.",
        "1949": "India decided with only one dissent vote to remain within the Commonwealth of Nations.",
        "1957": "Nehru, who went to Ceylon to celebrate the 2,500th anniversary of the founding of Buddhism, calls for an end to nuclear tests.",
        "1974": "Durgadas, famous Indian journalist, passed away.",
        "1976": "4 Indians successfully skied down from the slope of Trishul peak.",
        "1980": "V. S. Kumar Anandan sets record of balancing on one foot for continuous 33 hrs.",
        "1991": "Prabhakar Machve, great litterateur, passed away.",
        "1992": "R. Venkataraman, President, leaves for a six-day visit to China.",
        "1993": "Visiting Israeli Foreign Minister Shimon Peres signs an MOU with his Indian counterpart to end nearly 4 decades of inactivity in bilateral relation.",
        "1994": "Nar Bahadur Bhandari voted out in Sikkim; Sikkim Sangram Parishad leader Sanchaman Limboo takes over as CM.",
        "1995": "Three North Eastern States removes restricted area permits (RAP).",
        "1996": "Rusi Modi, cricketer (736 runs 10 post-war Tests for India), passed away.",
        "1997": "Two workers belonging to Mamsapuram near Srivilliputtur ''burnt alive'' at neighbouring Edayankulam by its residents who took them hostage.",
        "1998": "US President Bill Clinton wants India and Pakistan to sign CTBT.",
        "1999": "Sonia Gandhi resigns as Congress president but the CWC(I) rejects it.",
        "2000": "The Union Cabinet clears a proposal for setting up a new appellate tribunal for foreign exchange following the repeal of the FERA and the enactment of  FEMA in its place."
    }
}