{
    "title": "Events for June 17",
    "events": {
        "1674": "Jijabai, mother of Chhatrapati Shivaji Maharaj, died.",
        "1756": "Nawab Sira-ud-Daulah attacked on Calcutta with 50,000 soldiers and captured it on June 21.",
        "1824": "Bureau of Indian Affairs established.",
        "1839": "Lord William Bentik, governor general of India, was born.",
        "1862": "Lord Charles Jhon Canning, Governor General and Viceroy of India (1856-1862), died.",
        "1887": "Dr. Kailas Nath Katju, freedom fighter, politician, leader and Governor of Orissa and West Bengal, was born.",
        "1903": "Jyotiprasad Agarwal, Assamia playwright, poet and music director, was born.",
        "1913": "Waman Vasudev Chitle (Bal Chitle), Marathi story writer and editor, was born.",
        "1917": "Krishan Kumar Chopra, medical practitioner and social worker, was born at Lahore.",
        "1928": "Pandit Gop Bandhu Das, famous writer, social worker and the creator of Orissa, passed away.",
        "1933": "The civil disobedience campaign  ended.",
        "1947": "Burma was adopted as republic by constitution assembly.",
        "1950": "Syed Wazir Ali, cricketer (7 Tests for India), passed away.",
        "1961": "The HF-24 Marut supersonic fighter, designed by German engineer Kurt Tank, makes its maiden flight.",
        "1965": "Motilal, famous actor, died.",
        "1973": "Leander Vece Paes, tennis player who singles bronze at Atlanta Olympics (1996), was born. He was also a winner of French Open in 1999, Gold Flake Open, Newport 1998, Wimbledon 1999 (doubles and mixed doubles).",
        "1976": "Montreal Olympics opens.",
        "1991": "Prabhakar Machve, famous litterateur, passed away.",
        "1993": "K. D. Dharmadhikari (Nana), veteran freedom fighter, died.",
        "1994": "Twelve opposition legislators in Sikkim resign.",
        "1995": "Motilal Vohra, UP Governor, sets agenda for a two-day special session of the UP Assembly asking the speaker to take up a motion against self first.",
        "1996": "Balasahab Devras, Sarsangha Chalak of Rashtriya Sawyamsewak Sangh, died.",
        "2000": "Danial Latifi (83), well known jurist and senior Supreme Court advocate, died of cancer in New Delhi."
    }
}