{
    "title": "Events for August 17",
    "events": {
        "1761": "William Carey, the first English missionary to India, was born. He taught at the newly founded Fort William College at Calcutta from 1801 till his death and helped found the Serampore Press, which made the Bible accessible to over 300 million people.",
        "1780": "Indian Governor General Warren Hastings duel with Francis to settle personal and official quarrels. Francis was wounded but survived.",
        "1848": "Romesh Chunder Dutt, great political leader, writer and social worker, was born.",
        "1882": "Sir Ram Nath Chopra, noted professor of Pharmacology, was born.",
        "1909": "Madanlal Dhingra, famous revolutionary, was hanged at Paintanville Jail for assassinating Wyle and Lal Kaka.",
        "1911": "Y.R. Lokurkar, senior journalist, was born.",
        "1916": "Amritlal Naagar was born.",
        "1932": "V.S. Naipaul, great Indian writer, was born.",
        "1934": "Murasoli Shanmuga Sundram Maran was born in Thirukkuvalai village in Thiruvarur (Tamil Nadu).",
        "1944": "Indian Viceroy Viscount Wavell rejects Gandhi's request to discuss war support in return for Indian independence.",
        "1947": "The first British troop leaves for England after Indian independence.",
        "1958": "Sir John Hubert Marshal, excavator of Mohan-Jo-Daro and Takshashila, died.",
        "1970": "The first microwave link, which was set up without foreign assistance, was commissioned between Asansol, Dhanbad and Ranchi.",
        "1985": "Rajiv Gandhi announces Punjab state elections in India.",
        "1986": "In the Jehovah's Witnesses' case, the Supreme Court rules that \"singing National Anthem is not obligatory\".",
        "1992": "20 members of the Janata Dal led by Ajit Singh break away from the  parent body seeking separate seats in the Lok Sabha.",
        "1994": "Opposition ends Parliament boycott.",
        "1996": "CBI seizes another Rs. 65 lakhs from Sukh Ram's residence.",
        "1997": "I K Gujral, Prime Minister, said that Queen Elizabeth should not go to Amritsar, scene of Jallianwalla Bagh massacre, during her visit to India in October.",
        "1998": "National Human Rights Commission recommends compulsory registration of marriages in a bid to check child marriages."
    }
}