{
    "title": "Events for September 17",
    "events": {
        "1799": "Parshuram Bhau Patwardhan, an able leader and diplomat of Madhavrao Peshwa kingdom, passed away.",
        "1864": "Anagrik Dharmapal, religious reformer, was born.",
        "1876": "Sarat Chandra Chattopadhyay was born in Debanandpur village.",
        "1879": "E.V. Ramaswami Naicker, prominent leader of Dravid movement and social reformer, was born at Erode in Tamil Nadu.",
        "1885": "Keshav Sitaram Thakrey, journalist, social reformer and historian, was born.",
        "1892": "Shri Hanuman Prasad Poddar, social reformer, revolutionary and poet, was born in Shillong.",
        "1899": "First British troops leave Bombay for South Africa.",
        "1924": "Popati Ramchand Hiranandani, famous Hindi writer, was born at Hyderabad in Sind.",
        "1929": "La Fontaine, Air Chief Marshal D A La Fontaine PVSM and AVSM, VM, was born in Madras.",
        "1934": "Gandhiji announced his decision to retire from politics from October one to engage himself in the development of village industries, Harijan service and education through basic crafts.",
        "1937": "Sitakant Mahapatra, 1933 Gyanpeeth awardee and famous Orria poet, was born.",
        "1938": "Dilip Purushottam Chitre, famous Marathi poet, story writer, critic and Sahitya Academy awardee, was born.",
        "1948": "The Nizam of Hyderabad, in a broadcast, announced ceasefire to his troops and accession into Indian Union, which was settled earlier to the announcement.",
        "1950": "Govt. grants diplomatic recognition to Israel.",
        "1954": "India outlaws bigamy.",
        "1956": "Oil and Natural Gas Commission (ONGC ) established.",
        "1960": "Agreement reached with Pakistan on the distribution of the River Indus and its tributaries.",
        "1997": "Kalpakkam Mini Reactor (KAMINI), the only U-233 fuelled operating reactor in the world, attains maximum capacity of 30 KW.",
        "1998": "Rabri Devi, Chief Minister of Bihar, expands the Cabinet, inducting nine ministers, even as the Jharkhand Mukti Morcha (Soren) group formally withdraws support to her ministry.",
        "1999": "Narayan Desai, Ajoy Kumar Basu and Saraswathi Gora are named for Jamnalal Bajaj awards."
    }
}