{
    "title": "Events for December 18",
    "events": {
        "18\tDecember\t1398": "Amir Timur captured Delhi.",
        "18\tDecember\t1756": "Guru Ghasidas, freedom fighter and social reformer, was born in Girod a small village in Sona Khan.",
        "18\tDecember\t1906": "Gandhiji returns to South Africa.",
        "18\tDecember\t1917": "Surendranath Dasgupta, great educationist, passed away.",
        "18\tDecember\t1924": "Justice Venkatramayya was born.",
        "18\tDecember\t1949": "Joni Flynn, famous actress (Octopussy), was born in Assam, India.",
        "18\tDecember\t1960": "National Museum inaugurated in New Delhi.",
        "18\tDecember\t1961": "Lalchand Sitaram Rajput, cricketer (Indian Test opening batsman 1985-86), was born in Bombay.",
        "18\tDecember\t1971": "Indira Gandhi, PM, receives the Bharat Ratna.",
        "18\tDecember\t1977": "Indira Gandhi resigns from the executive committee of the Congress party.",
        "18\tDecember\t1984": "Reactor Research Centre of Kalpakkam established on 12th March 1969 was renamed as Indira Gandhi Centre for Atomic Research.",
        "18\tDecember\t1988": "Rajiv Gandhi visits China. It was the first visit to China in 34 years by an Indian PM.",
        "18\tDecember\t1989": "Rabi Ray from Orissa elected Speaker of the Lok Sabha.",
        "18\tDecember\t1992": "BJP expresses regret over the demolition of the Masjid in Ayodhya in Parliament.",
        "18\tDecember\t1995": "Dr. Julias K. Nyrere, former Tanzanian President, receives the first annual International Gandhi Peace Prize.",
        "18\tDecember\t1998": "Sonia Gandhi hints that the Congress(I) is not keen on forming Government at the Centre with the help of other parties and that it would prefer to return to power on its own strength.",
        "18\tDecember\t1999": "The PWG blasts a railway track in Bihar.",
        "18\tDecember\t2000": "The Tatas and the Hindujas are shortlisted for disinvestment in both Air India and Indian Airlines, while Videocon International for the domestic airline."
    }
}