{
    "title": "Today in Indian History - Events for October 18",
    "events": {
        "18-October-1712": "Jeremias Van Riemsdijk, Governor General of Dutch Indies (1775-77), was born.",
        "18-October-1861": "Chintaman Vinayak Vaidya, historian and researcher, was born.",
        "18-October-1879": "Branch of 'Theosophical Panth' established in India.",
        "18-October-1901": "Mahatma Gandhi sails for India.",
        "18-October-1906": "Depressed Classes Mission Society' was established by Vitthal Ramji Shinde.",
        "18-October-1919": "W. A. Sangma, leader of Meghalaya, was born.",
        "18-October-1925": "Narayandatt Tiwar, former Central minister and Chief Minister of Uttar Pradesh, was born.",
        "18-October-1927": "Ramesh Vithaldas Divecha, cricketer (11 wickets for India in early 50's), was born in Bombay.",
        "18-October-1928": "Roshan Harshadlal \"Deepak\" Shodhan, cricketer (century on Test debut for India), was born in Ahmedabad.",
        "18-October-1952": "Vinoo Mankad takes 13 Pakistan wickets to win first Indo-Pak clash.",
        "18-October-1968": "Narendra Deepchand Hirwani, cricketer (Ind leggie 16 wickets vs WI on debut in 1988), was born in Gorakhpur.",
        "18-October-1980": "The first Himalayan Car Rally of 5,377.9 km was started from Brabourne Stadium, Bombay with 74 starters.",
        "18-October-1983": "Vijay Manjrekar, cricketer 55 Tests for India, 3208 runs @ 39.12, died.",
        "18-October-1992": "Zimbabwe's first Test match vs India at Harare.",
        "18-October-1993": "Mandakini Athvale, first child actor of Indian film industry, died.",
        "18-October-1995": "Baby Naaz (Anuradha Bhakkar), famous child actor, died.",
        "18-October-1996": "Vigyan Bhawan in Delhi to be the venue for the trial of former PM Rao.",
        "18-October-1997": "Prince Philip switches on the internet version of Malayala Manorama and The Week at Kochi.",
        "18-October-2000": "Ram Vilas Paswan, Union Communications Minister, announces relief for phone users. New links to cost Rs. 2,000 in urban areas and Rs. 500 in rural areas."
    }
}