{
    "title": "Events for January 18",
    "events": {
        "1842": "Mahadev Govind Ranade was born. He was the chief architect of Bombay Prathana Samaj.",
        "1906": "Nirupam Chandra Ganguli, criminal lawyer and sportsman, was born at Bhagalpur.",
        "1913": "Gandhiji refers in ''Indian Opinion'' the possibility of return home to India by mid-year.",
        "1925": "Gajanan Johari, famous Marathi writer, was born.",
        "1930": "Gurudev Rabindranath Thakur (Tagore) and Mahatma Gandhi met at Sabarmati Ashram.",
        "1932": "Shyam Nandan Kishore, great educationist, was born at Muzaffarpur.",
        "1936": "Rudyard Kipling (1865-1936), famous English writer and author, died in Burwash, England at 70. He was a young journalist in British India. He wrote in verses, stories, novels childen's stories some of these were \"The Jungle Book, Kim and Just-50 stories\" and was honoured with the Nobel Prize for Literature in 1907 for 'Kim' (Indian based story).",
        "1938": "The last batch of the political prisioners sailed back to the mainland from the Cellular Jail.",
        "1942": "Gandhiji restarts 'Harijan' and allied weeklies.",
        "1947": "Kundanlal Saigal, famous film star and unique singer, died at Jalandhar.",
        "1948": "Gandhi breaks 121-hour fast in New Delhi, after halting of Muslim-Hindu riots in Calcutta. He breaks the fast on security pledges from communal leaders who \"Peace Pledge\" to Gandhiji.",
        "1950": "Batubhai Umarwadia, father of Gujrati literature's English type and drama writer, passed away.",
        "1959": "Miss Meera Behn, follower of Gandhi, left India for good.",
        "1963": "Laxminarayn Sahu, litterateur, journalist and social reformer, passed away.",
        "1968": "The Resolution on Official Languages was passed by both the houses of the Parliament wherin the need to formulate a more intensive and comprehensive programme for the progressive use of Hindi for Official purposes, preparing annual assessment report for reviewing the progress, formulating a programme for the co-ordinated development of the other languages included in the 8th schedule alongwith Hindi, adopting of a tri-langual formula, making the knowledge of either Hindi or English compulsory for recruitment to the services of the Union, and inclusion of all the languages of the 8th schedule of the Constitution and English as the optional medium for the exams conducted by the union Public Service Commission at the appropriate time, has been stressed.",
        "1969": "Prajapita Brahma, great social reformer and freedom fighter, passed away.",
        "1970": "Kishan Singh at Cuttack sets record for 50 Km W.in 4.19.48.",
        "1971": "Barrister Nath Pai, freedom fighter and member of parliament, passed away at the age of 49.",
        "1972": "Vinod Ganpat Kambli, cricketer (prolific Indian batsman 1993-), was born in Bombay.",
        "1977": "Morarji Desai and other opposition leaders were released from jail and Lok Sabha was dissolved by the president during the emergency period.",
        "1978": "Shri Bhim Sen Sachar, freedom fighter, leader and Chief Minister of Punjab, passed away.",
        "1980": "Assam agitation turns violent;  Army called in.",
        "1982": "Six thousand labor activists arrested in two days and national strike called in New Delhi.",
        "1983": "Indi Singh, Soccer(Football) player, was born in Vancouver, Canada.",
        "1985": "Spy ring cracked. Top Government officials, businessmen held.",
        "1990": "Farooq Abdullah, J&K CM, quits.",
        "1992": "Muthuswami Pillai, father of Bharat Natyam classical dance, passed away.",
        "1994": "Narasimha Rao decides to retain Veerappa Moily as Karnataka CM.",
        "1995": "The 4-nation non-official initiative on Arms Reduction and Disarmament concludes with Goa Declaration (also called Shanghai-II).",
        "1996": "N. T. Rama Rao, chief minister of Andhra Pradesh (during 1983-84, 84-89, 94-95), passed away at Hydrabad.",
        "1997": "Khanna Committee recommends more power to RBI over non-banking financial companies.",
        "1998": "Justice M. M. Punchhi is sworn in Chief Justice of India.",
        "1999": "The office of the Board of Control for Cricket in India is ransacked allegedly by Shiv Sainiks protesting agains Pakistan team's tour of India. Shiv Sena denies hand in attack.",
        "2000": "S. S. Dawra is appointed new Director of the Enforcement Directorate."
    }
}