{
    "title": "Events for November 18",
    "events": {
        "18\tNovember\t1727": "Maharaja Jai Singh-II of Amber laid the stone of Jaipur City. Vidyadhar Chakravarty of Bengal was the architect of the first planned city in India.",
        "18\tNovember\t1772": "Madhav Rao Peshwa (the 4th peshwa ruler) died at the age of 28. Narayanrao succeeded him.",
        "18\tNovember\t1839": "Nainital was discovered by P. Barron, an European sugar merchant and an enthusiastic hunter from Rosa, near Shahjahanpur. He had no sooner caught a glimpse of the lake in its sylvan setting than he realized its potential as a hill resort and went full steam a colonizing it. Moved by the beauty of the sparkling lake he wrote: \"It is by far the best site I have witnessed in the course of a 1,500 miles trek in the Himalayas\".Nainital history figures in ancient India too. In the Manas Khand of the Skand Puranas, Nainital Lake is called Tri-Rishi-Sarovar, hinting at the story of three sages (or rishis), Atri, Pulastya and Pulaha, who, upon finding no water in Nainital, dug a large hole at the location of the present day lake (sarovar = lake) and filled it with water from the holy lake Manasarovar in Tibet. According to lore, a dip in Naini Lake, “the lesser Manasarovar,” earns merit equal to a dip in the great lake.It is also believed that The Naini Lake is one of the 64 Shakti Peeths, Sati’s eyes (or Nain) fell, came to be called Nain-tal or lake of the eye. The goddess Shakti is worshipped at the Naina Devi Temple on the north shore of the present day lake.",
        "18\tNovember\t1898": "Prabodh Chandra Bagchi researcher of \"Ancient History of India\", was born. He was one of the most notable Sino -Indologists of the 20th century. He was the third Upacharya (Vice-Chancellor) of Visva-Bharati University. He worked on Sanskrit Buddhist literature, on the ancient remains of Indian civilisation in Central Asia, on Buddhist literature in China, on the ancient Pali texts, on Avestan Gathas.\n.",
        "18\tNovember\t1901": "V. Shantaram also referred as Shantaram Bapu, having full name as Shantaram Rajaram Vankudre, was a famous Indian filmmaker, film producer and actor, a true legend. He is most known for films such as Dr. Kotnis Ki Amar Kahani (1946), Amar Bhoopali (1951), Jhanak Jhanak Payal Baaje (1955), Do Aankhen Barah Haath (1957), Navrang (1959), Duniya Na Mane (1937), Pinjra (1972), and many more. He also founded then most sophisticated studios of the country \"Rajkamal Kalamandir\" in Mumbai.",
        "18\tNovember\t1911": "Free primary school education is introduced.",
        "18\tNovember\t1925": "Madhukar Gopal Pathak, noted author and film director, was born.",
        "18\tNovember\t1936": "V. O. Chidambaram Pillai, great freedom fighter, social reformer, politician, prolific writer and leader, died.",
        "18\tNovember\t1937": "Rajinder Pal, cricketer (pace bowler in one Test India v Eng, 0-22), was born in Delhi.",
        "18\tNovember\t1948": "Nearly 500 people were drowned when the ferry steamer Narayan River capsized and sank in the Ganga  near Patna.",
        "18\tNovember\t1955": "Nicolai Bulganin and Nikita Khrushchev, top USSR Soviet leaders, first time came to New Delhi.",
        "18\tNovember\t1960": "Raghunath Chaudhary, famous natural poet of Assam, passed away.",
        "18\tNovember\t1961": "The Navy went into action under the command of Rear Admiral BS Soman, then Flag Officer Commanding, Indian Fleet. The ships conducted their mission in three geographical areas for liberating Goa .",
        "18\tNovember\t1964": "Dharam Vira was appointed as the Cabinet Secretary of India. He held this office till 27-06-1966.",
        "18\tNovember\t1972": "Tiger was adopted as India's 'National Animal'.",
        "18\tNovember\t1973": "Mother of Sri Aurobindo Ashram, Pondicherry, passed away. She came to India in 1914.",
        "18\tNovember\t1974": "Rajni Pannikar,noted story writer, passed away.",
        "18\tNovember\t1978": "Dhirendra Ganguly, film maker, writer, director and actor, passed away.",
        "18\tNovember\t1988": "Soviet leader Mikhail Gorbachev arrives in Delhi on a three-day visit.",
        "18\tNovember\t1991": "In the by-elections, Congress gets 8 Lok Sabha seats and suffers rout in UP assembly,  while BJP gets absolute majority.",
        "18\tNovember\t1994": "Bipinchandra Joshi, cheif of Army and General, passed away at the age of 54 years.",
        "18\tNovember\t1997": "US Secretary of State Madeleine Albright arrives in New Delhi. Ms. Albright said she raised the 'all-important issue of terrorism' with Pakistan's top leadership.",
        "18\tNovember\t1999": "Three Lashkar-e-Taiba militants, including its Chief Commander, are killed in a fierce encounter with Special Operations Group (SOG) in Jammu and Kashmir.",
        "18\tNovember\t2000": "Yashwant Sinha, Finance Minister, said there would be no cuts in Income Tax rates in the next budget, and signalled that the reforms process will continue."
    }
}