{
    "title": "Events for February 18",
    "events": {
        "1266": "Nasiru'd-din Muhammad Shah I passed away. His son-in-law Ghiyasu'd-din Balban succeeded Nasiru'd-din Mahmud in Delhi.",
        "1486": "Mahaprabhu Sri Chaitanya Devji alias Gaurang, Vishwambhar Mishra, Vaishnav Saint of Bengal, was born at Nabadwip in Bengal.",
        "1665": "The Portuguese handover Mumbai island to England.",
        "1823": "Gopal Hari Deshmukh, lokhitwadi, was born.",
        "1836": "Swami Ramakrishna Paramahansa(1836-86), was born early morning in Kamarpukur village in Hooghly district, West Bengal. His real name was Gadadhar Chatterji. He was God-intoxicated Bengali Shakta saint, Guru of Swami Vivekananda. He exemplified the bhakti dimension of 'Shakta Universalism'.",
        "1871": "Vishnubuwa Brahamchari, first missionary of Hindu religion, passed away.",
        "1895": "Shri Rafi Ahmed Kidwai, nationalist, patriot, social reformer and Congress leader, was born at Masauli village, Barabanki District.",
        "1899": "Jainarain Vyas, leader, freedom fighter and social reformer, was born at Jodhpur, Rajasthan. He played a leading role in creating united Rajasthan by integration of various states of Rajputana. He was the first Chief Minister of Rajasthan from 1951 to 1954.",
        "1905": "Shyamji Krishna Varma established India House in London to help Indians visiting England. He also established the Indian Home Rule society, which helped him to raise his voice against British Domination in India.",
        "1906": "Madhav Sadashiv Golwalkar, chief of 'Rashtriya Swayansewak Sangh' (RSS), was born.",
        "1911": "Captain Vasudev Belwalkar, who had also written the novels on history and war, was born.",
        "1918": "Gopal Krishna Adig, modern Kannad poet, was born.",
        "1925": "Krishna Sobati, famous Hindi authoress, was born.",
        "1931": "Swraj Paul, Indian and British industrialist and multi-millionaire (Caparo), was born.",
        "1941": "There was a minor revolt in Royal Indian Navy which in now known as Indian Navy.",
        "1944": "Bhartiya Gyanpeeth Institute' established.",
        "1945": "Kal Yug' era passed away.",
        "1946": "Cabinet Mission in India.",
        "1974": "Daniel Moynihan, US ambassador to India, presents $2,046,700,000 cheque.",
        "1975": "Syed Nazir Ali, cricketer (2 Tests for India, 4 wickets), passed away.",
        "1983": "Violence between Hindu Tamils and Buddhist Singhalese in Sri Lanka marks beginning of Tamil rebellion by Tiger freedom fighters demanding an independent nation called Eelam. Prolonged civil war results.",
        "1988": "Jan Nayak Karpoori Thakur, freedom fighter, political leader, great social reformer, teacher and national president of Samyukta Socialist Party, passed away.",
        "1992": "47 die in Tamil Nadu's Kumbakonam Mahamakham stampede.",
        "1993": "Phoolan Devi, the legendary Bandit Queen, was released after 11 years in jail. A heroine to many low-caste Indians, she was born into the Mallah caste of fishermen, close to the bottom of India's rigid social scale, and became a bandit after she was gang-raped. She led her rural band in robbing and killing upper-caste Thakurs in revenge for the murder of her lover and acquired a Robin Hood image. The Rebel of the Ravines siad, \"I shall work for the upliftment of the women and downtrodden\".",
        "1994": "India rejects OIC offer to mediate on Kashmir.",
        "1996": "Kenya's first full One Day International Cricket match at Cricket World Cup vs India. Tendulkar scored 127* and India won over Kenya.",
        "1997": "Dhaniram Baruah, controversial heart surgeon who claimed to have transplanted a pig's heart into one of his patients, released on bail in Guwahati.",
        "1998": "C. Subramaniam, former Maharashtra Governor, is awarded Bharat Ratna.",
        "1999": "Ramakrishna Hedge, Commerce Minister, launched the India Brand Equity Fund (IBEF).",
        "2000": "Pandit Ravi Shankar is selected for this year's Subbarami Reddy Kalapeetham Foundation Award, a life-time achievement award, for his contribution to Indian music."
    }
}