{
    "title": "Events for March 18",
    "events": {
        "1896": "Pandit Kunjilal Dubey, freedom fighter, educationalist and politician, was born at Amgaon, District Narsinghpur.",
        "1915": "British Government approved Indian Security Act to have greater control on the Indian people.",
        "1916": "Pratapsinh Mathuradas Vissanji, great industrialist, was born at Bombay.",
        "1919": "Rowlatt Act, intended to perpetuate the extraordinary powers enjoyed by the Government under Lord Chelmsford during the war, provokes countrywide protests. This Rowlatt Act was forced instead of 1915 Indian Security Act which reduced freedom of Indian people.",
        "1922": "Mohandas K. Gandhi \"Mahatma,\" the great spirit, sentenced by British authorities to six years in prison for sedition at Sabarmati. Gandhi was sentenced just eight days after he was arrested. The British acted hastily after government officials in London and India were criticized for not arresting him sooner. In London, the Secretary of State for India was forced to resign because of the controversy over Gandhi. In India, the arrests of Gandhi and other Indian nationalists had only increased sympathy for their cause.",
        "1924": "Madhusudhan Ramachandra Rege, cricketer (15 runs in only Test India v WI 1948-49), was born in Panvel, Maharashtra.",
        "1938": "Shashi Kapoor, famous film producer, director, actor and dramatist, was born in Calcutta. He has made sucessful films like Junoon, Kaliyug, Heat and Dust, etc.",
        "1944": "Azad Hind Fauj entered  India (Japanese army) from the border of Burma and invaded north eastern India.",
        "1948": "Socialist Party of India (SPI) disassociates itself from the Congress.",
        "1953": "Backward Classes Commission inaugurated.",
        "1972": "First Indian Book Fair was organised by National Book Trust in New Delhi.",
        "1974": "Buddhadev Basu, modern Bengali poet, story writer, playwright and critic, passed away.",
        "1990": "Devi Lal, Deputy PM, withdraws his resignation.",
        "1991": "West Bengal opts for assembly poll.",
        "1992": "Shreyanprasad Jain, famous philanthropist and industrialist, passed away.",
        "1996": "President confers gallantry awards on 65 personnel of the defence forces.",
        "1997": "Indo-Bangladesh friendship treaty, signed 25 years ago, expires.",
        "1998": "A.B. Vajpayee, the Prime Minister-designate, releases the 'national agenda for governance' in New Delhi. It is silent on the Ram temple issue, scrapping of Article 370 and a uniform civil code."
    }
}