{
    "title": "Events for April 18",
    "events": {
        "1336": "The famous Vijaynagar Hindu Empire established (1336-1565-1646), Deccan region of South India is founded. European visitors are overwhelmed by the wealth and advancement of its 17-square-mile capital.",
        "1612": "Khurram prince was married to Arjumand Banu Begum.",
        "1858": "Bharatratna Dhondo Keshav Karve, great educationalist and social reformer, was born.",
        "1859": "Tatya Tope (his original name was Ramchandra Raghunath Tope) a leader of Sepoy Mutiny, was captured in April, courtmarshalled and hanged at Sivpuri for 1857 Indian Mutiny.",
        "1898": "Damodar Hari Chapekar, India's first revolutionary,  was hanged in the Yervada Central Jail. He was punished for killing the Rand and Ayrest British Officials.",
        "1904": "Ramnath Goenka, president and founder of Indian Express Group, was born.",
        "1914": "Jamshedji R. Patel, cricket Test Umpire for 9 tests from 1948-59, was born in Mumbai.",
        "1916": "Iyyer G. Subramaniam, Congress leader, passed away.",
        "1917": "Gandhi saw one of his testing grounds of Satyagraha in Champaran. He defied section 144 of Criminal Act.",
        "1918": "Amboo alias Lalita Pawar was born in Indore. She will be always remembered as the a leading film actress and character artist. Her first film was 'Ganimi Kawa' (1928). Some of the other films of silent era are Shri Balaji, Bhimsen, Champion of the Sward, Chatur Sunderi, Goodbye Marriage, Flaming Soul, Kailash.",
        "1926": "Padmakar Ganesh Chitle, famous Marathi novelist, was born.",
        "1930": "Surya Sen alias Masterda attacked on Armoury of Chittagong with 62 men of the Indian Republican Army.",
        "1931": "Lord Willingdon took over as the Viceroy of India.",
        "1956": "India, Indonesia, Burma, Ceylon and Pakistan meet in New Delhi to reaffirm their faith in Bandung Principles.",
        "1959": "Premier Chou En-lai insists Tibetan Dalai Lama was abducted to India.",
        "1961": "Pamella Bordes, photographer and model, was born in New Dehli, India.",
        "1966": "Kuwalyanand Swami (Jagannath Ganesh Gune), great Physical Training and Yoga expert, passed away.",
        "1970": "Dr. Dharmendra of the Indian Council of Medical Research awarded the Damien-Duttan Award for outstanding work in leprosy.",
        "1971": "Gavaskar makes 220 in second innings vs West Indies after 124 in first.",
        "1978": "Sardar Sobha Singh, famous builder of modern New Delhi, passed away at the age of 90.",
        "1991": "Kerala declared the first fully literate state in the country.",
        "1992": "Russia suspends transfer of rocket technology to India.",
        "1993": "BJP issues white paper on Ayodhya.",
        "1998": "Dr. A. R. Kidwai is appointed Governor of West Bengal.",
        "2000": "A. B. Vajpayee, Prime Minister, constitutes a Group of Ministers to review the national security system in its entirety in the light of the recommendations of the Kargil review committee."
    }
}