{
    "title": "Events for May 18",
    "events": {
        "1772": "Janoji Bhosle, warrior in Peshwa kingdom, passed away.",
        "1775": "Warren Hastings expressed doubt of hanging Nandkumar.",
        "1872": "Bertrand Russell, great philosopher, mathematician, author and Chairmain of the Indian League, was born.",
        "1901": "Nibaran Chandra Chakrabarti, great poet and Hindi writer, was born in Brahmangaon, (Dacca).",
        "1912": "Narayan Govind Chitre, with the help of R. P. Tipnis and Cameraman Johnson, produced a 8000 ft. long theatrical film 'Pundalik', which was directed by Ramchandra Torney alias Dada Saheb Torne. The entire film was shot in a theatre at Mangaldas Wadi in Bombay, where the Sangit Mandali, a professional theatre group, was performing a play 'Pundalik'.  The film was released on May, 18 in the Coronation Cinematograph at Girgaum, Bombay.",
        "1926": "Naranjan Bhagat, famous Gujrathi poet, was born.",
        "1932": "Hindu-Muslim riots take place in Bombay. 150 are killed or injured. Jinnah - the permanent president of the Muslim league, began to spread the rumors that Muslim minority was in danger under Hindu majority and actively propagated the theory of two separate nations.",
        "1933": "Gandhiji commences at noon 21 days' fast for self-purification; released unconditionally at 9 p.m.",
        "1945": "Bhagwat Subramaniam Chandrasekhar, cricketer (brilliant Indian leggie 1964-79), was born in Banglore. He received Arjun Award and Padmashree awards in 1972.",
        "1946": "Gandhiji discusses Plan with Cabinet Mission.",
        "1955": "Hindu Marriage Act is amended.",
        "1966": "Panchanan Maheshwari, great Indian scientist of botany, passed away. He studied the morphology, anatomy and embryology of some angiosperms, the class of plants which produce flowers. He discovered species of plants like \"Panchanania Jaipuriensis and Isoeted Panchananil.\" He wrote two authoritative books, 'An Introduction to the Embryology of Angiosperms' & 'Recent Advances in Embryology on Angiosperms'. In 1951, he founded the International Society of plant Morphologists.",
        "1972": "Kokan Krishi (Agriculture) University was established.",
        "1973": "A powerful underground explosion rocked India's desert of Rajasthan today, making India the sixth nation in history to set off a nuclear device. The blast, which took place at a depth of 330 feet, was in the range of 10-15 kilotons, smaller than the bomb exploded by the US at Nagasaki in World War II. India is signatory to the 1963 test ban treaty, and thus was prohibited from exploding the device on land or in the air. Prime Minister Indira Gandhi claimed the purpose of the test was peaceful and said 'such explosions may have their use in mining operations'.",
        "1974": "Jayaprakash Narayan led a procession against economic conditions in Patna. There was lathi charged and he issued a call for total revolution. He also started the 'Citizens for Democracy' movement.",
        "1985": "Dr. P. C. Alexander appointed High Commissioner in Britain.",
        "1988": "The ten-day Golden Temple siege at Amritsar ends with the surrender of 46 militant Sikhs.",
        "1992": "President R. Venkataraman reaches Beijing.",
        "1995": "Sukhomoy Sengupta, 76, Tripura's first CM, passed away.",
        "1998": "India may take the US to WTO.",
        "1999": "R. B. Sapre, India's first national chess champion, died in Mumbai."
    }
}