{
    "title": "Events for June 18",
    "events": {
        "1633": "Revairu Diogu, dictionary creator of Konkani language and Jezoet Priest, died.",
        "1658": "Aurangzeb managed to capture the Agra Fort and later  arrested his father Emperor Shahjahan.",
        "1858": "Rani Laxmi Bai of Jhansi died while fighting with the British troops in the battlefield near Gwalior.",
        "1879": "Venketeshwar Bachhali, famous physics scientist, was born.",
        "1887": "Dr. Anugrah Narain Singh, freedom fighter, educationist, leader and Minister of India, was born in Poiyavan village, Gaya district, Bihar.",
        "1896": "Cota Ramaswami, cricketer (Davis Cup for India 1922, Test 1936), was born in Madras.",
        "1901": "Ramchandra Bhikaji Gunjikar, Marathi novelist and editor, passed away.",
        "1917": "Lachhmansingh Gill, famous politician and former chief minister, was born.",
        "1918": "A. R. Rajrajvarma, famous poet of Malayalam language, critic and master of grammer, passed away.",
        "1926": "Bhishma Singh Chauhan, great author, was born at Naglajula (U.P).",
        "1940": "Forward Block Party was established.",
        "1943": "British Field Marshal Archibald Wavell becomes Viceroy of India.",
        "1946": "Congress Working Committee decides to accept Interim Government scheme.",
        "1956": "New Hindu Succession Act was passed.",
        "1966": "California's hippie subculture converged into a mass of long hair, flowers, and rock music this weekend, as 50,000 flowed into the fairgrounds of the Monterey International Pop Festival. The event featured the largest collection of major rock acts ever assembled; thousands of fans had to be turned away from the sold-out concert. Established artists such as the Byrds, Jefferson Airplane, Otis Redding, and the Mamas and the Papas received the expected ovations from the huge audience. But the response was equally enthusiastic for performances by Indian sitar master Ravi Shankar and new talents Janis Joplin, the Who, and Jimi Hendrix, a young man who played the electric guitar like nobody else.",
        "1974": "Govinddas Seth, Hindi litterateur and politician, died.",
        "1978": "The Karakoram Highway, linking Gilgit in Pakistan-occupied Kashmir with Sinkiang in China, is opened.",
        "1979": "Sri Lanka beat India by 47 runs in Cricket World Cup upset.",
        "1988": "V.P.Singh defeats Congress rival Sunil Shastri in Allahabad Lok Sabha election.",
        "1989": "India and Pakistan decide to end the five-year-old confrontation in Siachen Glacier area by redeploying their forces.",
        "1991": "Congress emerges as the largest party in Lok Sabha polls though short of an absolute majority.",
        "1992": "Congress (I) chooses Dr. Shankar Dayal Sharma as Presidential candidate.",
        "1993": "The 14th national council of the BJP at Bangalore swears by Hindutva.",
        "1994": "The strength of the Sikkim Sangram Parishad ministry led by Sanchaman Limboo reduced to 14 in the 32-member house.",
        "1995": "The latest deaths in northern India's hottest weather this century bring the death toll to 525 as temperatures hit 113¦F (45¦C) in New Delhi.",
        "1996": "CBI arrests Sanjeeva Rao, relative of Narasimha Rao, and Prakash Yadav, son of former Union Minister, in the urea scam.",
        "1997": "Prakash Padukone launches IBC.",
        "2000": "K.M. Beenamol breaks P.T. Usha's record in 400m at 51.21 sec in an international meet at Kiev in Ukraine."
    }
}