{
    "title": "Events for August 18",
    "events": {
        "1227": "Genghis Khan, Monghol conqueror, passed away.",
        "1700": "Bajirao I, the second peshwa,  was born.",
        "1800": "Fort William College was established at Calcutta.",
        "1872": "Pandit Vishnu Digambar Paluskar Gadgil, who provided new heights to North Indian classical music, was born at Kundanwadi at Kolhapur distrist in Maharashtra.",
        "1891": "Jain Muni Mishrimalji, poet, social reformer and orator, was born at Pali, Rajasthan.",
        "1896": "Raghupati Sahay \"Firaq Gorakhpuri\", revolutionary Urdu poet, was born. He was honoured with the highest literary awards, including the Sahitya Academy Award in 1960 and Bharatiya Gyanpeeth Award in 1969. His notable works include \"Ruh-e-Kayenaat (Spirit of Universe, 1945)\" and \"Ramz-O-Kinayaat (Suggestion, 1946)\".",
        "1900": "Vijayalakshmi Pandit, first woman President of U.N.O. General Assembly, was born.",
        "1907": "Madam Bhikaji Cama, addressed the International Socialist Congress at Stuttgart, Germany.",
        "1911": "Adityanath Jha, former Governor of Delhi, was born.",
        "1920": "Harbhajan Singh, educationist and writer, was born at Lumding.",
        "1923": "Sadashiv \"Sadu\" Ganpatrao Shinde, cricketer (Indian leg-spinner during the late 1940's and early 1950's), was born in Bombay.",
        "1945": "Netaji Subhash Chandra Bose left Saigon and is believed to have died in a Japanese aeroplane crash at Taihoku Airport in Taiwan.",
        "1951": "Indian Institute of Technology was opened in Kharagpur, West Bengal.",
        "1956": "Sandeep Madhusudan Patil, great Indian batsman, was born in Bombay.",
        "1957": "Tilak Raj was appointed the Narcotics Commissioner of India. He headed his office for four years till 6th September, 1961.",
        "1958": "Dr.Bhagwandas, famous Congress leader and theosophist, died.",
        "1969": "Humayun Kabir, great politician, died.",
        "1979": "Vasantrao Naik, former Chief Minister of Maharashtra, died.",
        "1985": "Assam Assembly dissolved (18).",
        "1990": "Pandit Narayan Chaturvedi, senior Hindi litterateur, died.",
        "1991": "12 LTTE militants commit suicide.",
        "1993": "The Transport Development Council decides to abolish Pathkar (entry tax) and increase the fee for national permit from Rs. 1500 to Rs. 5000.",
        "1995": "Parvati Giri, also called the Little Mother Teresa, died in Orissa. She was 69. She was a social worker and had taken part during the Quit India movement.",
        "1997": "Shanvac-B, India's first genetically engineered vaccine for Hepatitis B was launched.",
        "2000": "The Supreme Court rejects a petition filed by former Navy chief Vishnu Bhagwat challenging his dismissal from service and the consequent direction stripping him of the title Admiral."
    }
}