{
    "title": "Events for September 18",
    "events": {
        "1615": "Thomas Roe presented himself at Jahangir's court in Ajmer. He left India on February 17, 1618.",
        "1803": "Puri was captured by Britishers from the Marathas without any struggle.",
        "1867": "Ganganendranath Tagore, great painter, patriot and artist, was born in Calcutta.",
        "1879": "Welthy Housinger Fisher, an American adult educationist in India, was born.",
        "1909": "Kilachand Ramdas, famous merchant, was born.",
        "1917": "Sher Singh, educationist and politician, was born at Baghpur (Haryana).",
        "1924": "Mahatma Gandhi was to fast for 21 days in despair of the recent riots between Muslims and Hindus. It was an expression of his 'unbearable hopelessnes'. \"Nothing I say or write,\" he said, \"can bring the two communities together.\" Even as he spoke there were reports of further riots at Kohat, in which 20 Hindus and 11 Muslims were killed. Reservations, Gandhi speaking in Allahabad said, reserved the right to drink water with or without salt. \"It is both a penance and a prayer. As it is penance I need not have taken the public into my confidence but I publish it as, let me hope, an effective prayer to Hindus and Muslims, not to commit suicide\".",
        "1925": "Pranlal Harkisandas Vora, leader in Maharashtra, was born.",
        "1927": "Maharashtra Chamber of Commerce was established.",
        "1932": "A Hindu delegation is given permission to interview Gandhi, currently held in prison and undertaking a hunger strike. On arrival, they also find he has taken a vow of silence.",
        "1941": "Arjuncharan Srimukh Sethi was born in Odang village in Balasore (now known as Bhadrak) in Orissa.",
        "1958": "Dr. Bhagwan Das, great philosopher, freedom fighter, Hindi writer, politician and litterateur, passed away.",
        "1965": "Communist government threatens dire consequences on discovering Indian bases on the Chinese side of the China-Sikkim frontier in China.",
        "1967": "English was adopted the official language of Nagaland .",
        "1972": "India becomes the top film producer of the world with 433 feature films made in 1971.",
        "1990": "Devkumar, famous Hindi film actor, died.",
        "1992": "M. Hidayatullah, former Vice President and Chief Justice, died. He was 87.",
        "1993": "Asit Sen, famous comedy actor and character artist, died.",
        "1995": "Kaka Hathrasi, famous comedy poet, died.",
        "1996": "Suresh Mehta ministry wins the confidence vote in Gujarat .",
        "1997": "President K.R. Narayanan inaugurates Mammen Mappillai Hall at Kottayam, Kerala.",
        "2000": "President K. R. Narayanan presents the Dada Saheb Phalke award for the year 1999 to film maker Hrishikesh Mukherjee."
    }
}