{
    "title": "Events for January 19",
    "events": {
        "1045": "Taimurlang passed away.",
        "1697": "Maharana Pratap, the founder of Mewad and eminent personality, passed away.",
        "1839": "Aden conquered by British East India Company.",
        "1855": "G. Subramaniam Iyer, active worker of Indian National Congress since its establishment, was born.",
        "1892": "Chintaman Vinayak Joshi, famous Marathi comedy writer, was born.",
        "1905": "Maharshi Devendranath Tagore, Bengali writer and thinker, passed away.",
        "1907": "Mohammad Ali Mirza was crowned as the \"Shah-E-Iran\" in a grand function held in Royal Palace, Tehran. This coronation was performed on the precious throne \"Thakt-E-Taus\" which was made by Emperor Shahjahan, and was taken away from India during the invasion of Nadir Shah in 1738 AD.",
        "1910": "Vinayak Damodar Karnaki (Master Vinayak), famous Marathi actor, director and producer, was born.",
        "1919": "Omprakash Mehra, former Indian Air Chief Marshal and former Governor of Maharashtra, was born.",
        "1931": "The first Round Table Conference held in London ended. This conference was attended by Dr. B. R. Ambedkar also.",
        "1932": "Balgovind Jaiswal, educationist and author, was born at Mhow.",
        "1948": "India and Pakistan accept U.N. mediation in New York.",
        "1951": "Amritlal Vithaldas Thakkar (Thakkarbappa), social reformer of Gujrat and right hand of Gandhiji in socially segregated Harijans, passed away.",
        "1960": "Ramchandra Gopal (Dadasaheb Torne), famous film director, passed away.",
        "1963": "Kuladhor Chaliha, one of the pioneer Congress leaders of Assam, passed away.",
        "1966": "Indira Gandhi elected leader of the Congress party to succeed the late Lal Bahadur Shastri as the third Prime Minister of India. She pledged to follow path of Non-Alignment in worlds affairs.",
        "1976": "C. V. Bawdekar, famous journalist, died.",
        "1977": "World's largest crowd--12.7 million--gather for Indian religious festival 'Kumbh Mela'.",
        "1982": "Bombay High Court finds allegations against Chief Minister A. R. Antulay justified. Antulay resigns.",
        "1985": "Dr. P. C. Alexander, principal secretary to the PM, quits following the arrest of three aides in an espionage case.",
        "1987": "Narain Dutt Ojha made some sort of a record at the residence of the Chief Justice of India when he was sworn in as a Judge of Supreme Court at 10.00 p.m.",
        "1990": "Bhagwan Shree Rajneesh \"Osho\", Indian free love guru, modern mystic and controversial cult figure, died in Pune at the age of 58 years. He will be remembered as a great orator and for founding of Rajnishpuram in USA.",
        "1992": "Manvendra Mukherji, famous singer and music director, passed away.",
        "1994": "CM decide to request Chief Election Commission to implement the photo identity card scheme in phases.",
        "1995": "Goa Cong (I) government led by Pratap Singh Rane gets absolute majority when 4-members of MGP merged with Congress.",
        "1996": "Upendranath 'Ashk', noted Hindi literary figure known for his disputed writings, passed away.",
        "1997": "Bengal wins Santosh Trophy National Football championship in Jabalpur.",
        "2000": "Railways retains the Lady Ratan Trophy Women's National Hockey championship."
    }
}