{
    "title": "Events for November 19",
    "events": {
        "1835": "Rani Lakshmibai of Jhansi was born in Varanasi, Uttar Pradesh. She was named Manikarnika and was called 'Manu'.",
        "1838": "Keshab Chandra Sen (1838-84), nationalist leader of Bengal, was born in Calcutta. He was one of the first Indians to sow the seeds of secularism in the country. He joined the Brahmo Samaj in 1857 but seperated from it in 1866 and founded Brahma Samaj of India, a radical offshoot of the Adi Brahmo Samaj.",
        "1877": "Jatindranath Benarjee, revolutionary of Indian freedom movement, was born.",
        "1910": "Gohar alias Gohar A. Kayoum Mamajiwala was born at Lahore. She was a film actress. Her first film was 'Fortune & Fools' (1925). Other films were 'Lanka Ni Laadi', 'Handsome', 'Briefless Barrister', 'Thief of Delhi', 'Punjab Mail', 'My Darling' and 'The Web'.",
        "1917": "Indira (Pridarshani) Gandhi, the first Indian Lady Prime Minister, was born at Allahabad. She was the only child of Jawharlal Nehru and  took active participation in freedom fight by forming \"Vanar Sena\" (a team of young detectives). She lead India in a successful war against Pakistan to seperate East and West Pakistans and establish the nation of Bangladesh.",
        "1924": "Amarjit Singh, great educationist and scientist, was born at Punjab.",
        "1961": "World Council of Churches convened their third assembly at New Delhi during which the International Missionary Council and its work was integrated into the larger ecumenical group.",
        "1962": "Nehru asks more US aid as China drives into India in New Delhi.",
        "1970": "Bhupinder Singh Jr, cricketer (Punjab & Indian ODI batsman), was born.",
        "1975": "Sushmita Sen, former Miss Universe and film actress, was born.",
        "1977": "Cyclone hits Andhra Pradesh causing flooding and tidal waves and killing 10,000.",
        "1978": "Gavaskar gets twin cricket tons for India for second time.",
        "1982": "9th Asian Games started in Delhi.",
        "1985": "Lall Singh, cricketer (one Test for India 1932), passed away.",
        "1991": "Kashinath Anant (Rambhau Joshi), famous editor, passed away.",
        "1992": "M. Veerappa Moily selected to become the new CM of Karnataka.",
        "1993": "Indira Gandhi Prize for Peace, Disarmament and Development awarded to Czech President Vaclav Havel.",
        "1994": "Aishwarya Rai, selected 'Miss World' at the age of 21 in the beauty contest held at the 44th convention at Sun City, South Africa .",
        "1996": "Krishnarao Shiva Shelvankar, journalist and diplomat, passed away at 90.",
        "1997": "22 persons killed and 30 injured when car bomb explodes outside film studio in Jubilee Hills area of Hyderabad. The deceased include Eanadu TV crew of six people.",
        "1998": "The Indira Gandhi memorial award is presented to Mirta Saavedra Polo, Ambassador of Panama, for her contributions to strengthening bilateral relations between India and Pakistan.",
        "1999": "New Governors for Bihar, West Bengal, Goa, Manipur and Punjab are named by the Rashtrapati Bhavan.",
        "2000": "The Government announces a partial rollback in the price of kerosene by Re. 1 a litre and LPG by Rs. 10 a cylinder in deference to the demands by allies led by the Trinamool Congress."
    }
}