{
    "title": "Events for December 19",
    "events": {
        "19\tDecember\t1857": "The trial on Raja Nahar Singh,  who was arrested and then was prisioned at Metcalfe House, began on Saturday at 1100 hrs at Delhi.",
        "19\tDecember\t1860": "Lord Dalhousie, Governor General of India (1848-1856), died.",
        "19\tDecember\t1917": "Ashoknath Banerjee, Governor of Karnataka, was born.",
        "19\tDecember\t1919": "Sunil Kumar Banerjee, cricket Test Umpire for 1 test from 1963-64, was born at Bengal.",
        "19\tDecember\t1927": "Uttar Pradesh was formed by an Automobile Association.",
        "19\tDecember\t1945": "Gandhiji lays foundation stone of C. F. Andrews' Memorial Hospital at Santiniketan.",
        "19\tDecember\t1952": "Nehru announces the Government's decision for establishing an Andhra State, constituting Telugu speaking areas of the State of Madras, excluding the city.",
        "19\tDecember\t1961": "Goa was liberated after Portuguese surrendered to the Indian troops.",
        "19\tDecember\t1966": "Rajesh Kumar Chauhan, cricketer (Indian off-spinner since 1993), was born in Ranchi.",
        "19\tDecember\t1969": "Nayan Ramlal Mongia, cricketer (Indian Test batsman-wicketkeeper 1994-  ), was born in Baroda.",
        "19\tDecember\t1978": "The Lok Sabha expels Indira Gandhi from the House and sentences her to imprisonment for a term lasting its prorogation. She was released from jail on December 26.",
        "19\tDecember\t1984": "2,500 killed in Bhopal gas tragedy.",
        "19\tDecember\t1988": "Umashankar Joshi, Gyanpeeth awardee and Gujrathi poet, died.",
        "19\tDecember\t1994": "K. A. P. Vishwanathan, famous Tamil author, passed away.",
        "19\tDecember\t1995": "Unidentified aircraft drops a heap of sophisticated arms and ammunition, including AK-47 rifles, rocket launchers and anti-tank grenades in Purulia district in West Bengal.",
        "19\tDecember\t1999": "The President and the Prime Minister express shock over the bid to assassinate the Sri Lankan President, Chandrika Kumaratunga.",
        "19\tDecember\t2000": "The Government suffers an embarrassing defeat with the Rajya Sabha adopting a motion recording its \"disagreement'' with the Prime Minister for defending three of his Cabinet colleagues charged in the Babri Masjid demolition case."
    }
}