{
    "title": "Events for October 19",
    "events": {
        "19\tOctober\t1689": "Sambhaji's queen Yesubai and her child surrendered the Raigarh Fort to the Mughals.",
        "19\tOctober\t1774": "Members of the Council and the Judge of Supreme Court of England came to improve the management in India.",
        "19\tOctober\t1875": "The first section from Hathras Road to Mathura Cantonment was opened to traffic.",
        "19\tOctober\t1888": "Namakkal Kavignar, Gandhian poet and painter, was born at Mohanur in Salem.",
        "19\tOctober\t1905": "Prince and Princess of Wales leave on an official visit to India at London.",
        "19\tOctober\t1907": "Sulochana Modi, first lady Mayor of Mumbai Mahanagar Palika, was born.",
        "19\tOctober\t1910": "Subrahamanyam Chandrasekhar was born in Lahore. He was one of the world's leading astrophysicists. For his contributions to the study of stars, Chandrasekhar had received the highest award in Science, the Noble Prize in Physics in 1983.",
        "19\tOctober\t1920": "Prakashchandra Sethi, former central minister, was born.",
        "19\tOctober\t1921": "Pandurangshastri Athvle, founder of 'Swadhyay Pariwar', was born.",
        "19\tOctober\t1925": "B. Shankaranand, former central minister, was born.",
        "19\tOctober\t1929": "Balbir Singh, India field hockey player (Olympic gold 1948-56), was born.",
        "19\tOctober\t1954": "Nehru and Mao meet in Peking.",
        "19\tOctober\t1967": "Dr. C. V. Raman elucidated his new theory on wave motion in respect to vision and dim light.",
        "19\tOctober\t1970": "First Indian-made MIG-21 handed over to the Air Force. Privy purses and privileges of former Indian rulers abolished.",
        "19\tOctober\t1974": "T. S. Rajamanikkam Pillai, famous Tamil stage artist, died.",
        "19\tOctober\t1979": "T. R. Baalu was born in Thalikottai, Distt. Thiruvarur (Tamil Nadu).",
        "19\tOctober\t1983": "Union Government takes over the management of 13 textile undertakings in Bombay; marathon strike in cotton textile industry ends.",
        "19\tOctober\t1990": "The Government of India under an ordinance puts forward a three-point formula for Ayodhya issue: (i) to acquire the land (ii) other land may be given for building temple except the disputed one (iii) the issue may referred to Supreme Court for speedy solution.",
        "19\tOctober\t1997": "BSP withdraws support to Kalyan Singh government in UP because of its 'anti-Dalit' policies.",
        "19\tOctober\t1999": "Sonia Gandhi will be the leader of the Opposition in Lok Sabha, says the Congress(I).",
        "19\tOctober\t2000": "The Government creates an electronic database of all the principal Central Acts from 1834 to 1996 of all India application."
    }
}