{
    "title": "Events for February 19",
    "events": {
        "1389": "Sultan Ghiyasu'd-din Tughluq Shah, emperor of Delhi, passed away.",
        "1588": "Pieter de Carpentier, flemish Governor General of Dutch East-Indies, was born.",
        "1670": "Chhatrapati Shivaji Maharaj, the great Maratha, was born.",
        "1812": "Congregational missionaries Adoniram Judson, 23, and his wife Ann, 22, first sailed from New England to Calcutta. (Judson eventually concentrated his labors in Burma).",
        "1818": "Bapu Gokhle, last General of Maratha kingdom, passed away.",
        "1855": "U. V. Swaminathan Iyyer, mahamahopadhyay Tamil author, was born.",
        "1861": "Rani Rashmoni, great nationalist, who compelled the British to abolish the tax imposed on fishing in the river, ingeniously blocking the trade and commerce on the part of Ganges, passed away.",
        "1891": "Amrita Bazaar Patrika became a daily newspaper.",
        "1895": "Munshi Newal Kishore, great social worker, educationist, nationalist, philanthropist and a pioneer industrialist, passed away at the age of 59.",
        "1902": "Pandit Lallu Ram appointed as Hindi Professor at Fort William College, Calcutta.",
        "1911": "Merle Oberon, film actress (Assignment Foreign Legion), was born in Calcutta, India.",
        "1915": "Gopal Krishna Gokhale, social reformer, political leader and freedom fighter, passed away.",
        "1919": "Arvind Gokhle, great Marathi story writer, was born.",
        "1922": "Beant Singh, former Chief Minister of Punjab and politician, was born. He played a vital role in supressing terrorist activities in Punjab.",
        "1949": "Mass arrests of communists in India.",
        "1956": "Acharya Narendra Dev, the veteran freedom fighter, revolutionary, thinker and Chairman of PSP, passed away.",
        "1974": "Bombay High Oil stock was found in the sea near Mumbai.",
        "1978": "Pankaj Mallik, famous Bengali music director and playback singer, passed away. He was the singer of the famous Hindi song \"Piya Milan Ko Jaana\".",
        "1986": "Computerised railway ticket reservation system was introduced in New Delhi Railway station.",
        "1992": "Shridhar Narayan Bendre, famous painter, passed away.",
        "1993": "Salseng C. Marak sworn in as the Congress-I CM in Meghalaya.",
        "1994": "IRBM Agni Missile test fired successfully for the third time.",
        "1995": "National Research Centre for Oil Palm(NRCOP), the only institute exclusively devoted to Oil Palm research in India, was established.",
        "1996": "Biennial elections to fill 39 Rajya Sabha seats in nine states.",
        "1997": "Massive blowout in ONGC oil field at Devarapally, A.P.",
        "2000": "18 people die following a fire on the Ferozepur-bound 2137-down Punjab Mail between Dushkeda and Savada stations near Bhusaval, about 433 km from Mumbai."
    }
}