{
    "title": "Events for March 19",
    "events": {
        "1848": "Lokhitwadi started his column 'Shatpatra' in the newspaper named 'Prabhakar'.",
        "1907": "Dr. Dilawar Hussain, right-handed batsman and wicket-keeper, was born.",
        "1911": "Santosh Kumar Ganguly, cricket test empire and 10 test 1955-65, was born in Bengal. He also played Hockey and Football. He is the aurthor of \"Manual of Cricket Umpires\" and \"Technique of Umpiring Hockey\".",
        "1935": "British fire on 20,000 Muslims, killing 23.",
        "1936": "Raghav Kaneria, great artist and decorator, was born.",
        "1939": "Abbas Ali Baig, cricketer (Indian bat 112 on debut v England 1959), was born in Hyderabad.",
        "1944": "Azad Hind Fauj hoisted the National Flag for the first time in North East India. On this event Bimal Roy produced the film  'Pehla Aadmi'.",
        "1954": "The first helicopter S-55 arrived at Bombay by sea.",
        "1962": "Raja Kelkar Museum, which belonged to Dinkar Gangadhar Kelkar, was opened for the people.",
        "1972": "India and Bangladesh singed mutual aid treaty for peace and friendship for 25 years.",
        "1973": "Mine explosion in Bihar kills 47.",
        "1982": "Acharya J. B. Kripalani, writer, nationalist, parliamentarian, founder of Kissan Mazdoor Dal and president of Indian National Congress in 1946, passed away at the age of 94.",
        "1990": "Madhu Dandavate,Union Finance Minister, submits Rs. 7,206 crore deficit budget with a mixed bag of new levies and concessions.",
        "1995": "Vinaychandra Maudgal, founder of Gandharva Mahavidyalay of Delhi and music expert, passed away.",
        "1996": "Election Commission announces dates of Lok Sabha elections (Apr. 27, May 2, 7 & 21) and Assembly elections in Kerala, Tamil Nadu, Haryana, West Bengal, Assam & Pondicherry.",
        "1997": "BJP and BSP agree for a coalition government in Uttar Pradesh.",
        "1998": "E.M.S. Namboodiripad, veteran communist leader of CPM and Kerala's first Chief Minister, passed away in Thiruvananthapuram at the age of 88.",
        "1999": "The banned Maoist Communist Centre kills 34 Bhumihars at Senari village in Jehanabad district in Bihar.",
        "2000": "Bill Clinton, US President,  arrives to a warm welcome in India. This was the first presidential visit of a US head in two decades."
    }
}