{
    "title": "Events for May 19",
    "events": {
        "1796": "Game protection law restricts encroachment on Indian hunting grounds.",
        "1904": "Jamshedji Nasarvanji Tata, famous industrialist and father of modern technology, passed away at Nauheim, Hesse-Nassau, France. He commenced cotton mills in Bombay and Nagpur and founded the Tata Iron and Steel Company, which  is one of the largest integrated steel mills in the world.",
        "1908": "Manik Bandopadhyay, modern Bengali novelist and story-writer, was born.",
        "1911": "K.N. Vaswani, educationist and Journalist, was born at Hyderabad, Sind.",
        "1913": "Neelam Sanjiva Reddy, President of India, was born.",
        "1951": "Sukhdev Bihari Mishra of Mishra Brothers, first historian of Hindi litterateur, passed away.",
        "1953": "State to control production and distribution of minerals involved in atomic energy development.",
        "1954": "The Govt. of India constituted a National Film Board.",
        "1956": "The Indian govt. bans six U.S. and two British films for presenting a 'disparaging' impression of life in Africa, including 'African Queen' and 'Mogambo' at New Delhi.",
        "1969": "Cyclone hit Andhra Pradesh claiming 608 lives and rendering 20,000 homeless.",
        "1971": "Indian Navy's first submarine station started at 'Veer Bahu' in Visakhapatanam.",
        "1975": "Farm truck packed with wedding party run over by a train, killing 66 in truck, at 40 miles south of Pune.",
        "1979": "Pandit Hajari Prasad Dwivedi passed away.",
        "1980": "T. N. Raina, former General of India, passed away.",
        "1982": "Elections for Assemblies held in West Bengal, Haryana, Himachal Pradesh and Kerala.",
        "1990": "S. R. Bommai unanimously elected President of JD.",
        "1991": "About 20 crore voters go to the polls in the first phase of election in 204 constituencies of the 10th Lok Sabha.",
        "1992": "Arjuna award for Tennis star Leander Paes and Hockey champion Jagbir Singh.",
        "1993": "S. W. Sohoni, 4 Tests for India, 83 runs @ 16.6, 2 wkts @ 101, passed away.",
        "2000": "A `civil coup' in Fiji ousts the first ethnic Indian Prime Minister Mahendra Pal Choudhary. President Ratu Sir Kamisese Mara proclaims a state of emergency."
    }
}