{
    "title": "Events for June 19",
    "events": {
        "1747": "Nadirshaha passed away.",
        "1871": "Madhavrao Sapre was born.",
        "1877": "Pandurang Chimanaji Patil, famous agriculturist of Maharashtra, was born.",
        "1901": "Raj Chandra Bose, Indian mathematician and statistician, was born at Hosangabad in Madhya Pradesh. He made many valuable contributions to the subject. He discovered new codes for telecommunication. In 1976, America's highest honour to a scientist came to Bose as he was elected Fellow of the US Academy of Sciences.",
        "1931": "Nandini Satpathy, politician, was born at Cuttack in Orissa.",
        "1947": "Salman Rushdie, English writer, was born in Bombay.",
        "1949": "People of Chandernagar, the French Indian Settlement, decided to merge with the Indian Union.",
        "1966": "Shiv Sena was established.",
        "1979": "Morarji Desai resigns after split in Janata Party.",
        "1981": "APPLE, India's first experimental geo-stationary telecommunication satellite having experimental communication satellite, successfully launched by European Ariane, Kourou, French Guiana. This is the first to be stabilized on 3 axes.",
        "1990": "13 Sri Lankan Tamils, including EPRLF Secretary General Padmanabha, were shot dead in Madras reportedly by LTTE men.",
        "1991": "Sudhakar Rao Naik (Cong-I) sworn in as the Maharashtra CM.",
        "1995": "India and US officially launch Indo-US Commercial Alliance during US Trade Secretary's visit.",
        "1996": "Kerala LDF govt. decides to reopen the ISRO espionage case, which was closed by the CBI.",
        "1997": "Indian Prime Minister and his Pakistani counterpart Nawaz Sharif, spoke for first time on restored hotline, to reiterate their committment to comprehensive dialogue, including Kashmir.",
        "1999": "The ''people's bus'' from Calcutta rolls into Dhaka and is formally received by the Prime Minister and his Bangladesh counterpart.",
        "2000": "Salgocar wins the Pondicherry Millennium All India Football tournament in Pondicherry."
    }
}