{
    "title": "Events for August 19",
    "events": {
        "1600": "Akbar captured Ahmednagar.",
        "1757": "The first rupee coin was minted in Calcutta by the East India Company.",
        "1887": "S. Satyamurti, freedom fighter and social worker, was born at Thirumeyyam in the former Pudukottah State.",
        "1903": "Gangadhar Devram Khanolkar, biographer and critic, was born.",
        "1907": "Acharya Hajariprasad Dwivedi was born.",
        "1910": "Sister Alphonsa, teacher and social worker, was born at Kudamaloor, Kerala.",
        "1916": "Dr. Shankar Dayal Sharma, former President of India, was born.",
        "1927": "Ananta Narsinha Naik, social reformer and politician, was born at Bandora, Goa.",
        "1934": "Dr. Hiralal died. He was a distinguished historian and contributed numerous articles to 'Indian Antiquary', 'Epigraphia Indica', The Journal of the Royal Asiatic Society, etc. He was also an honorary correspondent in Archaeology to the Government of India.",
        "1944": "The last Japanese troops driven out of India.",
        "1946": "Cabinet Mission's plan announced an interim government, which was formed by reconstituting the Viceroy's Executive Council. The Muslim League took umbrage and started direct action. Riots broke out as Muslims attacked Hindu's in Calcutta and the rest of Bengal. The Viceroy persuaded the Muslim League to join the government. But the League declined to join the Constituent Assembly unless the demand for a seperate state of \"Pakistan\" was conceded.",
        "1947": "Vinayak Damodar Karnataki (Master Vinayak), famous Marathi actor, director and producer, died.",
        "1976": "Nagarjun Sagar University established in Andhra Pradesh.",
        "1977": "Earthquake measuring 7.7-8.9 on the Richter Scale hits Indian Ocean. It is believed to be the strongest ever earthquake.",
        "1992": "K.R.Narayanan elected the ninth Vice President of India.",
        "1993": "Utpal Dutt, famous actor, writer, director and producer, died. He was 64.",
        "1994": "Rupee made fully convertible on current account.",
        "1996": "Gujarat's expelled BJP leader Shankersingh Waghela forms a new party called 'Rashtriya Janata Party'.",
        "1999": "India's role in ASEAN, ARF is lauded at a colloquium in Singapore."
    }
}