{
    "title": "Events for January 1",
    "events": {
        "1\tJanuary\t1399": "Amir Timur left Delhi. He took the title 'Emperor of India' and recrossed the Indus on March 11.",
        "1\tJanuary\t1664": "Shivaji marched towards Surat.",
        "1\tJanuary\t1851": "Publication of  Marathi newspaper 'Gyanoday'.",
        "1\tJanuary\t1862": "Indian Penal Code and code of Criminal Procedure passed on October 6, 1860 came into force.",
        "1\tJanuary\t1874": "The first women magazine \"Bola Bodhini\" was published.",
        "1\tJanuary\t1877": "Queen Victoria was proclaimed as 'The Empress of India' in Delhi Darbar.",
        "1\tJanuary\t1879": "Edward M Forster, English novelist (Howards End, Passage to India), was born.",
        "1\tJanuary\t1880": "Money order system was introduced.",
        "1\tJanuary\t1891": "Sampurnanand, Chief Minister of Uttar Pradesh, was born.",
        "1\tJanuary\t1892": "Mahadev Haribhai Desai, follower of  Gandhiji, was born in Surat district.",
        "1\tJanuary\t1894": "Satyendranath Bose, Professor and famous Indian physics expert, was born, He worked with Albert Einstein for some time.",
        "1\tJanuary\t1897": "Girja Dayal Girish, great poet and writer, was born at Saraiyan Mahipat Singh, U.P.",
        "1\tJanuary\t1903": "A vast crowd thronged the great plain outside Delhi today, waiting to hear the declaration that King Edward VII was Emperor of India. The crowd, clothed in brilliantly colored garments, was largely composed of common people who had come to the durbar to see India's princes pledge their fealty to the Emperor . The Duke of Connaught, representing King Edward, sat on the left of the Viceroy of India, Lord Curzon of Kedleston, who sat on a throne surrounded by giant silver footstools. Lord Curzon spoke briefly, then read a message from the King, who expressed regret at not being present at the durbar and his wishes for \"\"the increasing prosperity of my Indian Empire.\"\" Among the dignitaries in the amphi-theater were 600 veterans of the Sepoy Mutiny of 1857-58.",
        "1\tJanuary\t1909": "Dattaram Dharmaji Hindlekar, cricketer (Indian batsman & wicket-keeper 1936-46), was born in Bombay.",
        "1\tJanuary\t1910": "Rajnath Pandey, great writer and educationist, was born in Pindra, Varanasi (U.P.).",
        "1\tJanuary\t1914": "Dhirendra Nath Mukherji, social worker, was born at Bankura, West Bengal.",
        "1\tJanuary\t1918": "Sir Edwin Lutyens was knighted in recognition of his quality of work at Delhi and his gratuitious services to the War Graves Commission.",
        "1\tJanuary\t1920": "Seth Darbari Shah, great industrialist, was born in Ikhlas.",
        "1\tJanuary\t1924": "Krishna Mohan Jha, famous educationist, was born at Pokharia near Katihar (Purnea).",
        "1\tJanuary\t1926": "Mohammad Abdul Hye, educationist, was born at Alitangani, (Nowgong).",
        "1\tJanuary\t1931": "Gopi Chand Narang, great educationist and Urdu scholar, was born at Dukki.",
        "1\tJanuary\t1932": "Publication of  Marathi Newspaper 'Sakal' started.",
        "1\tJanuary\t1934": "Raju V. Vikram, cricket test umpire for 2 tests from 1984-87, was born at Karnataka.",
        "1\tJanuary\t1944": "Sir Edwin Lutyens, the Builder of Rashtrapati Bhavan and England's most outstanding architect of his time, died.",
        "1\tJanuary\t1948": "India raised voice against Pakistani infilatration in the country. A complaint was lodged in the Security Council of United Nation on Kashmir invasion.",
        "1\tJanuary\t1949": "A ceasefire eventually came into force. Under UN supervision, a negotiated Cease Fire Line was drawn up on an actual holding basis pending future settlements. This meandering, and at places militarily illogical line, ran some 700 kilometres from Chhamb in the South to a map reference point NJ 9842 in Ladakh in the North. The fighting was to continue for 15 months, with heavy RIAF involvement throughout, but despite being continuously on an operational footing throughout this period, the re-organisation and modernisation of the service continued unabated.",
        "1\tJanuary\t1950": "Inauguration of National Chemical Laboratory at Mumbai.",
        "1\tJanuary\t1955": "Shantiswaroop Bhatnagar, famous Indian Chemical Expert, died.",
        "1\tJanuary\t1956": "No. 20 Squadron, Indian Air Force's first jet squadron equipped with Vampires, was formed and christened 'The Lightnings'.",
        "1\tJanuary\t1965": "This year was announced to be observed as the \"Year of International Co-operation\".",
        "1\tJanuary\t1966": "Vimal Roy, film maker and producer, passed away.",
        "1\tJanuary\t1967": "Day's play in the Calcutta Test vs West Indies cancelled by riots.",
        "1\tJanuary\t1969": "B. Sivaraman was appointed as the Cabinet Secretary of India. He held this office till 30-11-1970.",
        "1\tJanuary\t1972": "Indian states abolished the previous rulers of Privy purses and privileges.",
        "1\tJanuary\t1973": "Indian General Insurance Corporation nationalised.",
        "1\tJanuary\t1974": "This year was announced to be observed as the \"World Population Year\".",
        "1\tJanuary\t1975": "Shankarrao Vasudev Kirloskar, famous iindustrialist, died.",
        "1\tJanuary\t1976": "Broadcasting of Commercial Advertisements on TV stations started.",
        "1\tJanuary\t1978": "Samrat (Emperor) Ashoka, Air India's first Jumbo-Jet Boeing 747, after explosion falls into Arabian Sea, killing 213 people. Nobody survived.",
        "1\tJanuary\t1979": "This year was announced to be observed as the \"International Year of the Child\".",
        "1\tJanuary\t1980": "This decade was announced to be observed as the \"International Decade of Water & Sanitation\".",
        "1\tJanuary\t1981": "This year was announced to be observed as the \"International Year for the Disabled\".",
        "1\tJanuary\t1983": "This year was announced to be observed as the \"International Communications Year\".",
        "1\tJanuary\t1985": "United Nations General Assembly proclaimed the year   as the \"International Youth Year\"(IYY) with the theme \"Participation, Development and Peace\".",
        "1\tJanuary\t1986": "This year was announced to be observed as the \"International Peace Year\".",
        "1\tJanuary\t1987": "United Nations General Assembly announced this year to be observed as the \"International Year of Shelter for the Homeless\". (5-10-87).",
        "1\tJanuary\t1988": "The Officers Training School (OTS) was re-christened as Officers Training Academy. Besides training Indian nationals, 74 cadets from Sri Lanka have also been trained at the OTA.",
        "1\tJanuary\t1989": "Dinkar Sakrikar, editor of monthly magzine 'Purva'  and socialist, passed away.",
        "1\tJanuary\t1991": "Bhanu Pratap Singh, Karnataka Governor, resigns. Goa governor Khurshid Alam Khan appointed in his place.",
        "1\tJanuary\t1992": "This year was announced to be observed as the \"International Space Year\".",
        "1\tJanuary\t1994": "Hindu Heritage Endowment, first Hindu international trust, was founded by Satguru Sivaya Subramuniyaswami.",
        "1\tJanuary\t1995": "This year was announced to be observed as the \"International Year of Tolerance\".",
        "1\tJanuary\t1997": "30-year Ganga water sharing treaty between India and Bangladesh takes effect.",
        "1\tJanuary\t1998": "The Election Commission announces the poll schedule for the 12th Lok Sabha. The polling will be on February 16, 22, 28 and March 7. Simultaneously, elections are to be held for the Meghalaya, Tripura, Nagaland, Gujarat and Himachal Pradesh Assemblies.",
        "1\tJanuary\t1999": "George Fernandes, Defence Minister, said the sacked Naval Chief, Admiral Vishnu Bhagwat, had been displaying \"disturbing tendencies\" for over a year and even threatened his successor, Admiral Sushil Kumar, with court martial."
    }
}