{
    "title": "Events for October 1",
    "events": {
        "1847": "Annie Besant, famous philosopher and thesophist, was born in London.",
        "1854": "The first stamps valid for postage throughout India were placed on sale in October 1854 with four values: 1/2 anna [Color: Blue],  1 anna [Color: Red], 2 annas [Color: Green], and 4 annas [Color: Res and Blue].These stamps were featuring a youthful profile of Queen Victoria, all four values were designed and printed in Calcutta, and issued without perforations or gum. All were lithographed except for the 2 annas green, which was produced by typography from copper clichés or from electrotyped plates. The 4 annas value was one of the world's first bicolored stamps, preceded only by the Basel Dove, a beautiful local issue.",
        "1867": "Dr. Hiralal, a distinguised historian, was born in Katni near Jabalpur. He compiled a descriptive catalogue of Sanskrit and Prakrit Manuscripts in the Central Provinces and was an honorary correspondent in Archaeology to the Government of India. He was also titled as \"Rai Bahadur\".",
        "1886": "Baluchisthan became a part of India.",
        "1887": "Pandit Hridaynath Ajudhianath Kunzru, politician and social worker, was born at Agra.",
        "1894": "Sudhi Ranjan Das, Chief Justice of Supreme Court of India, was born in Calcutta.",
        "1903": "Sachindev Burman (S. D. Burman), famous film music director, was born.",
        "1904": "Ayillyath Kuttiari Gopalan Nambiar \"A.K.Gopalan\" was born in Cannanore district, north Kerala. He was a freedom fighter and leader of communist movement in Kerala.",
        "1909": "Gandhiji wrote to Tolstoy regarding Passive Resistance movement.",
        "1919": "Gajanan Digambar Madgulkar, famous Marathi poet and screenplay writer, was born.",
        "1926": "Balkanji Bari Institute established for the welfare of children.",
        "1928": "Shivaji Ganeshan, famous actor, was born.",
        "1932": "Indian Milatary Academy became functional with Brigadier LP Collins, DSO, OBE as the Commandant. The first course of 40 GCs had on its rolls Sam Manekshaw, Smith Dun and Mohd Musa, later to be Chiefs of the armies of their respective countries, i.e. India, Burma (now Myanmar) and Pakistan. This training was for a period of two and a half years.",
        "1941": "No. 3 Squadron, similarly Audax-equipped, was raised at Peshawar.",
        "1949": "'Marathi Rangbhumi' , a drama company, established.",
        "1953": "The first new state in India since 1949, Andhra Pradesh, is established on purely linguistic basis and formally inaugurated. This state was created by sub-dividing state of India, Madras Province and this movement was started by Shriramulu for which he had to sacrifice his life.",
        "1958": "Metric System of weights was introduced in India.",
        "1959": "Hon'ble Judge Bhuvaneshwar Prasad Sinha became the Chief Justice of India. He helded this office till 31/01/1964.",
        "1967": "Indian Tourist Development Corporation Limited established.",
        "1978": "In the Child Marriage Act, minimum age for marriage was raised to 21 year for males and 18 years for females.",
        "1981": "Activists of the Dal Khalsa, who masterminded the hijacking of Indian Airlines plane. arrested.",
        "1990": "Supreme Court stays implementation of Mandal Commission recommendations.",
        "1991": "India takes over the presidency of Security Council with Ambassador G.R. Gharekhan in the chair.",
        "1992": "Broadcasting of Zee TV started.",
        "1993": "Two more Election Commissioners appointed.",
        "1995": "Hastimal Firodia, astrologer and industrialist, died.",
        "1997": "Parliamentarian and All-India Forward Bloc general secretary, Chitta Basu died  during his journey by Howrah-bound Danaput Express from Patna. He was 72.",
        "1998": "Anxiety in stock market after UTI's US-64 scheme is reported to have paid dividend, eating out of its capital.",
        "2000": "Ram Vilas Paswan, Communications Minister, launched the Bharat Sanchar Nigam Limited having total functional autonomy."
    }
}