{
    "title": "Events for November 1",
    "events": {
        "1\tNovember\t1858": "Her Majesty Queen Victoria was no longer amused with the Company's loss of control, and India came directly under the Crown of 'Princes, Chiefs and People of India'. Britain Government took over administrative powers from East India Company to rule India.",
        "1\tNovember\t1880": "Aga Khan III, Muslim spritual leader, died. He worked for Britian in the WW I & II. He was also responsible in forming the Muslim League.",
        "1\tNovember\t1902": "Alwar Iyengar Jaggu, famous Hindi writer and professor, was born at Chatra Ghosham.",
        "1\tNovember\t1913": "Ghadar Movement started at San Francisco.",
        "1\tNovember\t1927": "Ghani Khan Chaudha, political leader, was born.",
        "1\tNovember\t1930": "S. R. Bose, cricket test umpire for one test in 1983-84, was born in Bihar.",
        "1\tNovember\t1932": "Anadi Sankar Gupta, great educationist, was born at Goila, Bangladesh.",
        "1\tNovember\t1936": "Dr. Adarsh Sein Anand, justice, was born at Jammu (J & K State). He was the Chief Justice of India from 10/10/1998.",
        "1\tNovember\t1937": "Keral University established.",
        "1\tNovember\t1945": "Narendra Dabholkar, blind faith eradicator (Andhashradhha Nirmulak), was born.",
        "1\tNovember\t1948": "An Indian brigade group supported by the 7th Cavalry (Stuart tanks) broke through the Great Himalayan Range at Zojila to drive out the invaders from Ladakh district. At approximately 3,500 metres, this was the highest point in the history of warfare that tanks had operated.",
        "1\tNovember\t1949": "Thomason Collage at Roorkee, Uttar Pradesh, was raised to the status of an Engineering University - the first of its kind in India.",
        "1\tNovember\t1950": "First Indigenous Steam Engine from Chitranjan Rail Factory railed out.",
        "1\tNovember\t1954": "French handed over their territories of Pondicherry, Mahe, Karikal and Yanon  to the Government of India.",
        "1\tNovember\t1956": "Madhya Pradesh State High Court was established at Jabalpur having its benches in Gwalior and Indore.",
        "1\tNovember\t1961": "First passenger Plane flight AVRO HS748.",
        "1\tNovember\t1966": "Punjab High Court was renamed as Punjab & Haryana High Court. This court was established in Chandigarh for Punjab, Haryana & Chandigarh territory.",
        "1\tNovember\t1967": "Old Punjab, after first partition in 1947, was again seperated into two new states of Punjab and Haryana on linguistic basis, and Chandigarh became a Union Territory.",
        "1\tNovember\t1973": "Lakshdeep Minikai and Amin Divi were renamed as Lakshadweep, and Masker (Mysore) state renamed as Karnataka.",
        "1\tNovember\t1974": "Vangipurappu Venkata Sai Laxman, cricketer (Indian Test batsman v S Africa 1996 ), was born in Hyderabad.",
        "1\tNovember\t1978": "Himachal Pradesh Krishi Vishvavidyalaya (HPKV) was converted from College of Agriculture to University.",
        "1\tNovember\t1983": "Rajiv Gandhi, 48, who was chosen to succeed his assassinated mother, was sworn in as Prime Minister in New Delhi today. Across the Jamuna River, in a Sikh slum, evidence was found of the enormous political problems the new Prime Minister faced. The bodies of at least 95 Sikhs were discovered. The Indian army had also been ordered into nine other cities. Religious warfare between Sikhs and Hindus had claimed at least 1,000 lives since Indira Gandhi was assassinated. The security guards who killed her were both Sikhs. US Secretary of State George Shultz, who attended the funeral, assured the new Prime Minister of US interest in a \"strong and stable India\". US-Indian relations had been strained recently because of United States support for Pakistan. Shultz called for a \"renewed positive trend\" in relations.",
        "1\tNovember\t1985": "Helicopter Corporation of India, later renamed Pawan Hans Limited, started functioning.",
        "1\tNovember\t1990": "JD Government in Gujarat, headed by Chimanbhai Patel, defeats no-confidence motion with Congress (I) support.",
        "1\tNovember\t1991": "J.N. Dixit appointed the next Foreign Secretary.",
        "1\tNovember\t1992": "Indirabai Khadilkar, famous singer, died.",
        "1\tNovember\t1996": "K.L. Chugh and J.N. Sapru,  former chairmen of ITC, remanded to custody in connection with FERA violation case.",
        "1\tNovember\t1999": "SC refuses to interfere with the Delhi High Court order in TRAI case.",
        "1\tNovember\t2000": "Sukhdev Singh Dhindsa, Union Minister for Sports,  releases the CBI report on match-fixing in New Delhi."
    }
}