{
    "title": "Events for December 1",
    "events": {
        "1\tDecember\t1764": "Battle of Anvadi.",
        "1\tDecember\t1885": "Dattatreya Balkrishna Kalelkar, famous Gandhian Gujrathi llitterateur and educationist, was born at Satara in Maharashtra.",
        "1\tDecember\t1886": "Raja Mahendra Pratap, great revolutionary freedom fighter and social reformer, was born at Musran in U.P.",
        "1\tDecember\t1894": "Bhim Sen Sachar, freedom fighter, leader and Chief Minister of Punjab, was born.",
        "1\tDecember\t1900": "Chidambaranar Thiru Thamizaringar, great author, journalist and homeopath, was born at Sirukadambur, Tamil Nadu.",
        "1\tDecember\t1911": "Dayarnav Raghunath Kopardekar, founder of \"Indrayani Sahitya Prakashan Sanstha\", was born.",
        "1\tDecember\t1921": "Des Raj Kalia, great librarian, was born at  Fazilka, Punjab.",
        "1\tDecember\t1928": "The first talkie filmshow, named as 'British Talkies' , was released on December 1, 1928, at Globe Theatres, Calcutta.",
        "1\tDecember\t1931": "The Second Round Table conference that began in London ended. Congress was solely represented by Gandhi and Muslim League by Sir Allama Iqbal and Quaid-e-Azam, etc. Two committees were setup to carry out the work of the conference on Federal Structure and Minorities. Gandhi was the member of both committees. He claimed that being the sole representative of the Congress, he represented the whole of India. Quaid-e-Azam replied that Muslims are a separate nation. Sir Shafi demanded that the 14 points of Quaid-e-Azam be incorporated in future constitution.",
        "1\tDecember\t1932": "A round-table conference on India fails to reach an agreement at London.",
        "1\tDecember\t1942": "No. 8 Squadron was raised meanwhile, absorbing the remaining coastal defence flight personnel.",
        "1\tDecember\t1946": "Australia compiled 645 vs India at Gabba. Bradman made 187 runs.",
        "1\tDecember\t1947": "India all out for 58 vs Australia at Gabba.",
        "1\tDecember\t1955": "Nikita Khrushchev delivers speech condemning British colonialism.",
        "1\tDecember\t1960": "Air Marshal Aspy Merwan Engineer DFC became the Air Officer Commanding, India Command. He was in this office till 31/07/1964.",
        "1\tDecember\t1963": "Nagaland becomes the 16th state of Indian union.",
        "1\tDecember\t1964": "Jawaharlal Nehru Agriculture University established.",
        "1\tDecember\t1965": "Border Security Force was organised, which would be armed and trained to man the International Border with Pakistan.",
        "1\tDecember\t1966": "Nagaland becomes a state of the Indian Union.",
        "1\tDecember\t1970": "T. Swaminathan was appointed as the Cabinet Secretary of India. He held this office till 02-11-1972.",
        "1\tDecember\t1974": "Sucheta Kriplani, former Chief Minister of Uttar Pradesh, passed away.",
        "1\tDecember\t1982": "Pakistan beats India to win hockey gold in the Asian Games.",
        "1\tDecember\t1985": "Rajiv Gandhi concludes the first official visit to Japan by an Indian Prime Minister at Tokyo.",
        "1\tDecember\t1989": "National Front decides to form a government with outside support from the BJP and the Left Parties.",
        "1\tDecember\t1990": "Vijayalaxmi Pandit, first Indian Lady Ambassador and Politician, passed away at the age of 90 years.",
        "1\tDecember\t1991": "Stone laid for the Sanskrit University at Kaladi, the birthplace of Adi Sankara.",
        "1\tDecember\t1992": "17 ministers of the BJP government in Rajasthan quit for the 'Karseva' at Ayodhya.",
        "1\tDecember\t1993": "Tata Steel's Amit Bhaduria win's India's first gold medal in the  10th Asian Track and Field meet in Manila in discus throw.",
        "1\tDecember\t1994": "Assembly elections in Andhra Pradesh and Karnataka.",
        "1\tDecember\t1997": "At least 61 persons, including 22 women and 17 children, belonging to SC and extremely backward communities are gunned down by banned private army of feudal landlords, Ranbir Sena, at Bathe-Lakshmanpur village in Bihar's Jehanabad district.",
        "1\tDecember\t1998": "P. Subramaniam Poti (75), former Chief Justice of Kerala and Gujarat High Court, dies of a heart attack.",
        "1\tDecember\t1999": "Supreme Court quashes a pending inquiry initiated by the Election Commission against former Union Finance Minister Manmohan Singh.",
        "1\tDecember\t2000": "There would be a cap of 20 per cent equity for broadcasters planning to operate DTH television services, said  I&B minister Sushma Swaraj."
    }
}