{
    "title": "Events for February 1",
    "events": {
        "1290": "Muiz ud din Qaiqabad, was the tenth sultan of the Mamluk dynasty (Slave dynasty), was killed in his bed. He was proved to be an inefficient ruler.",
        "1785": "Warren Hastings left India on Feb 8 and attended the Council meeting  for the last time.",
        "1797": "Lord Cornwallis was sworn in as Governor General of India for a second time in England. However, he did not proceed to India till 1805.",
        "1827": "Gordon's Esplanade building was established in Calcutta's Bengal Club.",
        "1831": "The first Fine Arts Exhibition by Brush Club was held in a Public Library of Calcutta.",
        "1835": "East India company obtained Darjeeling from the King of Sikkim.",
        "1855": "East India Railways were held for formal inauguration; Howrah station was opened.",
        "1881": "Cambridge Missionaries founded St. Stephen's College in Delhi.",
        "1889": "Amrit Kaur, an eminent social worker, freedom fighter and political leader, was born a princess in the royal family of King Harman Singh of Kapoorthala. She assisted Gandhi for 18 years and was connected with World Health Organisation and Red Cross Society.",
        "1894": "Chitravshastri, Marathi dictionary creator, was born.",
        "1901": "Six language penel were started on the Rs. five dinomination. These notes were single sided and the back side could be used for accounting purposes. The six languages were Urdu, Bengali, Telugu, Kaithi, Kannada and Tamil. The paper used for printing was white hand made and moulded.",
        "1910": "Jahangir Mohammed Khan, cricketer (father of Majid, Indian player 1932-36), was born in Jallundar.",
        "1917": "Samar Roy, cricket Test Umpire for 6 tests from 1961-70, was born in Bengal.",
        "1922": "Gandhiji gives notice to the Viceroy Lord Reading during Bardoli movement to inform him that he was intensifying his action and non-cooperation was to be escalated to Civil Disobedience.",
        "1929": "Jyotirbhaskaracharya Jayant Salgaonkar was born.",
        "1930": "A bomb, believed to be planted by Indian nationalists, is found at the British Museum at London.",
        "1931": "Gandhi chiefs order campaign of civil disobedience to continue.",
        "1942": "Lt Col HT Hogan  raised the Regiment at Malir Cantonment.",
        "1944": "Arun Tikekar, editor and writer, was born.",
        "1948": "Marathi Sanshodhan Mandal' established.",
        "1956": "Judge Sudhi Ranjan Das became the Chief Justice of India. He helded this office till 30/09/1959.",
        "1964": "Unit Trust of India' established.",
        "1967": "Victor Paramjyoti, famous Indian music director, composer and critic, passed away.",
        "1968": "United Nation's Conference on Trade and Development opens in New Delhi.",
        "1969": "Pinaki Chatterji and George Albert Duke on a two-man rowing expedition to the Andamans set out from Calcutta.",
        "1971": "Ajaysingh Jadeja, cricketer (Indian opening batsman), was born in Jamnagar.",
        "1972": "International Airports Authority of India established.",
        "1976": "Air Marshal Hrushikesh Moolgavkar PVSM, MVC, became the Air Officer Commanding, India Command. He was in this office till 31/Aug/1978.",
        "1985": "Muhammad Azharuddin created a world record at Kanpur by hitting a century in each of his first three test.",
        "1986": "Pope John Paul II arrives in New Delhi for a 10-day visit.",
        "1988": "The first Congress of the Indian Dental Association begins.  (28-1-88).",
        "1990": "Governors named for 14 states.",
        "1992": "Mohan Choty, comedy film actor, passed away.",
        "1994": "PM Rao attends the World Economic Forum meeting at Davos, Switzerland.",
        "2000": "The Centre decides to place almost all items under the automatic approval route for foreign direct investment and NRI and OCB investments."
    }
}