{
    "title": "Events for March 1",
    "events": {
        "1510": "Francisco de Almeida, Viceroy of Protuguese India, passed away in a battle.",
        "1640": "Britishers were allowed to do commercial activities in Madras.",
        "1775": "Purandhar Treaty was singed between Nana Phadnavis and British Army.",
        "1818": "Singhgad won by the Britishers after the end of Peshwa kingdom.",
        "1901": "Vaidya Jogeshchandra Banerjee was born.",
        "1903": "Pareshchandra Bhattacharya, former Gonerner of Indian Reserve Bank, was born.",
        "1905": "Karmaveer Bhausaheb Hire was born.",
        "1908": "A.E.T. Barrow, educationist, was born.",
        "1909": "First Indian Iron Company 'Tata Iron and Steel' established.",
        "1910": "The Dalai Lama is welcomed in Darjeeling.",
        "1914": "Minto Gilbert Jhon Alieat, former viceroy of India, passed away.",
        "1916": "Habib Rahman, great Architect, was born at Calcutta.",
        "1917": "Kartar Singh Duggal, famous author, was born at Dhamyal, Pakistan.",
        "1919": "Mahatma Gandhi announced his desire to start 'Satyagraha' against proposed Rowlatt Act meant to curb civil and political liberties.",
        "1924": "Naresh Mehta was born.",
        "1930": "Coimbatarao Doraikannu Gopinath, cricketer (batted in 8 Tests for India in the 1950's), was born in Madras.",
        "1939": "Satish Kumar Sareen was born in Rawalpindi (now in Pakistan). He became the Air Chief Marshal.",
        "1950": "The population figure for India is announced as 347,340,000.",
        "1951": "NitishKumar RamLakhanSingh was born in Bakhtiarpur, Distt. Patna (Bihar).",
        "1955": "Pakistan vs India five Test Cricket series ends in a 0-0 draw.",
        "1960": "National Aeronautical Research Laboratory moves to Bangalore with offices at Palace Road and Jayamahal Road. It soon becomes National Aeronautical Laboratory. Dr Nilakantan invites Dr D M Rao to lead the 4 ft tunnel project.",
        "1961": "The first AN-12B arrived in India. This was added in the force because of the increasing frequency of clashes with Chinese forces on the Sino-lndian Himalayan border and the need that these revealed for yet further increase in airlift capability, together with a requirement for medium helicopters suitable for high-altitude operation, orders were placed in the Soviet Union for eight Antonov An- 12B and 24IL-yushin 11- 14 transport aircraft plus 10 Mi-4 helicopters.",
        "1962": "Gaya University renamed as Magadh University.",
        "1963": "25 Sqn, AF was formed with 04XAN-12 aircraft acquired from the erstwhile USSR. This was to supply lines to the Army in the Northern Sector encompassing J&K and Ladakh regions.",
        "1968": "Salil Ashok Ankola, cricketer (Indian pace bowler one Test 1989), was born in Solapur.",
        "1971": "General Election ( 5th) of India begins.",
        "1978": "Justice Y. Y. Chandrachud is sworn in as the Chief Justice of India.",
        "1979": "Jairamdas Doulatram, great national leader, freedom fighter and journalist, passed away at Delhi. He played a vital role to recognised Sindhi as one of the national laguages of India.",
        "1985": "Rajendra Sethia, the biggest personal bankrupt ever, arrested in New Delhi.",
        "1987": "A Pakistani official quoted as saying, \"Pakistan has nuclear bomb capabilities at New Delhi\".",
        "1989": "Vasantdada Banduji Patil, former Chief Minister of Maharashtra and Governor of Rajasthan, passed away.",
        "1990": "JD secures four-fifth majority in Orissa Assembly elections; Biju Patnaik becomes the new CM.",
        "1992": "Anant Gundopant Tendulkar, great journalist, passed away.",
        "1993": "Narayan Ganesh Goray passed away (1-5-98).",
        "1994": "Manmohan Desai, famous Hindi film maker, passed away. He was 57.",
        "1995": "Iftikar, famous character actor, died.",
        "1996": "Supreme Court frees CBI from the control of PM Rao and directs that CBI would take no instruction or permission from or report to any authority personally interested in or likely to be affected by the investigation into the hawala case.",
        "1997": "India under-19 team wins third `Test', claims three-test series 2-0 win in Matara.",
        "1998": "Bharat Ratna is awarded to Dr. A.J.P. Abdul Kalam, Scientific Adviser to the Defence Minister, and Smt. M. S. Subbulakshmi, Carnatic musician. The award is also conferred posthumously on film director Satyajit Ray, freedom fighter Aruna Asaf Ali and former Prime Minister Gulzari Lal Nanda.",
        "2000": "P.Harikrishna becomes India's youngest International Master in the Sangli International chess tournament."
    }
}