{
    "title": "Events for April 1",
    "events": {
        "1839": "Medical College Hospital in Calcutta having only 20 beds was opened for male patients .",
        "1855": "Ishwar Chandra Vidyasagar's first Bengali primer 'Varnaparichay' was published.",
        "1869": "Income Tax was imposed. On the same day New Indian Divorce Act came into operation.",
        "1878": "Calcutta Museum was opened for general public.",
        "1882": "Savings Bank Postal system was introduced.",
        "1889": "Dr. Keshavrao Baliram Hedgewar, politician and founder of Rashtriya Swayansewak Sangh (RSS),  was born.",
        "1902": "Laxmidas Purshottamdas Jai, cricketer, (one Test, India v England 1934, scored 19 & 0), was born in Bombay.",
        "1912": "The imperial capital of India was moved from Calcutta to Old New Delhi and the Province of Delhi was declared by a proclamation.",
        "1918": "Royal Air Force replaces Royal Flying Corps in Britain.",
        "1920": "S. Bhattacharya, cricket Test Umpire for 2 tests from 1963-70, was born in Delhi.",
        "1930": "Government announced 15 yrs and 18 yrs as minimum marriageable age for girls and  boys. This is presently remodified.",
        "1933": "Indian Air Force was established at Drigh Road in Karachi (now in Pakistan). Subroto Mukherjee and four other officers were inducted as pilots when the first Indian Air Force Squadron was formed. The first aircraft flight joined the Indian Air Force, at that time it possessed a strength of six RAF-trained officers and 19 Havai Sepoys (literally, air soldiers); its aircraft inventory comprised four Westland Wapiti II. A army co-operation biplaned at Drigh Road as the \"A\" Flight nucleus of the planned No.1 (Army Co-operation) Squadron.",
        "1935": "The Reserve Bank of India was established as a Central Bank and the job of issuing notes was entrusted to this bank. The  Commissioner's office  which issued currency was abolished and was substituted by the Governer of the RBI. The issue offices scattered around the country came to be called as the regional offices of the Reserve Bank.",
        "1936": "Orissa state was formed as a province of British India separating from Bihar.",
        "1941": "Ajit Laxman Wadekar, cricketer (stalwart Indian batsman & capt and Team Manager), was born in Bombay. He has received the Arjun Award (1967) and Padmashree (1972).",
        "1944": "Japanese troops conquer Jessami, East-India.",
        "1947": "Gandhiji addresses Asian Relations Conference in Delhi.",
        "1954": "Air Marshal Subroto Mukerjee became the first Indian to become the Air Officer Commanding, India Command. He was in this office till 08/Nov/1960.",
        "1956": "Companies Act of 1913 was revised and Indian Companies Act of 1956 came into force.",
        "1957": "Postage stamps and sale of  postal stationary was introduced  as per decimal coinage system and Rupee was established to Hundred Naya Paisa.",
        "1962": "Metric weights became compulsory as New Weights and Measurements Metric system was intoduced by Indian Government.",
        "1963": "D.P. Kohli held office as the founder director of Central Bureau of Investigation (C.B.I.) from 1st April, 1963 (to 31st May, 1968). Earlier, he was Inspector-General of Police of the Special Police Establishment.",
        "1969": "India's first Atomic Energy Reactor started at Tarapore.",
        "1973": "India starts a drive to save tigers from extinction.",
        "1976": "Television was separated from radio, and Doordarshan Corporation was established.",
        "1978": "India's sixth Five-Year Plan commenced.",
        "1979": "Central Institute of Fisheries Education came under the Administrative Control of Indian Council of Agricultural Research.",
        "1985": "Central Institute of Brackishwater Aquaculture was established during the 7th Plan period. The Institute started functioning independently since April 1987. The Headquarters of the Institute are located in Chennai with field and farm facilities at Muttukadu and three Research Centres at Kakdwip(West Bengal), Puri(Orissa) and Narakkal (Kerala).",
        "1986": "Delhi beat Haryana by innings and 141 runs to win the Ranji Trophy.",
        "1987": "Bureau of Indian Standards was changed to Indian Standards Institution.",
        "1989": "Shridhar Madhav Joshi (S. M. Joshi), great socialist leader, passed away.",
        "1990": "Gold Control Act was withdrawn.",
        "1992": "The 79,698 crore Eighth Plan launched.",
        "1993": "National Aeronautical Laboratory becomes National Aerospace Laboratories.",
        "1994": "Five ministers resign from the Wilfred D'souza Government in Goa.",
        "1995": "The Airports Authority of India (AAI) formed by the merger of IAAI and NAA. AAI manages five international airports, 87 domestic airports and 28 civil enclaves.",
        "1996": "Kerala introduces ban on  arrack.  5614 licenced arrack shops closed down.",
        "1997": "Govt. clarifies it is illegal to carry a child on a two-wheeler in addition to a pillion rider.",
        "1998": "Prabhat Kumar, a 1963 batch IAS officer, was appointed as the new Cabinet Secretary of India. He succeeded  T.S.R. Subramaniam and held the office till 31-10-2000.",
        "2000": "India wins four golds in the under-14 Youth chess championship in Teheran."
    }
}