{
    "title": "Events for May 1",
    "events": {
        "1867": "Sri Kasinadhuni Nageswara Rao Pantulu, great freedom fighter, journalist, nationalist, politician, pioneer in library movement and litterateur, was born at Elakurru village in Gudivada Taluk, District Krishna.",
        "1886": "May Day was first observed in Chicago, USA. Work, Social activities, Rest, for 8 Hours.",
        "1897": "Vivekananda Swami established Ramakrishna Mission.",
        "1902": "Tornodo hit Dhaka part of Bengal, claims 416 lives.",
        "1908": "Praful Chaki committed suicide after he threw a bomb on Judge Kingsford of Mujaffarpur, killing two inocent women.",
        "1909": "Madame Bhikaji Cama secretly left London and went to France where she was wrote and spoke about the cruelty of Britishers.",
        "1913": "Balraj Sahani, famous film actor, was born.",
        "1915": "Rameshwar Shukla 'Anchal', modern Hindi poet, novelist and essay writer, was born.",
        "1922": "Madhu Limaye, great politician, freedom fighter, writer and national leader, was born at Pune, Maharashtra.",
        "1923": "Under the leadership of Singaravelu Chettiar, the first May day was celebrated in India.",
        "1926": "Jim Corbett killed the notorious man-eating leopard of Rudraprayag at Gulabrai village, who had attacked and killed about 125 people.",
        "1927": "Dr. Namwar Singh was born.",
        "1940": "Marathi magzine `Digdarshan' was published.",
        "1946": "Joanna Lumley, actress (Abs Fab, OHM's Secret Service), was born in Kashmir, India.",
        "1947": "Congress Working Committee accepts Partition in principle.",
        "1948": "Baroda State merged into Bombay Province.",
        "1958": "Bell, 47 G3, the flight was upgraded to a helicopter unit with a Sqn Ldr as its Commanding Officer.",
        "1960": "Old Bombay province was divided between Maharashtra and Gujrat States.",
        "1964": "Ravishankar University was established at Raipur in Madhya Pradesh.",
        "1966": "Marathi becomes the official language of Maharashtra.",
        "1972": "All fuel coal mines were nationalised.",
        "1973": "All non-fuel Coal Mines fields were nationalised.",
        "1977": "Janata Party was established.",
        "1981": "Sindhudurga district was formed in Maharashtra State.",
        "1983": "V. N. Swamy, pace bowler without distinction in one Test for India, passed away.",
        "1987": "The Bofors Deal.",
        "1992": "C. Arjun, famous music director, passed away.",
        "1993": "Narayan Ganesh Goray, socialist stalwart, 86, passed away in Pune.",
        "1994": "Six leading Akali factions dissolved to form a new party, the Shiromani Akali Dal-Amritsar, which wanted a 'Sikh State'.",
        "1995": "60 killed as Madras-Kanyakumari Express collides with a goods train at Danishpet.",
        "1996": "Motilal Vohra, U.P. Governor,  resigns (hawala case).",
        "1997": "Anand wins all three categories in Amber chess tournament in Monte Carlo.",
        "1998": "India and Peru sign agreements on space technology and agriculture during the visit of Indian President K. R. Narayanan there.",
        "1999": "India retained the SAFF Coca-Cola football title in Margao, beating Bangladesh in the final.",
        "2000": "Bidyut Ganguly (64),  veteran CPI(M) leader and West Bengal Commerce and Industry Minister, died of severe burns in Calcutta."
    }
}