{
    "title": "Events for June 1",
    "events": {
        "1786": "Madras General Post Office started functioning.",
        "1790": "A treaty was signed between Marathas, Britishers and Nizam.",
        "1819": "William Carey, Ward and Marshman established the Serampore College in Bengal.",
        "1842": "Satyendranath Tagore, Bengali officer and litterateur, was born.",
        "1874": "East India Company was dissolved.",
        "1890": "Sri Seeripi Anjaneyulu, journalist, social reformer and educationist, was born at Dharmavaram, Anantapur.",
        "1904": "Four Language panel were used for Rangoon. This panel had languages namely Burmese, Urdu, Tamil and Chinese.",
        "1916": "Lokmanya Tilak roared ''Freedom is by birthright'' at Ahmednagar.",
        "1927": "Justice Savyasachi Mukherjee was born.",
        "1929": "V. Shantaram, S. Fattehlal (Sheikh Syed Fattehlal), Vishnupant Damle and Keshavrao B. Dhaiber, alongwith Sita Ram Kulkami, founded the 'Prabhat Film Company' at Kolhapur.",
        "1930": "Baba Adhav was born.",
        "1933": "Fortnightly 'Bal Sanmitra' was published.",
        "1938": "Continental Publication' started.",
        "1944": "Liladhar Jagudi, well known Hindi poet, passed away.",
        "1945": "Tata Fundamental Research Institute was established.",
        "1947": "Balbhimraj Gore, litterateur and Hindi critic, was born.",
        "1955": "India's Untouchability (Offence) Act comes into force.",
        "1959": "N.G. Ranga resigned from the Indian National Congress and took up the leadership of the newly formed Swatantra Party.",
        "1964": "Rashid Ghulam Muhammad Patel, cricketer (Indian pace bowler, better known for Lamba incident), was born in Sabarkantha.",
        "1970": "Monopolies and Restrictive Trade Practices Act was enforced. This act was passed in 1969.",
        "1972": "Space Commission and Department of Space was set up. Indian Space Research Organisation (ISRO) brought under Department of Space (DOS).",
        "1980": "AIADMK wins Tamil Nadu Assembly election; Congress (I) wins in U.P, M.P, Gujarat, Rajasthan, Punjab, Maharashtra and Orissa.",
        "1992": "S.K. Datta became the director of Central Bureau of Investigation (till 31/07/93).",
        "1993": "Speaker disqualifies four Ajit group MPs.",
        "1995": "Kanshi Ram (Bahujan Samaj Party) withdraws support to the Mulayam Singh Yadav-led government in UP and stakes claim to form a new government.",
        "1996": "Neelam Sanjiva Reddy, former President of India, passed away.",
        "1997": "Union Minister for Forests and Environment, Prof. Saifuddin Soz announces Rs. 9 crore central package for afforestation and eco-development in J&K.",
        "1998": "The Prasar Bharati Bill is introduced in the Lok Sabha to revive the Prasar Bharati Act, 1990."
    }
}