{
    "title": "Events for July 1",
    "events": {
        "1781": "British troops defeated Hyder Ali's progress. He was checked by Eyree Coote after the battle of Porto Novo and becamed subdued.",
        "1821": "Daily newspaper 'Mumbai Samachar' was published.",
        "1852": "For the first time in Asia, Postal Stamp for the general public was issued by Sindh Province in Karachi.",
        "1856": "In south, the first line was opened by the Madras Railway Company. It ran between Veyasarpandy and Walajah Road (Arcot), a distance of 63 miles.",
        "1862": "Calcutta High Court was established for West Bengal and Andaman & Nicobar Islands. This Court has a Circuit Bench at Port Blair.",
        "1879": "Post Card of one paisa was started in India by the Post and Telegraph Department.",
        "1882": "Dr. Bidhan Chandra Roy, great professor, politician, physician, leader and veteran nationalist, was born at Patna.",
        "1902": "K. S. Ranjit Singh \"Ranji\" scored 230 runs as the captain and Newham (153). They added 344 runs for 7th wkt at Sussex vs Essex.",
        "1906": "Pulavar Kulandai, great author and poet, was born at Bhavani.",
        "1909": "Madanlal Dhingra, revolutionary, assassinated Sir William Curzon Wyllie, a prominent Anglo-Indian, at the Imperial Institute in London.",
        "1913": "Kumarmanglam Parasshiv Prabhakar, former Chief of Indian Army, was born.",
        "1927": "Chandra Shekhar, former Prime Minister of India, was born. He was the eighth Prime Minister of India, between 10 November 1990 and 21 June 1991.",
        "1928": "Fifteen people were killed in Calcutta as Hindus attacked Muslims.",
        "1929": "Ramchandra Ganpatrao Shinde, educationist, was born at Burhanpur, (M.P.).",
        "1930": "Vinodkumar C. Gupta, leader in Maharashtra, was born.",
        "1938": "Hariprasad Chaursia, famous flute player, was born.",
        "1941": "C. Y. Chintamani died.",
        "1947": "Sharad NandKishore Yadav was born in Babai, Distt. Hoshangabad (Madhya Pradesh).",
        "1949": "M. Venkaiah Rangaiah Naidu was born in Chavatapalem, Distt. Nellore (Andhra Pradesh).",
        "1952": "Olympic Games open at Helsinki.",
        "1955": "Imperial Bank of India was inaugurated and was renamed as State Bank of India.",
        "1958": "Vishnu Sahay was appointed as the Cabinet Secretary of India. He held this office till 10-11-1960.",
        "1961": "Kalpana Chawla, the first Indian women astronaut (STS 87), was born in Karnal.",
        "1962": "Dr. Bidhan Chandra Roy, great leader, veteran nationalist, politician, professor, physician and architect, passed away.",
        "1964": "Industrial Development Bank of India (IDBI) was established.",
        "1965": "Meerut University was established.",
        "1968": "Asia's biggest nuclear research lab started in New Delhi.",
        "1975": "Indira Gandhi, then Prime Minister of India, declared a 20-point economic programme.",
        "1982": "MGR inaugurates Tamil Nadu's noon meal programme for poor children.",
        "1984": "Ravishankar Maharaj, freedom fighter and national leader of the country, died at the age of 101.",
        "1985": "Air Chief Marshal L M Katre, PVSM, AVSM and Bar, died in office.",
        "1989": "Yashvantrao Chavan Open University was established.",
        "1990": "General Sunith Francis Rodrigues takes over as Chief of the Army Staff.",
        "1991": "Rupee devalued by 8.5\\%.",
        "1992": "Truck operators begin nation-wide strike to press for the abolition of toll tax and octroi.",
        "1996": "RBI reduces cash reserve ratio to 12\\%.",
        "1997": "Voluntary Disclosure of Income Scheme `97 (VDIS) comes into effect.",
        "1999": "Two leaders of Hindu Makkal Katchi (HMK) are detained under National Security Act (NSA)."
    }
}