{
    "title": "Events for August 1",
    "events": {
        "1672": "The East India Company and the English law was for the first time intorduced in India. It was set up as directed by the Court of Judicature.",
        "1846": "Dwarkanath Tagore, a Hindu philanthropist, died in London.",
        "1879": "Achyut Balwant Kolhatkar, famous litterateur and journalist, was born.",
        "1882": "Purushottamdas Tandon, great leader and editor, was born at Allahabad (U.P.).",
        "1899": "Kamala Nehru, wife of Pandit Jawaharlal Nehru, great revolutionary freedom fighter and social worker, was born.",
        "1905": "Horse drawn tram cars were closed down in Bombay. This service was started on May 9, 1874 with 20 tram cars and 200 horses. The very first day of its run, the number of passengers carried was 451 and the amount earned was Rs. 85/- on the last day it had 1360 horses and carried 71,947 passengers and earned Rs.4,260/.",
        "1916": "Mrs. Annie Besant in cooperation with Bal Gangadhar Tilak started the Home Rule League Movement with Dadabhai Naoroji as its President.",
        "1920": "Gandhiji addresses letter to Viceroy surrendering \"Kaisar-E-Hind\" Medal, \"Zulu War\" Medal and \"Boer War\" Medal and launched the All India Non-Violent Non-Coperation Movement.",
        "1922": "Ratilal Sankalchand Nayak, educationist and writer, was born at Kadi, Gujarat .",
        "1927": "Dr. Rahi Masoom Raza, famous Hindi litterateur, was born.",
        "1931": "Bhairabh Ganguly, cricket test umpire for 5 tests from 1981-85, was born at Bengal.",
        "1932": "Meena Kumari, film actress, was born.",
        "1939": "Bombay begins Prohibition, first since U.S. law was repealed.",
        "1947": "Partition of India into India and Pakistan. Power transferred. Lord Mountbatten becomes Governor General of India and Muhammed Ali Jinnah, Governor General of Pakistan.",
        "1952": "Yajurvindra Singh Jaswant Singh, cricketer (Indian batsman four Tests 1977-79), was born in Rajkot.",
        "1953": "Bombay Government decides to abolish ''jagirs'' in merged areas.",
        "1955": "Arun Lal, cricketer (Indian batsman in sixteen Tests 1982-89), was born in Moradabad, U.P.",
        "1957": "National Book Trust inaugurated.",
        "1958": "Ramon Magsaysay Award for community leadership given to Acharya Bhave.",
        "1962": "Establishment of Maharashtra State Industrial Development Corporation.",
        "1963": "Soviets offer India arms to block China.",
        "1964": "Air Chief Marshal Arjan Singh, Padma Vibhushan, DFC. became the Air Officer Commanding, India Command. He was in this office till 15/07/1969.",
        "1966": "Himachal Pradesh Krishi Vishvavidyalaya (HPKV) was established at Palampur under the aegis of Punjab Agricultural University, Ludhiana, to cater to the need of hilly areas of erstwhile Punjab.",
        "1970": "Former Beatle George Harrison led an all-star entourage of rock talent through two sold-out shows at New York's Madison Square Garden tonight, in a benefit for Bangladesh refugees. More than 40,000 attended the concerts, and Harrison hoped to donate $250,000 to the cause. The shows opened with sets of Indian music by sitarist Ravi Shankar, then moved through songs featuring Harrison, Eric Clapton, Billy Preston, Leon Russell, and another ex-Beatle, Ringo Starr. But the evening's most ecstatic ovations were reserved for the unexpected appearance of Bob Dylan.",
        "1986": "Amnesty scheme for evaders of taxes announced.",
        "1988": "Air Chief Marshal Surinder Kumar Mehra PVSM, AVSM, VM, ADC., became the Air Officer Commanding, India Command. He was in this office till 31/July/1991.",
        "1989": "Kirti Vrajlal Ambani,Reliance executive, held in connection with a plot to kill Bombay Dyeing Chairman Nusli Wadia.",
        "1990": "Devi Lal, Dy. PM, dropped from Union Cabinet following wild charges he made against colleagues in an interview with the 'Illustrated Weekly'.",
        "1992": "S. Rajgopal was appointed as the Cabinet Secretary of India. He held this office till 31-07-1993.",
        "1993": "Jananayak Debeswar Sarmah, great freedom fighter, architect and nationalist, died at Jorhat, Assam.",
        "1994": "The Railway passenger insurance scheme comes into force.",
        "1995": "Vohra Panel submits report, highlights nexus between mafia and politicians.",
        "1996": "T. S. R. Subramaniam was appointed as the Cabinet Secretary of India. He held this office till 31-03-1998.",
        "1997": "Nitin Mongia wins Laser standard in sailing championship in Hyderabad.",
        "1998": "The DMK condemns the BJP-led coalition Government's decision to set up a Multi-Disciplinary Monitoring Agency and rejects the Action Taken Report on the final report of the Jain Commission with reference to Mr. M. Karunanidhi.",
        "2000": "27 'yatris' (travelers) die after militants attack a ''langar'' in a Pahalgam health resort en route to the Amarnath cave shrine."
    }
}