{
    "title": "Events for September 1",
    "events": {
        "1574": "Guru Amardasji passed away.",
        "1668": "Mumbai was handed over to East India Company by King of England.",
        "1798": "England signs treaty with Nizam of Hyderabad, India.",
        "1887": "Karmveer Bhaurao Paygaunda Patil, educationist, social reformer and founder of  'Rayat Educational Institute', was born.",
        "1893": "Kashinath Tryambak Telang, first Maharashtrian Chief Justice of Mumbai High Court, died.",
        "1896": "Bhaktivedanta Swami, litterateur and social worker, was born in Calcutta.",
        "1908": "Amir Elahi, right-hand batsman and right-arm leg-break bowler, born at Multan in Lahore.",
        "1909": "Father Kamil Bulke was born. He produced a handy English to Hindi dictionary. He did his Ph.D. on 'Ramcharita Manas' and was Head of Hindi Department in Patna University.",
        "1913": "Snehangshu Kanta Acharya, politician, social reformer, lawyer and athelete, was born.",
        "1915": "Rajindersingh Bedi, Urdu story writer and Hindi film story writer, was born.",
        "1921": "Madhav Krishnaji Mantri, right-hand batsman and wicket-keeper, was born at Nasik, Maharashtra. He was the Indian team selector from 1964 to 1968 and was also the team manager in 1990.",
        "1928": "Arun Kumar Seal, educationist, was born at Vishnupur.",
        "1930": "Suhasini Ganguly, freedom fighter, was arrested and send to Hijali Jail for her revolutionery activities. She later lived a low profiled life after release from prision.",
        "1934": "Suniti Kumar Ghosh, cricket test umpire for two tests from 1988-89, was born in Bengal.",
        "1942": "Rasbihari Bose established the Indian National Army.",
        "1947": "Mahatma Gandhi undertakes a fast for unity among Hindus and Muslims. He breaks the fast after 73 hours when peace is restored.",
        "1956": "Pakistani troops infiltrated the Line of Control in Kashmir.",
        "1962": "Shivaji University was established in Kolhapur.",
        "1965": "Pakistan launched Operation 'Grand Slam' in Chhamb sector aimed at Akhnoor in Jammu. Indians had battled Pakistanis in air and on ground at Kashmir.",
        "1976": "Indira Gandhi asks for sweeping new powers at New Delhi.",
        "1977": "M. L. Wadhawan was appointed as the Narcotics Commissioner of India. He headed this office till 02-09-1979.",
        "1978": "Air Chief Marshal Idris Hasan Latif, PVSM, became the Air Officer Commanding, India Command. He was in this office till 31/Aug/1981.",
        "1981": "Air Chief Marshal Dilbagh Singh PVSM, AVSM, VM., became the Air Officer Commanding, India Command. He was in this office till 03/Sept/1984.",
        "1988": "Fatte Singrao Gaekwad of Baroda, former Member of Parliament, passed away.",
        "1989": "Yasser Arafat chosen for the 1988 Jawaharlal Nehru Award for International Understanding.",
        "1995": "Chandrababu Naidu assumes office as the new CM of Andhra Pradesh.",
        "1998": "Tatas withdraw their Rs. 1,475-crore proposal to operate an airline with foreign equity participation in the domestic sector.",
        "1999": "The Congress(I) President, Ms. Sonia Gandhi, launches a broadside against the Vajpayee Government on handling of Kargil issue."
    }
}