{
    "title": "Events for November 20",
    "events": {
        "1572": "Akbar responded with alacrity and arrived at Ahmadabad and made adequate arrangements for its administration.",
        "1760": "Phattesingh Bhosle passed away.",
        "1859": "Elfinstone, Governor of Bombay Province and historian, passed away.",
        "1888": "Gurunath Bewoor, director general, was born at Bewoor village, district Bijapur.",
        "1902": "Gandhiji returned to South Africa at the request of the Indian community and revived the Indians against Anti-Asian Laws.",
        "1907": "Railroad workers strike in India.",
        "1917": "Ram Gopal, great Indies /English classical dancer (Blue Peter, Purple Plain), was born.",
        "1930": "With all the pageantry of the British Empire, a conference of Indian and British leaders had been convened in London to discuss dominion status for India. Surrounded by Maharajahs in turbans, King George V convened the round table conference in the Royal Gallery of the House of Lords. Notably absent was Mahatma Gandhi, leader of the nationalist movement. The conference saw a breakdown of the Indian caste system as Brahmins dealt with spokesmen for \"untouchables\".",
        "1942": "Attri Devi, freedom fighter, was arrested for further six months. She was earlier arrested for personal satyagraha and to hoist the national flag in Delhi Central Jail on January 26.",
        "1946": "Gandhiji starts tour without party.",
        "1947": "Parliament gives Indian government censorship powers over press at New Delhi.",
        "1955": "Polly Umrigar scores India's first Test double century, 223 vs NZ.",
        "1967": "First Indian made Sounding Rocket 'Rohini RH75' launched into space from Thumba Equatorial Rocket Launching Station.",
        "1969": "The Union Home Ministry decides to reserve posts for SC\\STs in the public sector undertakings.",
        "1981": "Bhaskara-II, India's second experimental remote sensing satellite, was launched  by Russian launch vehicle Intercosmos. This provided experience in building and operating a remote sensing satellite system on an end-to-end basis.",
        "1989": "Hirabai Barodekar, famous singer of \"Kirana Gharana\", passed away.",
        "1990": "Union Government asks Supreme Court to repeal the $470 million Bhopal Gas settlement order.",
        "1993": "RBI clears two more private banks: The Times Bank Ltd. and the Indus Ind Bank Ltd.",
        "1997": "Palestinian leader Yasser Arafat arrives in New Delhi. India and Palestinian national authority take stock of stalled West Asia peace process. Two sides sign first umbrella Memorandum of Understanding.",
        "1998": "V. K. Sharma, chairman and managing director of JVG Group of Companies, who allegedly swindled Rs. 600 crores from investors, is arrested in Mumbai.",
        "1999": "Melody queen Lata Mangeshkar, senior journalist `Cho' Ramaswamy, eminent jurist Fali S. Nariman and  veteran RSS leader Nanaji Deshmukh nominated to the Rajya Sabha."
    }
}