{
    "title": "Events for January 20",
    "events": {
        "1684": "Treaty between Marathas and Portuguese.",
        "1817": "Ram Mohun Roy started Hindu College in Calcutta with the help of Justice H. East David Hare. This college was later renamed as the Presidency College.",
        "1871": "Sir Ratanji Jamshedji Tata, famous Indian industrialist, was born.",
        "1879": "Raghunath Chaudhary, famous Assamia nature poet, was born.",
        "1897": "Gandhiji declines to prosecute assailants.",
        "1898": "Krishnarao Ganeshpant Fulanbrikar (Master Krishnarao), famous singer, actor and music director, was born.",
        "1931": "Saroj Kumari', a feature film produced by Mahavir Photoplays and Theatres Ltd., Secunderabad, was prohibited on January 20 on the grounds that it was ''sordid'' and ''revolting''.",
        "1939": "Nalin Chandra Wickramasinghe, great Indian astronomer, was born.",
        "1948": "1. Bomb exploded near Birla House during a prayer meeting of Gandhi. 2. Three member UN Commission for investigation/mediation on Kashmir.   3. K.M. Cariappa succeeded Lieutenant General D. Rissell as the Army Commander, Delhi and East Punjab and was responsible for conducting the operation in Kashmir.",
        "1949": "Junagarh formally merged with Saurashtra.",
        "1952": "Vasant Patankar, famous Marathi writer, was born.",
        "1957": "First Indian Atomic Reactor \"Apsara\" at Trombay, Mumbai, was dedicated to the nation.",
        "1959": "Tej Bahadur Sapru passed away.",
        "1972": "Manipur, Meghalaya and Tripura become states of Indian union. Arunachal Pradesh and Mizoram become Union Territories. Assam's North East Frontier Agency (Nepha) was renamed as Arunachal Pradesh territory.",
        "1988": "Khan Abdul Gafar Khan, follower of Mahatma Gandhi, better known as Sarhadi Gandhi or Frointier Gandhi, passed away.",
        "1990": "Dr. Raja Ramanna sworn in Minister of State for Defence.",
        "1992": "Australia beat India 2-0 to win the World Series Cup.",
        "1993": "Bindeshwari Dube, former Chief Minister Bihar, passed away.",
        "1994": "Chinese film 'Farewell, My Concubine' and Adoor Gopalakrishnan's 'Vidheyan' adjudged best Foreign and Indian films in the 25th International Film Festival at Calcutta.",
        "1995": "Supreme Court orders closure of 84 industries in and around Taj Mahal in UP due to pollution.",
        "1996": "The Indian Army  conducted  United Nation Peacekeeping Keeping Operations in New Delhi from 20 to 26 Jan 1996, wherein delegates from UN HQ and 17 foreign countries of the Asia-Pacific region participated. The Under Secretary General, Mr Kofi Annan, was the chief guest.",
        "1997": "The third Test between India and South Africa ends in a draw in Johannesburg.",
        "1999": "Renowned playwright Girish Karnad is selected for the 1998 Jnanpith Award.",
        "2000": "J&K accepts the report of the State Autonomy committee tabled in the Assembly last year."
    }
}