{
    "title": "Events for October 20",
    "events": {
        "1752": "The grateful Wazir induced the emperor to make Badan Singh the 'Raja' with the title of  Mahendra, and Suraj Mal the 'Mumar Bahadur' with the title of Rajendra.",
        "1774": "New Regulating Act was introduced which abolished the East India Company Government and a new Government was formed.",
        "1905": "Mohansing Mahir, famous modern Punjabi poet, was born.",
        "1919": "Chaitanyabala Divatia, great author, was born in Ahmedabad, Gujarat.",
        "1920": "Censor Board, after examining the film 'Ahilya Uddhar' on October 20, started mentioning the number of reels as well as the length in feet on the Censor Certificate.  The film had already been released earlier on August 23, 1919.",
        "1947": "First battle between India and Pakistan.",
        "1954": "Surendra Vithal Nayak \"Suru Nayak\", cricketer (two Tests for India v England 1982), was born in Bombay.",
        "1960": "Indian mountaineers reach the peak of Nanda Ghunti for the first time in the Kumaon Hills.",
        "1961": "B. S. Guha, famous human scientist, died.",
        "1962": "China mounted a massive attacked in N.E.E.F.A. and Ladakh borders. Chinese army pushed Indians back. The real test of IAF airlift capability came when open warfare erupted on the Sino-lndian border, while operating to the tricky helipads in the mountains, including the operation of C-119Gs from airstrips 17,000 ft (5180m) above sea level in the Karakoram Himalayas, and the air-lifting by An-12Bs of two troops of AMX-13 light tanks to Chushul in Ladakh, where the small airstrip was 15,000 ft (4570m) above sea level.",
        "1963": "Navjot Singh Bhagwantsingh Sidhu, cricketer (Indian opening batsman), was born in Patiala.",
        "1969": "Punjabrao Agriculture University established.",
        "1981": "21-month-old Left United Front Ministry led by E. K. Nayanar resigns in Kerala.",
        "1989": "Pakistan win Sharjah Trophy over West Indies and India.",
        "1990": "Kona Prabhakar Rao, former Governor of Maharashtra,  died.",
        "1991": "Pandit Kalyandas Mahaprasad, famous Kathak dancer, died.",
        "1992": "Nirad C. Chauduri, 94, the Indian writer living in Oxford, made honorary Commander of the British Empire.",
        "1997": "Veerappan, the forest brigand, releases the six hostages after 12 days.",
        "1998": "Security forces unearth 770 kg of RDX and plastic explosives in the Tangmay area of Baramulla district in Jammu and Kashmir.",
        "1999": "The Centre accepts the recommendations of the Backward Classes Commission on the inclusion of Jats and other backward classes (OBCs) in Rajasthan except Bharatpur and Dholpur districts."
    }
}