{
    "title": "Events for December 20",
    "events": {
        "20\tDecember\t1686": "After clashes with Mughal soldiers, Jaub Chaarnak left Hoogly and settled in Sutnati.",
        "20\tDecember\t1757": "Clauk became Governor of Bengal.",
        "20\tDecember\t1850": "Atma Dev, social reformer and religious leader, was born.",
        "20\tDecember\t1866": "Panchkadi Banerjee, famous journalist and editor, was born.",
        "20\tDecember\t1876": "Bankinchrandra Chattopadhyay wrote \"Vande Mataram\".",
        "20\tDecember\t1904": "Virendranarayan Chakravorthy, former Indian Ambassador in England and Governor of Haryana, was born.",
        "20\tDecember\t1920": "Justice Ali Sayyed Murtuza Fazal  was born.",
        "20\tDecember\t1929": "The Indian State Air Service, an extension of Imperial Airways' routes, opens its inaugural service from Karachi to Delhi.",
        "20\tDecember\t1931": "Leela Nag (Leela Roy), freedom fighter and editor of Jayshri, was arrested in Bengal for her association with \"Depali Sangh\" who supported Chatgang Ammunition Plot against the Bengal Government.",
        "20\tDecember\t1942": "Gangu Bai, freedom fighter from Kolhapur, died at Hinlang Jail because of police beating.",
        "20\tDecember\t1946": "Gandhiji completes his month-long sojourn at Srirampur.",
        "20\tDecember\t1948": "Ladha Ramji, brother of Amar Singh and played his only Test vs Eng in 1933-34, died at Rajkot.",
        "20\tDecember\t1956": "Saint Gadgebaba died.",
        "20\tDecember\t1957": "Satyajit Ray's 'Pather Panchali' is declared the best film at the San Francisco Film Festival.",
        "20\tDecember\t1959": "Jasu Patel takes 9-69 during India vs Australia tour at Kanpur.",
        "20\tDecember\t1967": "Indira Gandhi gets powers to outlaw groups that question sovereignty.",
        "20\tDecember\t1969": "Nihalsingh Gurumukh, former Chief Minister of Dehli and Governor of Rajasthan, died.",
        "20\tDecember\t1978": "Riots in many Indian cities in protest against Indira Gandhi's imprisonment.",
        "20\tDecember\t1987": "Sweden beats India in Gothenburg (5-0) in 76th Tennis Davis Cup .",
        "20\tDecember\t1988": "The Constitution (62nd Amendment) Bill for reducing the voting age from 21 to 18 years receives Parliamentary approval.",
        "20\tDecember\t1990": "Supreme Court stays Delhi High Court judge Justice Chawla's orders on the Bofors issue.",
        "20\tDecember\t1992": "BJP launches campaign to oust Rao government; Vajpayee goes on fast.",
        "20\tDecember\t1993": "Bangarappa expelled from Congress for 6 years.",
        "20\tDecember\t1994": "The last batch of troops of IAF left the capital city of Mogadishu. The First batch reinducted was of 10 IAF personnel. Cpl Nasir was left as a lying casualty due to injuries sustained in the RPG explosion by AN-124 contracted by UN.",
        "20\tDecember\t1998": "Dr. B. V. Raman (86), a reputed astrologer, dies in Bangalore following a cardiac arrest. He was the Editor of The Astrological Magazine.",
        "20\tDecember\t1999": "Mulayam Singh Yadav, Samajwadi Party Chief, opposes signing of CTBT.",
        "20\tDecember\t2000": "Atal Behari Vajpayee, Prime Minister, announces the Government's decision to extend J&K ceasefire till January 26, 2001."
    }
}