{
    "title": "Events for February 20",
    "events": {
        "1846": "Duleep Singh was recognised as the ruler. British  captured Lahore.",
        "1847": "Turf Club of Royal Calcutta was established.",
        "1863": "Pandit A. R. Rajrajvarma, famous Malyalam poet, grammer expert and Sanskrit expert, was born.",
        "1868": "Sisir Kumar, Basanta Kumar and Hemanta Kumar, three brothers, first published the 'Amrita Bazar Partika',  a weekly issue in Bengali.",
        "1928": "Abaji Narayan Pednekar, children's story writer, was born.",
        "1929": "K. B. Ramaswamy, cricket test umpire for 8 tests from 1976-84, was born at Tamil Nadu.",
        "1947": "British Prime Minister Clement Attlee announced in the House of Commons, London,  that Britain will release India before June 1948 and for this purpose Lord Louis Mountbatten was appointed to work as the new Viceroy of India.",
        "1950": "Sarat Chandra Bose, freedom fighter, journalist, leader and elder brother of Subhashchandra Bose, passed away.",
        "1953": "India opens $ 140 mil. power system modeled after TVA.",
        "1968": "First Edition of 'Amrit Bazar Patrika' weekly was published in Bengali language.",
        "1976": "Production of Crude Oil started from offshore Bombay High near Mumbai.",
        "1982": "The Kangla Tongbi war memorial built for 221 members of Advance Base Depot, who laid down their lives to repulse several waves of Japanese attacks, was finally shifted to College of Materials Management Jabalpur. The original memorial was erected on 15 Apr 1946 from local stone and the main epitaph displayed above is of black Naga stone.",
        "1985": "Bhawani Prasad Mishra, progressive Hindi poet, passed away. His most famous poem is \"Main Geet Bechtaa Hun\".",
        "1987": "Lok Dal splits over leadership issue.",
        "1992": "Pandit Gauri Shankar, famous dance director in Hindi films, passed away.",
        "1993": "Government decides to form an Autonomous Council for the tribals within Assam to solve Bodo issue.",
        "1994": "Government makes the first appointment under 27\\% reservation for Other Backward Classes in Central Services and Public Sector Undertaking.",
        "1997": "RBI relaxes capital adequacy norms for commercial banks.",
        "1999": "Mr. Vajpayee travels to Lahore on the inaugural run of the bus between New Delhi and Lahore.",
        "2000": "Supreme Court stays the Karnataka High Court's order quashing charges framed against the former Chief Minister, Mr. S. Bangarappa, and directs the trial court to proceed in the corruption case."
    }
}