{
    "title": "Events for March 20",
    "events": {
        "1351": "Muhammad Tughluq Shah II passed away at Sindh.",
        "1602": "United East India Company of the Netherlands i.e. Dutch East India Company was chartered by States-General of Holland. During its 96-year history, it became one of the world's most powerful companies.",
        "1782": "Colonel James Tod, author and researcher of Rajput history, was born.",
        "1904": "Charles Freer Andrews came to India as a Christian Missionary and joined the staff of St. Stephen's College in Delhi.",
        "1920": "Usha Mehta, freedom fighter, was born at Satara. Her name is closely attached with freedom movement via Bombay Radio, as she and Babubhai Prasad and Vitthalbhai Zaveri founded this Radio and started motivating people of India with their telecasts.",
        "1921": "Dr. P. C. Alexander, Governor of Maharashtra, was born.",
        "1925": "Marquess Curzon of Kedleston died this morning at age 66 from complications following an operation. Long a kingpin of the Conservative party, Lord Curzon spent 40 years in public life, serving as Viceroy and Governor General of India and, at the end of his career, as Secretary of State for Foreign Affairs. Though he came close to becoming prime minister in 1923, his aristocratic past militated against him in an era which nominated leaders from the House of Commons. He twice wed US women and enjoyed fame as an author of books about politics and his own travels.",
        "1926": "For the first time in the history of the competition, Scotland beats England for rugby's Calcutta Cup in London.",
        "1937": "England beat Scotland at Murrayfield for the first time for Soccer's Calcutta Cup, International Championship and Triple Crown, UK.",
        "1951": "Madanlal Udhouram Sharma, cricketer (Indian medium pacer in the 70's), was born in Amritsar.",
        "1952": "Anand Armitraj, great Indian tennis player (Brother of Vijay), was born.",
        "1959": "For the first time, officials of the Indian government confirmed reports of widespread resistance to the Chinese occupying forces in Tibet. Open warfare erupted in the capital city of Lhasa.",
        "1965": "Venkataraghavan takes 8-72 vs New Zealand at Delhi.",
        "1970": "Establishment of Muslim Satyashodhak Samaj.",
        "1977": "General Election (6th) of India ends. First time Indian National Congress Party lost in India.",
        "1991": "Simultaneous polls in Tamil Nadu.",
        "1992": "Satyajit Ray, veteran film producer and director, was presented the 'Bharat Ratna' Award at Calcutta.",
        "1993": "Memon brothers, the prime suspects in the Bombay bomb blasts, escape from Dubai.",
        "1994": "Pakistan closes down its consulate in Bombay.",
        "1997": "Maharashtra (like H.P.) proposes to make carrying for aged parents mandatory.",
        "1998": "Rajesh Kumar Singh, CPI(ML) leader,  is shot at Pandeypur village in Patna.",
        "2000": "Unidentified militants gun down 35 Sikhs in the south Kashmir village of Chatti Singhpora in one of the worst incidents of violence in the State."
    }
}