{
    "title": "Events for May 20",
    "events": {
        "1378": "Daud Shah assasinated Mujahid Shah to become the fourth Bahmani Sultan, but himself was murdered by a slave.",
        "1399": "Saint Kabir was born.",
        "1498": "Admiral Dom Vasco-da-Gama (c.1469-1524)-I, Count of Vidigueira, met the Jamerin of Calicut after arriving in India three days ago at Malabar Coast. He was joined by an experienced Gujarati pilot at Malindi. He was the 6th Governor and 2nd Viceroy of India.",
        "1677": "Chhatrapati Shivaji Maharaj won the fort of Jingi.",
        "1750": "Tipu Sultan, tiger of Mysore, was born. He was the son of Hyder Ali and born at Devanhalli village near Bangalore. Hyder Ali named his son after a great Sufi saint namely Tipu Mastan Aulia. Tipu Sultan was a great revolutionary freedom fighter, social reformer, musician and architect.",
        "1776": "Malharrao Holkar, founder of Indoor, passed away.",
        "1850": "Vishnushastri Chiplunkar, father of modern story writing in Marathi, was born.",
        "1878": "Krishnashastri Chiplunkar, Marathi novelist and omnicent, passed away.",
        "1900": "Sumitranandan Pant was born.",
        "1915": "Gandhiji founded Satyagraha Ashram (later known as Sabarmati Ashram after the name of the river) at Ahmedabad.",
        "1932": "Bipinchandra Ramchandra Pal, powerful journalist and revolutionary freedom fighter, passed away. He was amongst the trio which was known as \"Lal - Bal - Pal\" during the freedom struggle. He started a newspaper called \"Swaraj\" for the Indians in England. He also edited several other newspapers like \"Tribune\", \"New India\", \"Vande Mataram\", \"Swaraj\", \"Hindu Review\", \"Democrat\", \"Independent Bengali\", etc.",
        "1940": "Amar Singh, cricketer (of pneumonia Indian pace bowler 1932-36), passed away.",
        "1957": "Tanguturi Prakasam, great lawyer, journalist, nationalist, politician, social reformer, leader and former Chief Minister of Andhra Pradesh, passed away at Hyderabad.",
        "1964": "P. T. Usha, famous sprinter, was born.",
        "1965": "Under the leadership of Commander M. S. Kohli, Indian Trackers concurred Mount Everest. Captain A. S. Chima and Sherpa Nawang Gombu were the first to reach the summit.",
        "1972": "Indira Gandhi laid the foundation stone of 2nd Howrah bridge at Calcutta.",
        "1976": "Oil production started from Bombay High.",
        "1987": "G. G. Jadhav `Pudhari', editor of daily newspaper, passed away.",
        "1991": "General Election (10th) of India begins.",
        "1992": "Third developmental launch of ASLV. Stretched Rohini Satellite Series (SROSS-C). Launched by third developmental flight of ASLV-D3. This carried Gamma Ray astronomy and aeronomy payload.",
        "1994": "Indian ship rescues over 2000 Indian nationals trapped in the embattled Yemen's port city of Aden.",
        "1996": "Janaki Ramachandran, chief minister of Tamil Nadu (1988), passed away.",
        "1999": "The CWC expels  Sharad Pawar,  M. P. A. Sangma and  Tariq Anwar for six years from the primary membership of the party."
    }
}