{
    "title": "Events for June 20",
    "events": {
        "712": "Muhammad of Bin Quasim (Kasim), Arabs, attacked on Sindh and captured it. Muhammad defeated and killed King Dahir, Hindu king, at Rawar.",
        "1574": "Akbar himself  left Agra.",
        "1756": "A group of British soldiers along with Halvel were imprisoned by some rebellions in a suffocating cell that gained notoriety as the \"Black Hole of Calcutta.\" Most of them died here.",
        "1858": "Gwalior fort was captured by British troops and the first Indian Sepoy Mutiny officially came to an end.",
        "1869": "Laxmanrao Kirloskar, great industrialist, social reformer, patriot and founder of Kirloskar Industry, was born at Belgaum.",
        "1873": "Young Men Christian Association of India was established in Calcutta.",
        "1897": "Ratnakant Barkakti, famous Assamia poet, was born.",
        "1911": "Dattatray Purushottam Karmarkar, veteran freedom fighter and former cabinet minister, died.",
        "1916": "Sreemati Nathibai Damodher Thackersey (SNDT) Indian Women' s University, first women's and the fifth Indian University, was established in Pune by D.K. Karve.",
        "1918": "K.K. Singh, politician and social worker, was born at Agra.",
        "1921": "Tilak University was established.",
        "1939": "Ramakant Bhikaji Desai, cricketer (effective pace bowler for India in the 60s), was born in Bombay.",
        "1946": "Kashmir authorities arrest President-elect Nehru for refusing to obey an order banning him from the state.",
        "1948": "Lord Mountbatten resigns as the Governor General of Indian Union.",
        "1957": "Govindrao Burhanpurkar, famous harmonium player, died.",
        "1972": "Paras Laxmikant Mhambrey, great Indian cricket pace bowler (Test v England 1996), was born in Bombay.",
        "1979": "Renedy Singh, Indian Soccer(Football) player, was born in Manipur.",
        "1985": "The Medal of Freedom, America's highest civilian decoration, was presented to Mother Teresa by President Ronald Reagan.",
        "1987": "Dr. Salim Ali, internationally renowned expert of birds, died at Bombay.",
        "1992": "The JD and the NF choose former Lok Sabha Dy Speaker Prof. G. G. Swell as the Presidential candidate.",
        "1993": "Harshad Mehta's senior counsel Ram Jethmalani asks JPC to summon the PM and allow cross-examination.",
        "1994": "Anti-Pakistan slogans rent the air in Jammu & Kashmir against the killing of Quazi Nissar Ahmed, Mirwaiz of South Kashmir and a famous religious Kashmiri leader who was gunned down by Pak-aided terrorists.",
        "1995": "Mayavati Government wins vote of confidence.",
        "1996": "Govt. of India declares at Geneva conference on 'Global Ban On Nuclear Testing' that it won't sign the CTBT.",
        "1997": "Second round of Foreign Secretary-level talks between India and Pakistan starts in Islamabad."
    }
}