{
    "title": "Events for August 20",
    "events": {
        "1597": "The first ship of the Dutch East India Company returned from Far East.",
        "1828": "Brahmo Samaj, the first movement to initiate religio-social reforms, was founded by Ram Mohun Roy (1772-1833) in Calcutta. Influenced by Islam and Christianity, Roy denounced polytheism, idol worship, repudiated the Vedas, avataras, karma and reincarnation, caste and more. The first session of Adi Brahmo Samaj was held in the rented house by Kamal Bose of Chitpore Road in Jorasanko area in Calcutta.",
        "1885": "First meeting of the Indian National Congress held.",
        "1905": "Lord George Curzon reigned as the Viceroy of India. He was then replaced by Lord Minto II, the Earl of Minto.",
        "1909": "Urmila Devi Shastri, freedom fighter, was born at Srinagar.",
        "1915": "Devraj Ars, former chief minister of Karnataka, was born.",
        "1917": "Raja Kulkarni, freedom fighter and politician, was born at Mhaswa village in Maharashra.",
        "1921": "The Mopla revolt, one of the important uprisings of India, was started at Kerala.",
        "1933": "Mahatma Gandhi is rushed to the hospital on the fourth day of his latest fast.",
        "1944": "Rajiv Gandhi, former Prime Minister of India and Bharat Ratna awardee, was born in Bombay.",
        "1955": "Jawaharlal Nehru breaks off relations with the Portuguese after the invasion of Goa by Indian nationalists.",
        "1969": "Varahagiri Venkata Giri was elected President and G. S. Pathak as Vice President of India.",
        "1974": "Fakhruddin Ali Ahmed elected President of India with B. D. Jatti as Vice President.",
        "1979": "Indian premier Charan Singh resigns.",
        "1985": "Sant Harchand Singh Longowal, a ragi, reluctant politician and Sikh leader, died. He was shot by Sikh extremists at Sherpur.",
        "1986": "A restructured 20-point programme announced.",
        "1988": "Earthquake measuring 6.5 on Richter Scale strikes India and Nepal. Thousands killed.",
        "1991": "Sivarasan and Subha, the main suspects in Rajiv Gandhi case, commit suicide in Bangalore.",
        "1993": "Mother Teresa hospitalized for malaria.",
        "1995": "Indira Mahila Vikas Yojana launched.",
        "1996": "India defeat Pakistan in Under-15 World Challenge Final at Lord's, England.",
        "1997": "Premananda, self-styled godman, sentenced by Pudukottai district and sessions court to  life imprisonment for two terms and a fine of Rs. 66.4 lakhs for rape of 13 inmates of his ashram and murder of a male inmate.",
        "1998": "The Punjab and Haryana High Court upholds the conviction of former Punjab DGP K.P.S. Gill for outraging the modesty of an IAS officer Mrs. Rupan Deol Bajaj."
    }
}