{
    "title": "Events for September 20",
    "events": {
        "1388": "Firuz Shah Tughluq, the third emperor of Delhi, died at the age of 83.",
        "1398": "Amir Timur of Timur Lang invaded India with 92 squadrons of horses and 90,000 cavalry  and reached the banks of Sindhu river near Atak city (now in Pakistan). He then attacked Delhi because its Muslim Sultanate was too tolerant of Hindu idolatry. A Mongolian follower of Sufism, he was one of the most ruthless of all conquerors. Timur crossed the Indus River at Attock (now in Pakistan) on 24 September 1398.",
        "1819": "Jose Custodio Faria (Joseph Stadio Faria), revolutionary scientist of Goa died.",
        "1856": "Narayan Guru was born in Chempazhanthi village of Kerala. Sri Narayan Guru was a social reformer, led reform movement in Kerala, rejected casteism, and promoted new values of spiritual freedom and social equality. He also stressed the need for the spiritual and social uplift of the downtrodden by their own efforts through the establishment of temples and educational institutions. In the process, he denounced the superstitions that clouded the fundamental Hindu cultural convention of caste.",
        "1857": "British troops conquered Delhi from the Mutineers.",
        "1878": "\"Hindu\", an English weekly in Madras with G. S. Aiyer as its Editor, was first published with only 80 copies.",
        "1881": "Pandit Kashinath Babaji (Chandrakant Bhringa), famous Marathi writer, was born at Munjawad in Nasik.",
        "1886": "Kuladhor Chaliha, one of the pioneer Congress leaders of Assam, was born at Sibsagar.",
        "1911": "Sri Ram Sharma Acharya, freedom fighter, social reformer and leader, was born at Auvalkhera, Agra.",
        "1921": "Pamanmal Hazari Punjabi, right-hand batsman (164 runs in five tests vs Pakistan in 1954-55), was born at Karachi.",
        "1928": "Narayan Guru \"Nanu\" of Kerala entered in maha Samadhi. His teachings are held in great reverence even today.",
        "1932": "Gandhiji commences \"fast unto death\" (hunger strike) in Poona prison to secure abolition of separate electorates for Harijans and untouchables.",
        "1933": "Annie Besant, veteran freedom fighter for India, died.",
        "1940": "Saroj Lalwani, journalist and printing press director, was born.",
        "1942": "Kanak Lata Barua, a yound child who tried to host the national flag at Goupur police station in Assam with the help of 500 people, was shot by the police station incharge.",
        "1944": "Rameshchandra Saxena, a one Test batsman (India vs England 1967), was born in Delhi.",
        "1989": "IPKF suspends its operations against LTTE in Sri Lanka.  LTTE, in turn, ceases all operations against the Indian armed forces.",
        "1992": "Vithhal Badgelwar, painter and sculptor, passed away.",
        "1993": "Narsimha Rao, Prime Minister, arrives in Teheran on a three-day visit.",
        "1996": "Arunachal Chief Minister Apang resigns and forms new party Arunachal Congress.",
        "1997": "President K. R. Narayanan inaugurates the first Dr. Ambedkar Law University in Chennai, Tamil Nadu.",
        "1998": "A. B. Bardhan is re-elected CPI general secretary.",
        "1999": "T. R. Rajakumari (78), the dream girl of the Tamil silver screen for over two decades, died."
    }
}