{
    "title": "Events for November 21",
    "events": {
        "21\tNovember\t1517": "Ibrahim Lodi (1517-26) succeeded the throne of Delhi, after the death of his father Sikandar Lodi.",
        "21\tNovember\t1899": "Harekrushna Mahtab, freedom fighter, politician, industrialist and writer, was born at Agarpara district Balasore, Orissa.",
        "21\tNovember\t1914": "Ujwala Mazumdar, freedom fighter and member of Bengal Valunteers, was born at Dhaka.",
        "21\tNovember\t1921": "Prince of Wales visited India and Congress observed all India strike.",
        "21\tNovember\t1947": "First postal stamp of indepedent India of three and half annas denomination was started.  Major General Cariappa took over from Lieutenant General Sir Francies Tulker as the Army Commander, Eastern Command, in the rank of Lieutenant General.",
        "21\tNovember\t1961": "Communist China announced a cease-fire in its border war with India and said it would withdraw its troops 12 miles behind the boundary lines that existed in 1959. China said it was making the move to end the hostilities and to implement proposals it had made in October to settle the border dispute. Before the ceasefire, Chinese troops had seized the Indian headquarters at Bomdila near Tibet and were threatening the Indian state of Assam. Faced with defeat on the border and a Chinese invasion, the Indian government said it would \"respond positively\" to the Chinese offer of a ceasefire.",
        "21\tNovember\t1962": "India and China declared a truce from the war in which India was badly beaten. Because of winter in China, they halted their advance into India.",
        "21\tNovember\t1963": "First sounding rocket launched from Thumba Equatorial Rocket Launching Station (TERLS). Thus started India's space programme.",
        "21\tNovember\t1969": "Bhilai Steel Plant creates a new world record in steel-making by producing 'one heat' in four hours three minutes.",
        "21\tNovember\t1970": "Sir Chandrasekhar Venkata Raman, great Indian physicist, passed away early morning at Bangalore, Karnataka. His work was influential in the growth of science in India. He was the recipient of the 1930 Nobel Prize for Physics for the 1928 discovery now called Raman scattering which is a change in frequency observed when light is scattered in a transparent material. When monochromatic or laser light is passed through a transparent gas, liquid, or solid and is observed with the spectroscope, the normal spectral line is associated with it lines of longer and of shorter wavelength and this is called the Raman spectrum. Thus the Raman effect is applied in spectrographic chemical analysis and in the determination of molecular structure.",
        "21\tNovember\t1971": "Rebellion in East Pakistan (formerly Bengal). Ten million Bengalis flee to India. Indo-Pak border clashes escalate to war. India defeats West Pakistan. E. Pakistan becomes independent Bangladesh.",
        "21\tNovember\t1973": "Seth Govinddas, M.P. of Jabalpur, was honoured in the Central Hall of Parliament for completion of 50 years in Parliament, which was an unprecedented record.",
        "21\tNovember\t1985": "Ramnath Kenny, cricketer (5 Tests for India 1958-60), passed away.",
        "21\tNovember\t1991": "R. Nagarajan, former Tamil Nadu Home Secretary, arrested for harbouring LTTE militants.",
        "21\tNovember\t1992": "27 killed in a bomb blast engineered by Bodo extremists in a bus in Assam.",
        "21\tNovember\t1993": "India and South Africa sign a historic pact on re-establishing diplomatic and consular relations after a gap of 50 years.",
        "21\tNovember\t1994": "Dr. Malcom Adiseshiah, 84, noted economist and educationist, died.",
        "21\tNovember\t1998": "India 'B' beats Sri Lanka 3-2 in the final of the Bristol Freedom Cup four-nation football tournament in Colombo.",
        "21\tNovember\t1999": "The Centre retired two members of the Prasar Bharati Board, Ms. Romila Thapar, eminent historian and Mr. Rajendra Yadav."
    }
}