{
    "title": "Events for January 21",
    "events": {
        "1820": "Dalpat Rai, modern Gujrati poet, was born.",
        "1882": "Vaman Malhar Joshi, Marathi novelist, was born.",
        "1908": "Gandhiji agrees to settlement on basis of voluntary registration, if Registration Act is repealed.",
        "1910": "Ramnath Anandilal Poddar, great industrialist, was born.",
        "1922": "V. Rajagopal, cricket test umpire for 1 test in 1969-70, was born in Mumbai.",
        "1924": "Professor Madhu Dandavate, former Finance Minister, was born at Ahmednagar.",
        "1943": "Hemu Kalani, revolutionary freedom fighter and social reformer, was hanged by British police.",
        "1945": "Shri Rashbehari Basu, great revolutionary, freedom fighter, social reformer and leader, passed away at Tokyo, Japan, at the age of 60.",
        "1952": "Indian National Congress party wins the 1st General Election of India under the ledearship of Jawaharlal Nehru.",
        "1956": "Strikes and demonstrations held in Bihar and Orissa in protest of the government's intention to revise state boundaries.",
        "1961": "Queen of Britain, Elizabeth II, and her husband Duke of Edinburgh visited New Delhi.",
        "1963": "Acharaya Shivpujan Sahai, famous Hindi writer, poet and novelist, died. He was editor of Hindi journals like \"Marwari Sudhar\", \"Samanwaya\", \"Adarsh\" etc. He  wrote 400 short stories and 67 biographies. His novel \"Dehati Dunia\" is acclaimed as first regional novel in Hindi.",
        "1969": "First India built electronic digital computer commissioned.",
        "1970": "Harivinayak Pataskar, former Central Minister and Governor of Madhya Pradesh, passed away.",
        "1978": "Nilmoni Phukan, greatest social reformer, prolific writer, poet, editor of 'Dainik Batori', journalist and lawyer, passed away. He participated in the Quit India Movement for which he was arrested.",
        "1980": "Assembly elections in Kerala; LDF wins absolute majority. E.K. Nayanar forms government in Kerala.",
        "1981": "Bishnu Ram Medhi, chief minister of Assam and Governor of Madras, passed away.",
        "1983": "R. D. Katari, the first Indian Admiral of Indian Army, passed away.",
        "1993": "Biren Roy, follower of Netaji Subhashchandra Bose, passed away.",
        "1994": "India and Myanmar decide to open border trade.",
        "1996": "Lakshmi Parvati elected president of Telugu Desam NTR faction.",
        "1997": "Railways emerges overall champion in national road cycling championship in Calcutta.",
        "1999": "Bal Thackeray, Shiv Sena chief, suspends his party's protest against the coming India-Pakistan cricket matches after an urgent meeting with the Union Home Minister in Mumbai.",
        "2000": "The Samata Party National Executive elects Mrs. Jaya Jaitley as its president."
    }
}