{
    "title": "Events for December 21",
    "events": {
        "21\tDecember\t1788": "Sindhia arrested Gulam Qadir and killed him.",
        "21\tDecember\t1881": "Pundit Sunder Lal Sharma, freedom fighter and social reformer, was born at Rajim, M.P.",
        "21\tDecember\t1903": "Bhalchandra Digambar Garware, famous industrailist, was born.",
        "21\tDecember\t1911": "Central Bank of India established.",
        "21\tDecember\t1921": "Praphulchandra Natwarlal Bhagwati, justice of Supreme Court, was born.",
        "21\tDecember\t1929": "Indian National Congress convenes in Lahore.",
        "21\tDecember\t1952": "Saifuddin Kitchlu awarded the Lenin Peace Prize of U.S.S.R. Award. He was the first Indian to receive this honour.",
        "21\tDecember\t1956": "The Hindu Adoption Sub-Act 1956 was accepted.",
        "21\tDecember\t1974": "Inssatvahana, the first establishment to give submarine training,  was commissioned at Visakhapatnam.",
        "21\tDecember\t1989": "V. P. Singh wins vote of confidence in the Lok Sabha.",
        "21\tDecember\t1990": "Former Union Finance Secretary S. Venkatramanan appointed Governor of RBI. B. Rachaiah and Dr. Sarup Singh sworn in as Governors of Kerala and Gujarat respectively.",
        "21\tDecember\t1992": "BJP-sponsored no-trust motion against the Rao Government defeated 334-106 in the Lok Sabha; Vajpayee ends fast.",
        "21\tDecember\t1993": "JPC indicts RBI and Finance Ministry in the multi-crore security scam.",
        "21\tDecember\t1994": "The IAF return from peace keeping duties as part of the Indian contingent supporting UN operations in Somalia.",
        "21\tDecember\t1998": "The Viswabharati University in Calcutta presents the 'Deshikottama' award to Nobel laureate Prof. Amartya Sen.",
        "21\tDecember\t1999": "The Manisana Wage Board for Journalists and Non-Journalists of Newspapers presents tentative proposals to the Government.",
        "21\tDecember\t2000": "Women's Bill put off again."
    }
}