{
    "title": "Events for October 21",
    "events": {
        "21\tOctober\t1296": "Alauddin Khalji conquered the throne of Delhi. In July declared himself as the Sultan.",
        "21\tOctober\t1577": "Guru Ramdas, Sikh Guru, established Amritsar city.",
        "21\tOctober\t1762": "Herman W Daendels, Brig-General and Governor General of Dutch-Indies (1807-11), was born.",
        "21\tOctober\t1789": "Ramshastri Prabhune, justice of Peshwa kingdom, died.",
        "21\tOctober\t1858": "Ramabai Dongre Medhavi, great social reformer, was born.",
        "21\tOctober\t1887": "Dr. Sri Krishna Sinha, great politician, revolutionist leader and chief minister, was born at Khanwa.",
        "21\tOctober\t1906": "Gandhiji went to England till Nov 30 on deputation to present Indians' case to Colonial Secretary.",
        "21\tOctober\t1916": "Dinkarrai Dhirajlal Desai, cricket Test Umpire for 3 tests from 1955-57, was born in Gujarat.",
        "21\tOctober\t1934": "Loknayak Jayprakash Narayan and his friends established the 'Congress Socialist Party' and Acharya Narendra Dev was its President and JP was its Gen. Secretary.",
        "21\tOctober\t1943": "Azad Hind Government was established in Singapore and Netaji Subhashchandra Bose was elected as its national leader.",
        "21\tOctober\t1947": "The office of Controller of Military Accounts (Pensions), Lahore was bifurcated and the pension work relating to Indian nationals was transferred to Allahabad.",
        "21\tOctober\t1950": "China invades Tibet.",
        "21\tOctober\t1954": "Government of India and France sign an agreement for the de-facto transfer of the French settlement of Pondicherry, Karaikal, Mahe to the Indian Union. The merger took place on November 1.",
        "21\tOctober\t1959": "Chinese and Indian troops clash on Ladakh border.",
        "21\tOctober\t1981": "Kerala under central rule.",
        "21\tOctober\t1989": "Sukhdev Singh alias Sukha and Harminder Singh alias Jinda sentenced to death for the murder of former Army Chief Gen. A. K. Vaidya.",
        "21\tOctober\t1990": "Doordarshan starts afternoon news bulletins at 2 p.m. (Hindi) and 3 p.m. (English) of 7.5 minutes duration on week days and 5 minutes on Sundays.",
        "21\tOctober\t1994": "Government notifies substantial increase in the ceiling on election expenses on Lok Sabha and Assembly polls.",
        "21\tOctober\t1995": "Suresh Mehta, Finance Minister in the outgoing Keshubhai Patel ministry, sworn in as the second BJP CM of Gujarat in Gandhinagar, ending the month-long political turmoil.",
        "21\tOctober\t1996": "Japan gets non-permanent seat in Security Council after a contest with India.",
        "21\tOctober\t1997": "RBI de-regulates deposit rates, reduces CRR and Bank Rate (from 10\\% to 9) and allows banks to have two sets of Prime Lending Rates.",
        "21\tOctober\t1998": "Ajit alias Hamid Ali Khan (76), Hindi film actor, dies in Hyderabad.",
        "21\tOctober\t1999": "Madhavrao Scindia becomes the Deputy Leader of Congress (I) in the Lok Sabha.",
        "21\tOctober\t2000": "Seema Antil becomes the first Indian ever to win a global title by bagging a gold medal in disc throw in the World Junior Athletic championship in Santiago."
    }
}