{
    "title": "Events for February 21",
    "events": {
        "1672": "A French squadron under De la Haye encountered a fleet of the Dutch, who were in hostility with the French, near Cape Comorin.",
        "1829": "Kittur Rani Channamma, revolutionary freedom fighter and social reformer, passed away.",
        "1878": "Mother-Pondicherry, greatest world teacher, was born in Paris.",
        "1894": "Dr. Shanti Swarup Bhatnagar, famous scientist, was born at Bhera, Punjab.",
        "1899": "Suryakant Tripathi `Nirala', famous Hindi poet, was born.",
        "1952": "The XV Indian Olympic Games in Madras.",
        "1953": "Tillaya Dam and Bokaro Power Station opened by the PM.",
        "1959": "Press Club of India was founded in New Delhi.",
        "1973": "V. R. Sonalkar was appointed as the Narcotics Commissioner of India. He headed this office till 31-07-1974.",
        "1979": "Yousuf Hussain, litterateur and brother of President Zakir Hussain Khan, passed away.",
        "1983": "More than 600 people were killed in the Indian state of Assam after student agitators protesting the immigration of Muslim refugees from Bangladesh attempted to stop state elections.",
        "1987": "Pakistan President Gen. Zia visits India.",
        "1990": "The Bombay Sappers join the club of the select few, who received colours from the President of India (21-2-90).",
        "1991": "Nutan, famous film actress, died at the age of 56 years.",
        "1992": "Congress scores nearly three-fourth majority in Punjab Assembly elections.",
        "1993": "Naxals free Andhra Pradesh Congress (I) MLA P.Balaraju and a govt. official after 22 days in captivity.",
        "1995": "The plan outlay for Andhra Pradesh for 1995-96 fixed at Rs. 3.159 crores.",
        "1996": "Japanese encephalitis', caused by virus transmitted by mosquitoes, claims 21 lives in Kerala.",
        "1997": "Sonic Multani bags National snooker title in Mumbai.",
        "1998": "Romesh Bhandari, U.P. Governor,  dismisses the Kalyan Singh Government and inducts an 18-member ministry headed by Jagadambika Pal of the Loktantrik Congress Party. BJP moves the Allahabad High Court. BJP's Prime Ministerial candidate, A. B. Vajpayee, goes on a \"fast-unto-death\"."
    }
}