{
    "title": "Events for March 21",
    "events": {
        "1791": "Tipu Sultan capitulated to Lord Cornwallis.",
        "1836": "National Library was established.",
        "1916": "Ustad Bismilla Khan, clarionett Master, was born at Dumraon in Bihar.",
        "1921": "Indian National Congress decided it's Flag.",
        "1934": "Buta Singh, former Home Minister of India, was born.",
        "1937": "Muhammad Jaffer, great Indian Hockey player, was born.",
        "1939": "Gandhi calls on world to disarm, thinks Hitler would follow.",
        "1957": "India's national calender came into force.",
        "1966": "Indian Remote Sensing Satellite (IRS-P3) placed into polar orbit. This carries remote sensing payload and an X-ray astronomy payload. Launched by third developmental flight of India's Polar Satellite Launch Vehicle (PSLV-D3) which is for launching 1,000-1,200 kg class of remote sensing satellites into polar sun-synchronous orbit. Still in service.",
        "1971": "Gavaskar scores the first of his 34 Test tons, 116 at Georgetown.",
        "1973": "Yashwant Ramkrishna Date, great Marathi dictionary creator, passed away.",
        "1976": "The Indian people have delivered a stinging rebuke to the woman who had ruled them without the benefit of a constitution for the past 19 months by dumping her from office in a landslide election. After 11 years of rule, Indira Gandhi has resigned, and in an uncharacteristically humble statement said she \"accepted the verdict unreservedly\" and promised \"constructive cooperation\" with the new government. The heads of the victorious parties immediately dropped the year-and-a-half-old state of emergency, freed political prisoners, and began negotiations over who would head the new government.",
        "1977": "Internal Emergency, promulgated on June 25, 1975, withdrawn by Prime Minister Indira Gandhi.",
        "1979": "The Cytology Research Centre was set up at New Delhi (renamed as the Institute of Cytology and Preventive Oncology in 1988).",
        "1982": "Nadmuri Tarak Rama Rao forms Telugu Desam Party in Andhra Pradesh.",
        "1992": "India's second submarine 'Shankul' joined Navy.",
        "1993": "The 68 km Mangalore-Udupi stretch of the west coast Konkan rail line opened by the PM.",
        "1994": "Pakistan blocks access to Indian consulate in Karachi.",
        "1995": "Lok Sabha passes Patent Bill by amending the Patent (Amendment) Act 1970.",
        "1996": "Supreme Court holds that attempt to suicide and its abetment would continue to be punishable offences.",
        "1997": "Jockey Vasant Shinde retires.",
        "1998": "Jaswant Singh is appointed Deputy Chairman of the Planning Commission after the resignation of Prof. Madhu Dandavate.",
        "2000": "The 10,000 bond scheme for short-term visitors to the UK will not be applied to India, Pakistan and Bangladesh, said British Minister of State for Foreign and Commonwealth Affairs Keith Vaz."
    }
}