{
    "title": "Events for April 21",
    "events": {
        "1451": "Buhlul Khan Lodi, an Afghan and founder of Lodi dynasty, ascends the throne of Delhi and displaced the Alam Shah of Syed dynasty.",
        "1526": "Mughal conqueror Babur Shah (1483-1530) defeats Ibrahim Lodi II, the Lodi Sultan of Delhi, and captures Delhi and the Koh-i-noor diamond, in the First Battle of Panipat. He founded the Mughal dynasty in India (1526-1761), consolidated by his grandson Akbar.",
        "1659": "Chhatrapati Shivaji Maharaj meet Saint Samarth Ramdas Swami.",
        "1720": "Peshwa Balaji Vishwanath passed away and was succeeded by his son Peshwa Baji Rao I. He was a great soldier and General.",
        "1805": "Defitiniv treaty between Anandrao Gaikwad and Britishers.",
        "1913": "Preview show of 'Raja Harishchandra' was held on April 21 at Olympia Cinema.",
        "1938": "Muhammad Iqbal, famous Urdu poet, passed away.",
        "1946": "Srinivasaraghavan Venkataraghavan, cricket (Indian off-spinner, Test umpire, ICC referee), was born in Madras. He received Arjun Award (1971).",
        "1955": "Avadi session of the Indian National Congress adopts a socialistic pattern of society for India.",
        "1975": "Farakka Barrage dedicated to nation.",
        "1990": "18 more ministers added in the National Front Ministry.",
        "1991": "Hastmalji Maharaj, Jainbhumi parampujya, passed away.",
        "1992": "UN Secretary-General Boutros Boutros-Ghali visits New Delhi.",
        "1993": "India announces establishing proof in Pakistan's complicity in Bombay bomb blasts.",
        "1994": "Malayalam sweeps national film awards. Mammootty, Shobhana best actor and actress; T.V. Chandran best director; Buddadeb Das Gupta's Bengali 'Charachar' adjudged best film.",
        "1995": "Medium range 'Akash', surface-to-air-missile, flight trial successful.",
        "1996": "Sanjay Thapar of the IAF (leader) becomes first Indian to parachute down to geometric North pole and unfurl the flag.",
        "1997": "Inder Kumar Gujaral sworn as the 12th Prime Minister of India, along with old council of ministers in the H. D. Deve Gowda govt. minus Tamil Maanila Congress Minister and D. P. Yadav of Janata Dal.",
        "1998": "The services of 12 non-railway chairmen of Railway Recruitment Boards are terminated."
    }
}