{
    "title": "Events for September 21",
    "events": {
        "1746": "French expeditionary army occupies Labourdonnais & Dupleix Madras.",
        "1857": "Bahadurshah Jafar - II surrendered against the British troops.",
        "1862": "Venkat Apparao Gurjad, famous Telegu poet, playwright, story writer, critic and social reformer, was born.",
        "1895": "Annapurnanand, great writer, was born.",
        "1898": "Tushar Kanti Ghosh, famous journalist, was born.",
        "1912": "Firoz Gandhi, great politician, was born.",
        "1933": "Annie Besant, great social worker and founder of Home Rule Movement, passed away.",
        "1938": "Prof. Raghuveer Singh Rathore, Cricket Test umpire for one test in 1990-91, was born in Rajasthan.",
        "1945": "British promise India independence.",
        "1948": "Formation of Press Trust of India (PTI) announced under an agreement signed between Reuters and Indian and Eastern Newspapers Society.",
        "1954": "Last Indian troops withdraw from Tibet.",
        "1962": "Major General I. J. Rikhye completed the task in accordance with the memorandum to UNSF, thus fulfilling the mandate of cessation of hostilities without any incident.",
        "1966": "Mihir Sen swam the Bay of Persia.",
        "1984": "National Bureau of Animal Genetic Resources and National Institute of Animal Genetics were set up. These institutes were initially located in the campus of southern regional station of National Dairy Research Institute, Bangalore. They were then shifted to Karnal in July 1985.",
        "1990": "Supreme Court refuses to stay implementation of Mandal Commission Report.",
        "1992": "Tarachand Barjatya, film producer, passed away.",
        "1994": "Ramkrishna Bajaj, freedom fighter and veteran industrialist, passed away.",
        "1995": "Rumors that statues of the Hindu god Ganesh were drinking milk spread in New Delhi.",
        "1996": "Rao resigns Congress Party President post.",
        "1997": "I. K. Gujral and Nawaz Sharif discussed in New York the recent flare-up on Line of Control and firing across the border.The two agreed that such sources of tension should not be allowed.",
        "1999": "Mr. A. C. Muthiah was elected president and Kapil Dev the senior coach at the Board of Control of Cricket in India AGM in Jaipur.",
        "2000": "J.W. Singh, suspended Mumbai High Court judge facing charges of extortion in nexus with the underworld, dismissed from judicial service."
    }
}