{
    "title": "Events for November 22",
    "events": {
        "22\tNovember\t1718": "Durgadas Rathore, social reformer, died on the banks of the Sipra at Ujjain.",
        "22\tNovember\t1773": "Robert Clive, English occupier (India), passed away at the age of  48.",
        "22\tNovember\t1872": "Meera Behn (Medlin Slade), freedom fighter, was born at England.",
        "22\tNovember\t1873": "Leopold CMS Amery, British minister of Colonies (India), was born.",
        "22\tNovember\t1899": "Shaheed Laxman Nayak, freedom fighter and leader, was born at Tentuliguma village, Koraput district.",
        "22\tNovember\t1913": "Lakshmikant Jha, Governor of Jammu and Kashmir state and international famed ecomonist, was born.",
        "22\tNovember\t1915": "Mohandas Gandhi returns to India.",
        "22\tNovember\t1916": "Shanti Ghosh, great revolutionary freedom fighter, was born at Calcutta. She was one of the accused in famous Chargaon ammunition plot and assassination of General Lemen, Inspector General of Dhaka.",
        "22\tNovember\t1928": "British King George confined to bed with congested lung; Queen to take over duties.",
        "22\tNovember\t1967": "Tara Singh,  freedom fighter, Akali Dal leader master and politician, died at Amritsar.",
        "22\tNovember\t1968": "Lok Sabha passed notification to change the name of Madras state as Tamil Nadu.",
        "22\tNovember\t1971": "Indian and Pakistan governments protested violations of national airspace along the western border, but aerial conflict between the respective air arms began, preceding full-scale warfare between India and Pakistan by 12 days.",
        "22\tNovember\t1988": "Baba Amte wins U.N. Human Rights Award.",
        "22\tNovember\t1989": "Rajindernath, great Indian wicketkeeper 1 Test and 0 runs 0 ct, 4 stp, passed away.",
        "22\tNovember\t1990": "Laloo Prasad Yadav, Bihar CM, wins confidence motion (202-108).",
        "22\tNovember\t1991": "Supreme Court declares Karnataka's ordinance on Cauvery water dispute as unconstitutional.",
        "22\tNovember\t1993": "Gulshen Ahmed, Himachal Governor, resigns in the wake of an official report that he canvassed for his son in Satna.",
        "22\tNovember\t1997": "Diana Hayden, 24-year-old Mumbai-born Miss India, beat 85 contestants from around the world to be crowned new 'Miss Universe' at Mahe in Seychelles.",
        "22\tNovember\t1999": "A.B.Vajpayee, Prime Minister, expands cabinet as four more ministers join the ministry including Arun Shourie.",
        "22\tNovember\t2000": "Chhota Rajan, Mumbai gangster, escapes from the custody of Thai authorities."
    }
}