{
    "title": "Events for October 22",
    "events": {
        "1680": "Rana Rajsingh, king of Mewad, died.",
        "1764": "The Battle of Buxar was fought between armies of Mir Qasim, the Nawab of Bengal; the Nawab of Awadh; and the Mughal Emperor Shah Alam II and British East India Company led by Hector Munro.",
        "1796": "Sawai Madhav Rao Peshwa II committed suicide by jumping from the terrace.",
        "1873": "Swami Rama Tirtha, great social reformer and poet, was born at Murariwala village of Gujranwala district. He lectured throughout Japan and America spreading \"practical Vedanta\".",
        "1908": "John Sutton, actor (Tower of London, Return of Fly), was born in Rawalpindi, India.",
        "1912": "Gandhiji accompanied Gokhale on tour of South Africa, Laurenco Marques, Mozambique and Zanzibar. He gave up European dress and milk and restricted himself to diet of fresh and dried fruits.",
        "1913": "Harumal Sadarangani, famous Sindhi writer, was born at Sind, Pakistan.",
        "1929": "Air Mail Series Stamps were issued. These stamps were of denominations of 2, 3, 4, 6, 8 and 12 annas.",
        "1933": "Vithalbhai Patel, great freedom fighter, social worker, leader, politician, President of the Central Assembly, lawyer and member of parliament, died in Geneva.",
        "1937": "Gandhiji presided over the educational conference at Wardha and outlined his scheme of education through basic crafts.",
        "1947": "There were bound to be difficulties in consolidating the loosely federated Indian provinces, princely states, etc. into one homogeneous whole state. Kashmir, after initial dithering, acceded to India voluntarily and by popular consent, then, was invaded by Pakistani tribesmen with the support of the Pakistani government.",
        "1962": "Bakhra-Nangal Dam, a multipurpose river valley project, was dedicated to the nation by Prime Minister Jawaharlal Nehru.",
        "1983": "The Union government reduces the upper age limit for the Civil Services Examination from 28 years to 26 years.",
        "1997": "Indian veterans take winning 3-0 lead against Pakistan in the five-match cricket series.",
        "1999": "The Prime Minister warns of more 'hard decisions'.",
        "2000": "The Supreme Court, in a significant order, erases  Karnataka High Court judgement discharging  former Chief Minister S. Bangarappa and his then private secretary R. Suribabu in a corruption case."
    }
}