{
    "title": "Events for January 22",
    "events": {
        "1666": "Shahjahan (Sjihab Al-Din Sultan C Shah D Jahan), great Mughal emperor, died at the Agra fort as a prisoner, to rest besides Mumtaz in Taj Mahal. Jahanara arranged that Sahjahan be laid.",
        "1683": "Shri Samarth Ramdas passed away.",
        "1760": "In the battle at Wandiwash (India), after their victory against the French,  the British virtually had no European opponent left in India.",
        "1858": "Veer Narayan Singh, freedom fighter, was sentenced to death.",
        "1877": "Tarun Ram Phookun, ''Deshabhakta'', great lawyer, orator, eminent writer and President of the Assam Chhatra Sammelan in 1928, was born in Gauhati, district Kamrup, Assam.",
        "1886": "Harikrishna Premi, Hindi writer, passed away.",
        "1899": "Dilipkumar Roy, classical  musician, was born.",
        "1901": "Queen Victoria (1819-1901) passed away at Osborne House, Isle of Wight, South England, after a brief illness. She had been throned for almost 64 years, which is the longest reign in British history. She had given her name to an age \"Victorian Britain\".",
        "1903": "Shankar Das Banerji, lawyer and politician, was born at Calcutta.",
        "1906": "Judge Jayantilal Chhotalal Shah, chief Justice and Supreme Court of India, was born.",
        "1922": "Shanta Buddhisagar, famous Marathi writer, was born.",
        "1945": "The Indian 7th Division captures Tilin at Burma.",
        "1963": "The National Library for the Blind, the first national institute of its kind, was set up at Dehradun.",
        "1965": "Plutonium Project (Sanyantra) was inaugurated at Trombay, Mumbai.",
        "1967": "Atomic Energy Center was renamed after Homi Jahangir Bhabha as 'Bhabha Atomic Research Centre' at Trombay, Mumbai.",
        "1971": "Judge Sarv Mittra Sikri became the Chief Justice of India. He helded this office till 25/04/1973.",
        "1973": "Swami Ramanand Tirth, politician and educationalist, passed away.",
        "1980": "Bal Ram Jakhar elected Lok Sabha Speaker.",
        "1986": "Satwant Singh, Balbir Singh and Kehar Singh, all sikhs, were sentenced to death for the assassination of India's Prime Minister Indira Gandhi.",
        "1989": "Madhya Pradesh CM Arjun Singh resigns on Churhat lottery case grounds.",
        "1990": "The International Literacy Campaign was launced in the country by the Prime Minister at a national function held at New Delhi. (8-9-90).",
        "1992": "Government raises Suzuki share in Maruti to 50 per cent making it the first public sector company to go private.",
        "1993": "A Patna-Lucknow-Delhi IA flight IC-810 was hijacked by a certain Satish Chandra Pandey shortly after take-off.",
        "1996": "Janata Dal parliamentary party leader Sharad Yadav resigns from Lok Sabha membership (Jain hawala case).",
        "1997": "Former Haryana Chief Minister Bhajan Lal, former Union Ministers Ajit Singh,  Ram Lakhan Singh Yadav and five others chargesheeted by CBI in Rs. 3.5 crore Jharkhand Mukti Morcha MPs bribery case.",
        "1998": "Second Lieutenant Punit Datta is posthumously selected for the nation's highest peace time gallantry award, Ashok Chakra.",
        "2000": "India retains the golf title in the SAARC championship in Dhaka."
    }
}