{
    "title": "Events for December 22",
    "events": {
        "22\tDecember\t1241": "Bahadur Tair, under their leader Mongol of Hulagu Khan, captured Lahore.",
        "22\tDecember\t1510": "Affonso de Albuquerque wrote, \"My determination now is to prevent any Moor entering Goa, to leave a sufficient force of men and ships in the place, then with another fleet visit the Red sea and Ormuz\".",
        "22\tDecember\t1751": "Battle of Mandavgargh.",
        "22\tDecember\t1843": "Debendranath Tagore, father of Rabindranath Tagore, accepted Brahmo religion at the hands of Ramchandra Vidyabagish.",
        "22\tDecember\t1853": "Saradamoni Devi was born in Jairambati of Hooghly district.",
        "22\tDecember\t1866": "Mazharul Haque, great social reformer, nationalist, journalist, poet, writer and politician, was born at Bahpura, Bihar.",
        "22\tDecember\t1871": "Lord Edward Allanbaro, governor general of India (1842-1844), died.",
        "22\tDecember\t1877": "Shreenivas Ramanujam, famous Indian mathematician, was born.",
        "22\tDecember\t1887": "Srinivas Ramanujam, India's greatest mathematician, was born at Erode in Tamil Nadu.",
        "22\tDecember\t1928": "An Alpine Romance', a 709 feet long sound film produced by Universal Picture Corporation, America, was the first sound film censored at Bombay on December 22. The other sound films censored on the same day were 'The Brox Sisters' and 'Bailey and Barnum'.",
        "22\tDecember\t1939": "When Britain declared war against the Germans it appealed for help from all political parties. Congress put up some conditions which in other words were the immediate transfer of power. The Viceroy promised to give due consideration to the suggestions of each party and that the dominion status would be given after the war. Congress in order to pressurize the Govt. boycotted all ministries and started a civil disobedience  movement and eventually resigned. Jinnah declared 22nd Dec 1939 as \"Day of Deliverance\".",
        "22\tDecember\t1940": "Manvendranath Rai established the Radical Democratic Party.",
        "22\tDecember\t1945": "Shridhar Balkrishna Kulkarni (Pathe Bapurao), famous poet known for instant poetry and Marathi folk song writer, died.",
        "22\tDecember\t1947": "Dilip Rasiklal Doshi, cricketer (India's main slow lefty post-Bedi), was born in Rajkot.",
        "22\tDecember\t1966": "U.S. announces allocation of 900,000 tons of grain to fight famine in India.",
        "22\tDecember\t1975": "Vasant Krishna Desai, famous music director, died.",
        "22\tDecember\t1977": "Nalinibala Devi, Assamese poet, passed died.",
        "22\tDecember\t1986": "India cricket team score 7-676 vs Sri Lanka at Kanpur.",
        "22\tDecember\t1992": "Lok Sabha adopts the constitution amendment bills regarding Panchayati Raj and Nagarapalika Bills, and decentralisation of power to the village level.",
        "22\tDecember\t1994": "Sunil Gavaskar takes oath of office as the Sheriff of Bombay.",
        "22\tDecember\t1995": "A Russian-made AN-26 plane forced to land in Bombay following an Intelligence Bureau tip off that it could be the suspected aircraft which dropped arms at Purulia.",
        "22\tDecember\t1998": "The Patents Bill gets Rajya Sabha approval.",
        "22\tDecember\t1999": "The Government says there is no hidden agenda behind the US lifting of curbs.",
        "22\tDecember\t2000": "Three Army jawans die in an attack by a suicide squad of Lakshar-e-Taiba at the Red Fort in Delhi leading to a 45-minute gun-battle."
    }
}