{
    "title": "Events for February 22",
    "events": {
        "1845": "Serampore of Hooghly district and Balasore cities from Dutch purchased East Indian Company.",
        "1854": "Kawasji Nanabhai Dawar started the first Cloth Mill namely 'Bombay Spinning Mills'.",
        "1858": "Gannau resident of Samosa Gali in Delhi, arrested for revolutionary activities, was hanged.",
        "1873": "Sir Muhammad Ekbal, writer of song 'Sare Jahanse Achha', was born.",
        "1885": "Jatindra Mohan Sen Gupta, great nationalist leader, was born.",
        "1905": "Purushotamsing Bajaj, industrialist and social worker, was born at Shikarpur (Sind).",
        "1913": "Judge Mirza Hameedullah Beg, Chief Justice of Supreme Court of India, was born in Lucknow.",
        "1944": "Kasturba Gandhi passed away in British imprisonment in Aga Khan Palace at Pune.",
        "1946": "Curfew imposed till 9 p.m. by the British in Bombay as rioting and looting continued for the second day.",
        "1947": "Nehru welcomes British independence offer, invites Muslims to join at New Delhi.",
        "1948": "Jayalalitha, chief minister of Tamil Nadu, was born.",
        "1958": "Maulana Abul Kalam Azad passed away in New Delhi, India. He was a great leader, great orator, revolutionary and fighter for national freedom. Some of his works which are the masterpieces of the Urdu language are \"Ghubari-Khatir\" and Tadhkirah\". He was Minister of Education in the first Indian Government.",
        "1977": "Emergency and 'MISSA'  laws were cancelled.",
        "1978": "Judge Yeshwant Vishnu Chandrachud became the Chief Justice of India. He helded this office till 11/07/1985.",
        "1982": "South-South Conference opens in New Delhi.",
        "1990": "1st day India vs New Zealand cricket at Auckland. NZ 5-78 at lunch, 9-387 stumps.",
        "1993": "Vinod Kambli scores 224 vs England at Bombay in 411 balls and smashes 23 fours.",
        "1994": "Punjab brought back to international air map after 10 years with the introduction of flights to 8 countries from Amritsar Rajasansi Airport.",
        "1996": "Indian police charge 14 more politicians in corruption scandal that has already led to resignations from the Prime Minister Narasimha Rao's govt.",
        "1997": "Jockey Mark Gallagher shot at and injured in Bangalore."
    }
}