{
    "title": "Events for March 22",
    "events": {
        "1709": "It is assumed that Goswami Tulsidas  started writing his great epic 'Ramcharitmanas' in Samvat 1631.",
        "1739": "Nadir Shah entered Delhi. He gave the signal to one of his soldiers from Sunheri mosque.",
        "1793": "Lord Cornwallis promulgated permanent settlement  in Bengal and Bihar to fix the revenue amounts once and for all to be paid by the zamindars every year.",
        "1885": "Gulam Yazdani, great archaeologist and critic, was born.",
        "1893": "Surya Sen, alias Masterda, revolutionary freedom fighter, was born.",
        "1902": "Great Britain and Persia agree to link Europe and India by telegraph.",
        "1906": "Bhagwant Bhikaji Samant, educationalist, was born.",
        "1907": "Perturbed by a new law restricting Asiatic immigrants, Mohandas Gandhi, a young Indian attorney now living in South Africa, organized a campaign of civil disobedience to resist the statute popular bill  passed by the new Boer government of the Transvaal Colony. The Asiatic Registration Bill was considered by Gandhi unjust and discriminatory to the large Chinese and Indian populations. However, the government expressed the belief that the ordinance was popular. \"Over 90 percent of the white people thoroughly approve of it,\" said Sir Gilbert Parker, a Conservative member of Parliament.",
        "1914": "M. L. Bhowmik, social reformer and politician, was born Kailashahar, Tripura.",
        "1915": "Dr. Nagendra, famous hindi critic, was born.",
        "1932": "Indian Muslims break with Great Britain.",
        "1933": "M.V.Nagendra, cricket test umpire for 11 tests from 1963-77, was born at Karnataka.",
        "1938": "IRFA was registered as a local body not administered by the Government on March 22, 1938 under the Government of India Act No. XXI of 1860.",
        "1942": "Both Congress and Muslim League refused Cripps Mission offer. Congress adopts Quit India Resolution. Cripps Commission came to India which was preceded by Sir Stephard Crips  to find out a political formula for transfer of power to Indians.",
        "1947": "India's Last Viceroy Lord Louise Mountbatten came to India.",
        "1949": "SSC Examination system started.",
        "1957": "National Calander based on Saka Samvat was adopted. As per this calander, the date of adoption was \"\"Chaitra first, 1879 Saka along with Gregorian.",
        "1961": "Jual Teria Dilga Oram was born in Kendudihi, Distt. Sundargarh (Orissa).",
        "1963": "World Bank loans India $ 67 mil. to improve its railways.",
        "1964": "200 die in communal violence in the industrial towns of Jamshedpur and Rourkela.",
        "1969": "The first public sector petrochemical organisation was inaugurated.",
        "1971": "Shri Hanuman Prasad Poddar, great social reformer, revolutionary and poet, passed away.",
        "1977": "Ayillyath Kuttiari Goplan, freedom fighter, social reformer and Marxist leader, passed away in Trivandrum.",
        "1991": "Chautala sworn in as Haryana CM.",
        "1993": "The Lok Sabha passes the Indian Medical Council (Amendment) Bill, 1993 and the Dentists (Amendment) Bill, 1993.",
        "1996": "Golden Temple renamed Harmandir Sahib (its original name meaning 'abode of God').",
        "1997": "Deshabhimani daily, official organ of CPI (M), launches its 5th edition from Kottayam, Kerala.",
        "1999": "Punjab men, Railway women emerged National basketball champions in Jaipur.",
        "2000": "P. Shanmugham sworn in Chief Minister of Pondicherry."
    }
}