{
    "title": "Events for April 22",
    "events": {
        "1812": "Dalhousie, governor general of India, was born.",
        "1840": "James Princes, British research scientist and archeaologist, passed away.",
        "1870": "Vladimir IIyich Lenin, revolutionary freedom fighter and politician, was born at Simbrisk, Volga.",
        "1915": "Hem Barua, famous Assami and English litterateur, was born.",
        "1921": "Subhas Chandra Bose, resigned from Indian Civil Service, and formed South Calcutta Sevak Samiti after returning to India. He was also arrested for carrying our freedom movement.",
        "1923": "Babani Sheshagiri Pai, social worker and journalist, was born at Ankola in Karnataka.",
        "1930": "Revolutionary Surjya Sen's many associates were killed and Surjya Sen \"Masterda\" himself went underground, on Jalalabad Hill and started extending his activities to neighbouring districts.",
        "1942": "Galagnath (Vyanktesh Tirko Kulkarni), famous Kannad novelist, passed away.",
        "1958": "Admiral R. T. Katari was appointed as the first Indian Chief of the Naval Staff.",
        "1983": "Smt. Indira Gandhi, Prime Minister of India, visited ICMR Headquarters and held discussions with senior scientists of ICMR. ICMR revived research on indigenous drugs/traditional medicine with a new, disease-oriented approach and a Scientific Advisory Group on Traditional Medicine Research was constituted in 1983 but actual studies (Multicentric Clinical Trials, Centres for Advanced Research, Central Biostatistical Monitoring Unit etc.) were started in 1984-85.",
        "1991": "IMF and the World Bank decide to grant $1 billion loan to India.",
        "1992": "IAF in response to a recommendation by Secretary General, the Security Council adopted resolution No. 751 (1992) by which it established UNOSOM for handling situation which had deteriorated to an extent where death and destruction forced hundreds of thousands of civilians to flee their homes and causing need for emergency humanitarian assistance.",
        "1993": "Air India engineers call off their 56-day-old strike.",
        "1994": "Sushil, great Jain Muni Acharya, passed away.",
        "1996": "Hiteshwar Saikia, chief minister of Assam (1991-96), passed away at  the age of 62 years, and Dr. Bhumidhar Barman became new CM.",
        "1998": "India and Bangladesh resolve to work together to ''root out terrorism'', push bilateral trade and harness river waters of the region.",
        "1999": "Lok Sabha passes the 1999-2000 general budget through voice vote but without a debate and without amendments.",
        "2000": "Bhaktavar Lentin (72), former Judge of the Bombay High Court, died after a prolonged illness at his residence in Mumbai."
    }
}