{
    "title": "Events for May 22",
    "events": {
        "1545": "Sher Shah Sur died. He was fatally wounded in an explosion on Kalanjara fort while preparing for an attack. He introduced the new silver rupee-coin \"Rupiya\" based on ratio of 40 copper coin pieces (paisa) per rupee and built several roads including the longest road of India known as Grand Trunk Road (now Natioinal Highway-2).",
        "1772": "Raja Ram Mohan Roy, great social reformer, lawyer and politician and founder of Brahmo Samaj, was born at Radhanagar in Hooghly district, Bengal.",
        "1917": "Suniti Chaudhary, revolutionary freedom fighter, was born at Kumilla. She was one of the accused in the  famous Chargaon ammunition plot and assassination of General Lemen, Inspector General of Dhaka.",
        "1927": "M. S. Shivsankaraiyah, cricket test umpire for 3 tests from 1974-77, was born at Andhra Pradesh.",
        "1936": "Lord Brabourne laid the foundation stone of Brabourne Stadium in Bombay.",
        "1940": "Erapalli Anantrao Srinivasarao Prasanna, cricketer (one of India's big four spinners, Right-arm Off-break Bowler), was born at Bangalore. He is also the receipent of Arjun Award (1968) and Padmashree (1970).",
        "1953": "Sherpa Tenzing Norgay of Darjeeling and Edmund Hillary of New Zealand were the first to conquer the Mount Everest (World).",
        "1961": "Jnanpeeth Award was instituted and the first award was given in 1965. This award is given for the best creative literary writing by any Indian citizen in any of the languages included in the VIII Schedule of the Indian Constitution. The award carries a cash price of Rs 2.5 lakh, a citation and a bronze momento.",
        "1963": "Rohini, Glider,  became the first to successfully fly at Kanpur.",
        "1970": "Vijayanand Patnaik established political party `Utkar Congress'.",
        "1989": "IRBM 'Agni' Missile launched successfully from Chandipur, Orissa.",
        "1991": "Shripad Amrit Dange, veteran communist leader, passed away.",
        "1992": "India launches its 'Agni' rocket.",
        "1993": "Congress (I) suffers reverses in the by-elections.",
        "1996": "United Front prime ministerial candidate H.D. Deve Gowda unanimously elected leader of the Front's parliamentary party.",
        "1997": "At least 40 persons are killed and over 300 injured in an earthquake which hit Jabalpur city."
    }
}