{
    "title": "Events for June 22",
    "events": {
        "1555": "Humayun crossed the Indus and captured Lahore and ousted Sikandar Suri of Delhi throne.",
        "1880": "Nilmoni Phukan, greatest social reformer, prolific writer of Assam, poet, editor, journalist and lawyer, was born at Dibrugarh, Assam.",
        "1897": "The Chafekar brothers, Damodar and Balkrishna, shot British Officer Rand in Pune. This event played a very important role in the revolutionary freedom fighter.",
        "1898": "The last total Solar Eclipse of 19th century was seen in India.",
        "1910": "Mohommed Hussain `Azad', great Urdu poet, eassy writer and critic, died.",
        "1917": "Mohy-id-Din Hajini, famous Hindi writer and professor, was born at Kashmir (Hajin).",
        "1920": "Chandrasekhar Trimbak Sarwate, cricketer (batted in 9 Tests for India 1946-52), was born in Sangor, Vidarbha.",
        "1935": "Vaman Viswanath Kumar, cricketer (useful Madras leggie who only played 2 Tests), was born in Madras.",
        "1940": "Netaji Subhashchandra Bose established the 'Forward Block' after differences with Congress leaders.",
        "1944": "British 14th army frees Imphal, Assam.",
        "1948": "Emperor of India title was deleted from His Majesty the King of United Kingdom's titles.",
        "1955": "Sadashiv Garpatrao Shinde, cricketer (12 wkts in 7 Tests for India), died at the age of 31.",
        "1959": "Iyengar Kasturi Srinivas, great politician and journalist, passed away.",
        "1971": "Habib Muhammad died.",
        "1975": "National Emergency was declared and censorship introduced.",
        "1982": "19 persons were killed and 25 injured when an Air India Boeing 707 from Singapore via Madras crashed at Bombay.",
        "1991": "M. Karunanidhi, DMK President, resigned from the Assembly.",
        "1993": "The centre bans the use of 12 pesticides.",
        "1994": "L. V. Prasad, father of South Indian film industry, died.",
        "1995": "India and International Committee of the Red Cross (ICRC) sign MOU enabling them to visit suspected militants and persons in detention centres only under humanitarian consideration.",
        "1996": "Saurav Ganguly scores 131 at Lord's on Test debut."
    }
}