{
    "title": "Events for July 22",
    "events": {
        "1678": "Chhatrapati Shivaji Maharaj won the fort of Vellore.",
        "1702": "The \"English Company of Merchants\" and the old East India Company was named the United Company of Merchants of England Trading to the East Indies\". In1833, this name finally changed to East India Company.",
        "1875": "Nandkishor Bal, great Oria poet, novelist and critic, was born.",
        "1918": "During the First World War, India's first fighter pilot Indra Lal Rai's plane was shot down in battle by Germans planes near London. Rai had fought for Britisher's Force.",
        "1925": "Homi Jehangir Teleyarkhan, social worker, was born.",
        "1944": "Man Mohan Modi Seth , great industrialist, was born at Modinagar, U.P.",
        "1956": "Quake shatters town of Anjar; claiming 117 lives, 800 people were missing.",
        "1959": "Ananth Kumar was born in Banglore. He is a Minister in Vajpayee's Government.",
        "1970": "Himachal Pradesh Krishi Vishvavidyalaya (HPKV), College of Agriculture, Palampur was transferred to Himachal Pradesh University as part of its Agricultural Complex.",
        "1978": "Indira Gandhi charged with criminal misconduct during 1977 campaign.",
        "1981": "India's first experimental geo-stationary communication satellite 'Apple' started working which was launched on June 19, 1981.",
        "1987": "A.G. Kripal Singh, 14 Tests for India and one century on debut, passed away.",
        "1991": "Pandit Basavraj Rajguru, great singer, passed away.",
        "1992": "The Supreme Court asks UP Government to halt construction in Ayodhya.",
        "1993": "Swiss Justice ministry reveals that Hindujas, Quatrocchi and Win Chadha are among the seven appellants fighting to prevent the transfer of Bofors pay off names to India.",
        "1996": "1996-97 budget presented to Parliament by Finance Minister P. Chidambaram.",
        "1997": "Govt. issues notification saying that Prasar Bharati Act, 1990 would come into force from Sept. 15.",
        "1998": "Sahib Singh Verma, Delhi Chief Minister, and  BJP vice-president K. L. Sharma are fined Rs. 100 each for riding a motorcycle without helmet in New Delhi.",
        "1999": "J. H. Patel, Karnataka Chief Minister, recommends dissolution of the Assembly and the Governor Khurshid Alam Khan accepts it. Earlier Mr. Patel drops eight Ministers including the Deputy Chief Minister Siddharamiah."
    }
}