{
    "title": "Events for August 22",
    "events": {
        "1818": "Warren Hastings, first Governor General of India (1773-84), died at the age of  85.",
        "1877": "Ananda Kentish Coomaraswamy, great painter, philosopher, linguist, critic, art researcher in the East, was born at Colombo in Sri Lanka.",
        "1915": "Shambhu Mishra, Bengali actor, director and playwright, was born.",
        "1919": "Girijakumar Mathur, famous modern Hindi poet, was born.",
        "1922": "Alluri Seetaram Raju inspired and organised the tribals to wage a war against the British. Raju's army raided Chintapalli police station and there was regular warfare between him and the British forces.",
        "1933": "Inhabitants of Partabgarh face starvation as Opium was now outlawed. They had been living from the sale of opium for the past 800 years.",
        "1942": "Harikrishna Kaul (Raja Pandit), administrator and Prime Minister of Jammu Kashmir and Patiyala, died.",
        "1979": "Neelam Sanjeev Reddy, President of India, dissolves the sixth Lok Sabha, orders year-end general elections and asks Charan Singh to head a caretaker government.",
        "1980": "Kishor Shahu, actor and director, died.",
        "1984": "R. Venkataraman was elected the Vice President of India (1984 -1987).",
        "1987": "Aircraft carrier ship of Indian Navy 'Virat'  joined in fleet.",
        "1988": "Gorkha National Liberation Front signs an accord with the Centre and West Bengal on formation of an elective hill Council for Darjeeling.",
        "1992": "Congress (I) with its allies secures a simple majority in the Lok Sabha following the merger of Telugu Desam into the party.",
        "1993": "V P Singh leaves Delhi on a self-imposed exile vowing not to return until the government implemented job reservation for backward classes.",
        "1994": "Two dozen Mahar soldiers were ambushed when the Indian contingent was trying to stem the war in Somalia. Seven, including a JCO, lost their lives.",
        "2000": "Parliament okays two Constitutional Amendment Bills restoring relaxations in marks for promotion in government jobs to SC/STs and exempting Arunachal from reservation for SCs."
    }
}