{
    "title": "Events for September 22",
    "events": {
        "1422": "The Sultan, losing his hold over the army and some members of his aristocracy, very wisely abdicated in favour of his brother Ahmad, who is famous in Deccan history as Ahmad Shah Wali.",
        "1599": "24 merchants gathered in London's Founder Hall under the auspices of Lord Mayor to start a new company with a share captial in India.",
        "1687": "Aurangzeb ended Kutubshah kingdom.",
        "1789": "Office of Postmaster General is created under the Treasury Department.",
        "1869": "Shri Valangaiman Sankaranarayana Srinivasa Shastri, great scholar of Sanskrit, master, politician, social reformer, President of India and educationist, was born at Valangaiman village, Tamil Nadu.",
        "1891": "Gangopadhyay Taraknath, famous novelist in Bengal, passed away.",
        "1902": "Sorabjee Harmasji Colah, (right-hand batsman who batted in India's first two Tests), was born in Bombay.",
        "1931": "Gandhi meets Charlie Chaplin in London.",
        "1937": "The last contingent of Indian freedom fighters was send to Andaman & Nicobar Islands.",
        "1952": "Bapiraju Adiv, famous Telgu novelist, poet and author, died.",
        "1970": "Bandopadhyay Shardendu, modern Bengali poet, died.",
        "1979": "Maulana Abdul Ali Moudoodi aka Syed Abul A'la Maududi Chishti, founder leader of the Jamait- E- Islam, died in USA, he had taken pakistani citizenship.",
        "1986": "India vs Australia Test Cricket at Madras finishes in a tie.",
        "1988": "PM announces Government's decision to drop Defamation Bill.",
        "1991": "Durga Khote, film actress and Dadasaheb Phalke awardee, died at the age of 86 years.",
        "1992": "Indo-British Extradition Treaty signed in London.",
        "1994": "G. N. Joshi, famous singer, died.",
        "1996": "Passport seekers are given an option of 10 years (Rs. 300) or 20 years (Rs. 600) period.",
        "1999": "India asks Pakistan to prevent the reported attempt by the JKLF to cross the Line of Control (LOC) on October 4.",
        "2000": "Kerala High Court suspends the sentence awarded by the Kottayam Special Court on 32 accused in the Suryanelli rape case."
    }
}