{
    "title": "Events for October 23",
    "events": {
        "1797": "John J Rochussen, Governor General of Dutch-Indies (1845-51), was born.",
        "1824": "Rani Chainema fight with the Britishers at a 'killa' (fort) in Kitur.",
        "1883": "Darashaw Nosherwan Wadia, a pioneer in Indian Geology, was born at Surat in Gujarat.",
        "1898": "Khandubhai K. Desai, politician and social reformer, was born at Bulsar in Gujarat.",
        "1919": "Lord Curzon, ex-Viceroy of India, takes over as Former Secretary from Tory leader Arthur Balfour in London.",
        "1934": "Gandhi resigns as leader of the All India Congress.",
        "1943": "Netaji Subash Chandra Bose inaugurated the Rani Jhansi Brigade in Azad Hind Army and announced war against the British Empire.",
        "1959": "Chinese military confrontation with India in Aksai Chin killed 17 Indian soldiers in a clash on the Kashmir border.",
        "1970": "If India's \"vasectomy fairs\" had hawkers, they might cry, \"Come one, come all & all one billion.\" India faces a population of one billion by the year 2000. To hold down that number, the government offered money ($13 to each man) and gifts (a sari for his wife) to those willing to be sterilized. Thirteen dollars was more than three times what an average village worker can earn in one month. In December, a fair held at Kerala attracted 15,000 men. Just seven months later, a fair in the same town received 63,000. Doctors operated in ten-hour shifts.",
        "1973": "Sambamurthy Pichhu, famous musician of Madras, died.",
        "1985": "Rajiv Gandhi went to New York for the 40th anniversary of the UN.",
        "1990": "Following the arrest of its President L. K. Advani, who was leading a rathyathra to Ayodhya at Samasthipur in Bihar, BJP withdrew support to National Front Government.",
        "1992": "UPSC decides to introduce a new essay paper for the civil services examination.",
        "1996": "Amjad Ali Khan, sarod maestro, appointed UNICEF's national ambassador for children.",
        "1997": "Chief Ministers of Tamil Nadu and Karnataka set deadline upto 31st October for sandalwood smuggler Veerappan to surrender.",
        "1999": "V. P. Singh, former Prime Minister, tops the list of star witnesses in Bofors case."
    }
}