{
    "title": "Events for January 23",
    "events": {
        "1565": "Battle of  Krisna was fought between two villages Rakshasi and Tangadi.",
        "1664": "Shahaji Raje died in an accident.",
        "1809": "Veer Surendra Sai, freedom fighter and revolutionary, was born in Khinda village in the north of Sambalpur at Orissa.",
        "1814": "Sir Alexander Canningham, Indian Archeologist, was born.",
        "1897": "Netaji Subhas Chandra Bose, great nationalist leader and freedom fighter, was born at Cuttack. At the age of 23, he was ranked fourth in the I.C.S. Examination in London and fought against the British with his Azad Hind Fauj in the second World War.",
        "1909": "New direct 7,000-mile telegraphic link with India is hailed as a great achievement at London.",
        "1915": "Kamal Nayan Bajaj, famous industrialist, was born.",
        "1919": "Govindagraj (Ram Ganesh Gadkari), great Marathi drama writer, comedy writer and poet, passed away.",
        "1920": "Air transportation began in India by two Royal Air  Force planes between Karachi and Bombay, and Air Mail service started.",
        "1927": "Balasaheb Thackrey, Shiv Sena chief and Hindu Hriday Samrat, was born.",
        "1954": "Bakshi Ghulam Mohammad declares that the State of Kashmir is a part of India.",
        "1960": "Laxmi Narayan Garde, famous journalist related to \"Venkateshwar Samachar\", \"Bangawasi\", \"Bharat Mitra\" and \"Navjeevan\" newspapers, passed away.",
        "1961": "Supreme Court rules cities & states have right to censor films.",
        "1965": "Indian first alloy and steel plant in the public sector started in Durgapur;  alloy and steel plant limited project started.",
        "1972": "Bootlegger sells wood alcohol to wedding party; 100 die in New Delhi.",
        "1975": "Omeo Kumar Das, one of the great patriots of Assam, passed away at the age of 81. He selflessly worked for the tea plantation workers and made efforts to get them better living standards. He translated Gandhiji's autobiography \"My Experiments with Truth\" in Assamese language.",
        "1976": "Gautam Buddha's lost city of Kapilavastu was found in an excavation.",
        "1977": "Janata Party was formed. Congress Sangathan, Jansangh, Bhartiya Lokdal and Samajwadi Party decided to merge and create Janata Party.",
        "1978": "The motto \"Shastra se Shakti\" (Strength though arms) in Hindi written in Devengiri script was approved by the President of India as the motto of the Army Ordnance Corps.The original corps motto of the Ordnance corps was \"Usa Tela Tananti\" found in the arms of the board of Ordnance. This was translated to mean \"To the thunder his arms\". The corps song titled \"Ayudh Corps Mahan\" was introduced for the first time in 4th re-union of the Army Ordnance Corps. The song is to be played or sung \"within unit lines only\", during purely Regimental functions.",
        "1992": "India becomes ASEAN dialogue partner.",
        "1993": "Indian Airlines B737 crashes at Aurangabad, 61 die.",
        "1996": "Maharashtra govt. winds up the inquiry commission headed by Justice Srikrishna set up to probe the communal riots in Mumbai in Dec. 92-Jan. 93.",
        "1997": "Statue of Subhash Bose unveiled inside Parliament House.",
        "1999": "An Australian missionary, Graham Stewart Staines, and his two sons Philip and Timothy are burnt to death by miscreants near Manoharpur village in Orissa's Keonjhar district.",
        "2000": "India will be taught a lesson if it tries to cross the LoC, says the Pakistani military ruler, Gen. Pervez Musharraf."
    }
}