{
    "title": "Events for November 23",
    "events": {
        "1897": "Nirad Chandra Chaudhuri, writer, was born.",
        "1900": "Durga Das, famous social reformer and journalist, was born.",
        "1908": "Sitaram Mahadeo Bapat, teacher and author, was born at Miraj in district Sangli.",
        "1919": "The first Khilafat Conference was held. Maulvi Fazal-ul-Haq in his presidential address emphasized on enlisting the support of non-Muslims. Gandhi announced to join hands with the Muslims.",
        "1926": "Satya Sai Baba, Hindu universalist renaissance charismatic guru, educationalist and worker of miracles, was born.",
        "1933": "Rajan Mehra, cricket test umpire for 2 tests from 1986-87, was born at Delhi.",
        "1937": "Sir Jagdish Chandra Bose, Indian plant physiologist and physicist, passed away due to heart attack. He investigated the properties of very short radio waves, wireless telegraphy and radiation-induced fatigue in inorganic materials. His physiological work involved comparative measurements of the responses of plants exposed to stress. His invention of highly sensitive instruments for the detection of minute responses by living organisms to external stimuli enabled him to anticipate the parallelism between animal and plant tissues noted by later bio-physicists. In 1901, he proved that \"plants and animal have similar touch sense\". He founded Bose Research Institute in Calcutta and authored world famous books \"Response in Living and Non-Living\"(1902) and \"Nervous Merchanism of Plant\"(1926).",
        "1946": "Kailasham Tyagraj Paramshiv, famous Kannada dramatist, passed away.",
        "1948": "The beseiged garrison of Punch was relieved a full year after its siege. This meant that a firm grip had been established all the way from Pathankot on the major portions of this province.",
        "1983": "Commonwealth Heads of Government Meeting (CHOGM), the seventh biennial Commonwealth Summit, meets in New Delhi.",
        "1990": "Madhavrao Ganesh (Balasaheb Dixit), founder of daily news paper \"Turun Bharat\", passed away.",
        "1991": "India decides to upgrade its ties with the Soviet Republics.",
        "1993": "'The Bullshit'', a Turkish film, wins the Golden Elephant award at the 8th International Childrens film festival in Udaipur.",
        "1994": "100 killed in a stampede of Govari Samaj people during a protest march towards Nagpur Assembly.",
        "1997": "Nirad C.Chaudhuri, famous author, completed 100 years of his life.",
        "1999": "Vinod Chandra Pandey takes over as the Governor of Bihar."
    }
}