{
    "title": "Events for December 23",
    "events": {
        "23\tDecember\t1845": "Rasbhihari Ghosh, famous patriot and law expert, was born.",
        "23\tDecember\t1889": "Mehr Chand Mahajan, Chief Justice of Supreme Court of India, was born.",
        "23\tDecember\t1900": "Kalicharan Patnaik, famous Orria dramatist, poet and journalist, was born.",
        "23\tDecember\t1902": "Chaudhary Charan Singh was born at Noopur village in Hapur Tehsil near Meerut. He was a freedom fighter and had done many deeds for upliftment of Agriculture in India. He was the Prime Minister of India from July 1979 to January 1980. His birth jayanti is observers as Kisan Divas.",
        "23\tDecember\t1912": "Rash Behari Ghosh and Sachin Sanyal threw a bomb at Viceroy Lord Hardinge II in Delhi. He had come to Delhi on an elephant for the initiation of the new capital. The Viceroy was injured in the bomb blast.",
        "23\tDecember\t1913": "Gondhavalekar Maharaj, famous saint, died.",
        "23\tDecember\t1919": "King's proclamation was made that the new reforms of Government of India offer some sort of self government.",
        "23\tDecember\t1920": "King George V signs Home Rule Act.",
        "23\tDecember\t1926": "Swami Shradhanand, great revolutionary freedom fighter, social worker and politician, was assassinated by a revolver shot that was fired by a young Muslim Abdul Rashid.",
        "23\tDecember\t1930": "The British governor of Punjab was wounded in an assassination attempt.",
        "23\tDecember\t1944": "U C Joshi, cricketer (Sussex off-spinner 1970-74 from India), was born.",
        "23\tDecember\t1954": "Tito, Nehru reject plan for neutral third bloc, yet insist on peaceful co-existence.",
        "23\tDecember\t1959": "Edward Fredrick Lindlewood Halifax \"Irwin Lord\", English viscount and Governor General of India (1925-1931), died at the age of 78.",
        "23\tDecember\t1964": "India & Ceylon hit by cyclone, about 4,850 killed.",
        "23\tDecember\t1969": "Armstrong and Aldrin collected Moon rock, which was kept on exhibition in New Delhi.",
        "23\tDecember\t1972": "Chandrasekhar takes 8-79 India v England at Delhi.",
        "23\tDecember\t1976": "Indira Gandhi attacks the pro-Moscow Communist party for enticing her son Sanjay, but she denies grooming him as her successor.",
        "23\tDecember\t1977": "Harvinder Singh, great Indian ODI pace-bowler (1997), was born.",
        "23\tDecember\t1983": "Micheal Chopra, Soccer(Football) player, was born in Newcastle, England.",
        "23\tDecember\t1989": "V. C. Pande was appointed as the Cabinet Secretary of India. He held this office till 11-12-1990.",
        "23\tDecember\t1990": "All India BMAC and VHP hand over the historical and archaeological documents to support their claim to Home Ministry officials.",
        "23\tDecember\t1992": "Varma Commission indicts IB, the Centre and Tamil Nadu police for failure to protect Rajiv Gandhi.",
        "23\tDecember\t1993": "PM announces Local Area Development Scheme by which each MP can sanction projects worth Rs.1 crore.",
        "23\tDecember\t1995": "The crew of the seized aircraft in Bombay confess dropping of arms at Purulia.",
        "23\tDecember\t1998": "Jayaprakash Narayan posthumously awarded Bharat Ratna, the country's biggest honour.",
        "23\tDecember\t2000": "The Centre gives a green signal to West Bengal Government's proposal to rename Calcutta as ''Kolkata''."
    }
}