{
    "title": "Events for March 23",
    "events": {
        "1351": "Firuz Shah Tughluq(1351-88), nephew of  Muhammad Tughluq, succeded as emperor of Delhi.",
        "1596": "Chandbibi made treaty with Murad and gave 'Varhad' area to Mughals.",
        "1757": "Lord Clive conquered  Chandranagar after defeating the French troops.",
        "1898": "Nalinibala Devi, Assamia poet, was born.",
        "1910": "Dr. Ram Manohar Hiralal Lohia also known as \"Dauntless Dr. Lohia\", freedom fighter and socialist leader, was born at Akbarpur, district Faizabad, Uttar Pradesh. He had founded Praja Socialist Party in 1952.",
        "1911": "Indranath Bandopadhyay, Bengali comedy writer and journalist, passed away.",
        "1913": "Indian Muslim Conference passes resolution demanding immediate self-government.",
        "1919": "Subhadra Joshi, freedom fighter, was born. She took active participation in Salt and non cooperation movement. She also motivated the freedom movement through her newspaper \"Hamara Sangram\".",
        "1923": "Hemu Kalani, revolutionary freedom fighter, was born at Sukkur, Sind. He was held for removing of fishplates which caused derailment of British Wagon.",
        "1931": "Bhagat Singh, Shivram Rajguru and Sukhdev, great freedom fighters and revolutionaries, were hanged for assasination of Saunders, Assistant Superintendent of Police in the Central Jail at Lahore. Bhagat Singh and his associates showed no signs of any fear as they kissed the noose, chanting \"Inquilab Zindabad\" (long live the revolution).",
        "1940": "All India Muslim League passed resolution for the formation of Muslim homeland i.e. Pakistan.",
        "1942": "Second World War was turning against the British and they needed the help of the Indians. So Prime Minister Churhill sent a delegation under Sir Stafford Cripps (Cripps Mission) to hold talks with the Indian leaders on the future of the subcontient in UK, which could not take place because of the non-cooperation movement and they left after a fortnight. They submitted their report in April 1942 which was rejected by the Congress and Muslim League.",
        "1947": "Lord Mountbatten was sent as a Viceroy to India who was designated to free India.",
        "1962": "Nawab of Pataudi captains Indian cricket team vs WI at the age of  21 years 77 days.",
        "1967": "Pandey Bechain Sharma (Ugra) passed away.",
        "1968": "Atul Satish Wassan, cricketer (Indian pace bowler 1989-90), was born in Delhi.",
        "1982": "Annasaheb Patil, father of Maratha Mahasangh, passed away.",
        "1986": "The first women's company of Central Reserve Police Force camp was raised in Durgapur.",
        "1992": "G. S. Dhillon, former speaker of Lok Sabha, passed away.",
        "1994": "Last day of Test cricket for Kapil Dev.",
        "1995": "Shakti Chattopadhyay, famous poet, passed away.",
        "1997": "10 Dalits killed in Kab village of Bihar by Ranbir Sena, a pro-landlord extremist organisation.",
        "2000": "Udham Singh (72), hockey legend, died at his home town in Sansarpur (near Jalandhar)."
    }
}