{
    "title": "Events for April 23",
    "events": {
        "1504": "Guru Angad, Sikh Guru, was born.",
        "1751": "Gilbert Aliat Minto, governor general of East India Company, was born.",
        "1774": "British Commander Colonel Chapman defeated Rohilla's army and captured Ruhelkhand.",
        "1795": "East India Company gave Warren Hastings a grant of the money and he was honourably acquitted of the charges.",
        "1858": "Pandita Ramabai, social reformer and philosopher, was born in the State of Mysore.",
        "1913": "Dhananjay Vithal Keer, famous biogropher, was born.",
        "1926": "Madhavrao Sapre, great political leader, passed away.",
        "1928": "Narasimha Murtey, educationist, was born at Nandur, A.P.",
        "1929": "The Fate of the Outlaw', a 7-reel film produced by Majestic Film Co. was prohibited by the Board of Censors, Bombay, on April 23 on the grounds that the film glorifieds crime.",
        "1930": "Riots break out in Peshawar; 20 Indians shot down after killing of three Britishers.",
        "1938": "Viceroy Lord Linlithgow opens the hydro-electric scheme at Malakand.",
        "1946": "Commonwealth Occupation Forces in Japan, exchanging its Spitfire Vllls for Mk XlVs in October and arriving in Japan aboard HMS vengence.",
        "1955": "Political Committee of Asian-African Conference at Bandung adopted an Indian resolution calling for a ban on atomic weapons.",
        "1959": "Peking Radio reports say that Chinese troops defeated rebels in south-eastern Tibet and have closed Tibet's borders with India and Burma.",
        "1968": "Bade Gulam Ali Khan, famous ghazal singer, passed away.",
        "1987": "Supreme Court in a judgement confers Hindu widows absolute ownership of property under Hindu Succession Act 1956.",
        "1991": "Major parties agree to have polls in Punjab.",
        "1992": "Satyajit Ray, internationally famous Indian film producer-director, Bharat Ratna Awardee, passed away at the age of 70.",
        "1994": "Ibrahim Sulaiman Sait, former Indian Union Muslim League president, floats a new party - the Indian National League.",
        "2000": "Mumbai regains Ranji Trophy."
    }
}