{
    "title": "Events for May 23",
    "events": {
        "1805": "Lord Wellesley, Governer General of India, issued a permanent provision  for the Delhi Mughal Emperor.",
        "1895": "Shivprasad Sitar-E-Hind passed away.",
        "1903": "Gemini Roy, famous Painter, joined Government School of Arts and Crafts at Calcutta.",
        "1914": "The British India Steamship Co. and the Peninsular and Oriental Steamship Co. announced their amalgamation at London.",
        "1923": "Nirode Ranjan Chowdhury, Indian cricket pace bowler (1949-52), was born in Calcutta.",
        "1924": "Venkatraman Narayan Swamy, cricketer (one Test v NZ in 1955, DNB, 0-45), was born in Calicut.",
        "1931": "Sharad Joshi, famous Hindi poet, playwright and journalist, was born.",
        "1942": "Lt Gen Joseph Stilwell and his men arrive at Dimapur, having retreated 150 miles (240 km) through the Burmese jungle. `We took a hell of a beating,' he said.",
        "1947": "The U.K. Cabinet today took the historic step of agreeing to Lord Mountbatten's proposal for the partition of India into two states, one Muslim and the other Hindu. The Viceroy is to have a series of talks with Lord Listowel, the Secretary for India.",
        "1965": "Venkat Woorkeri Raman, cricketer (Indian slow left-arm all-rounder), was born.",
        "1967": "South Gujrat University was established.",
        "1975": "P. S. Bapat, victoria cross winner Lieutenant General, passed away.",
        "1984": "Bachendri Pal, an employee of Tata Iron and Steel Co. Limited at Jamshedpur, conquers the summit of Mount Everest to become the first Indian woman and the fifth women in the world to achieve this feat.",
        "1990": "Banarasi Das Gupta elected CM of Haryana following Om Prakash Chautala's resignation.",
        "1993": "Channa Reddy,Rajasthan Governor, shifted to Tamil Nadu. Motilal Vohra appointed in UP and B. Satyanarayan Reddy moved to Orissa.",
        "1995": "TADA expires and new Anti-Terrorists Activities Law proposed. Criminal Law Amendment Bill, 1995, voting put off;  Lok Sabha passes Finance Bill 1995.",
        "1996": "1995-96 deficit touches a new high at Rs.19,855 crore.",
        "1997": "The body of controversial former chief of Tarn Taran district police Ajit Singh Sandhu  is recovered from rail tracks near Bhakharpur About 30 km from Chandigarh.",
        "1998": "L. K. Advani, Home Minister, is to look after J&K affairs."
    }
}