{
    "title": "Events for June 23",
    "events": {
        "1661": "Princess Catherine of Portugal wed King of England Charles II. Portugal gave island of Mumbai to England as present. The British got Bombay as dowry from Portugal.",
        "1757": "The Battle of Plassey started between Robert Clive, incharge of British army, and Nawab of Bengal, Siraj -Ud -Daula. In this battle Robert Clive won control of Bengal.",
        "1761": "Balaji Bajirao (Nanasaheb), third peshwa, died at Pune, after losing in the Third Battle of Panipat on 12 June.",
        "1810": "Duncan Dock of Bombay was completed.",
        "1894": "Edward VIII, king of Great Brit/N-Ireland and emperor of India (1936), was born.",
        "1895": "Kali Charan Ghosh, great Hindi writer, was born at Calcutta.",
        "1911": "King George V was today crowned \"King of the United Kingdom of Great Britain and Ireland and of the British Dominions beyond the seas, Defender of the Faith, Emperor of India,\" at Westminster Abbey in a ceremony evoking the continuity and tradition of the British monarchy magnificent spectacle. Thousands of spectators crowded the streets for hours, hoping to catch a glimpse of the royal procession. Partition of Bengal notified to create the Presidency of Bengal. The Imperial capital shifted from Calcutta to Delhi.",
        "1920": "Kesri Jagannathrao Joshi, senior leader of Janata Party in Karnataka, was born.",
        "1927": "All India Radio's broadcasting service started in 1927 by privately owned transmitter at Bombay and Calcutta.",
        "1930": "The Simon Commission recommends a federal India and the separation of Burma at London.",
        "1935": "Ram Kolarkar, famous marathi author and editor, was born.",
        "1942": "Jabbar Patel, film producer, was born.",
        "1946": "Gandhiji advises Congress not to enter Interim Government, but only Constituent Assembly.",
        "1953": "Dr. Shyama Prasad Mukherjee, great social reformer, politician, national leader and founder of JanSangh Party, died at Srinagar while in detention.",
        "1958": "Tamil leaders in Madras call on Nehru to lobby for better treatment of Ceylon's Tamil minority.",
        "1971": "Sriprakash, freedom fighter, prolific writer and member of the AICC, passed away.",
        "1975": "Prannath Thapar, former Chief of Army, died.",
        "1980": "Sanjay Gandhi, great Indian politician and younger son of Indira Gandhi, died in a plane crash. He was recently appointed as the General Secretary of the AICC (I).",
        "1984": "An Air-India jumbo jet plunged into the Atlantic Ocean near Ireland today, killing all 329 people on board. Indian officials said the crash apparently was caused by a bomb placed aboard the jetliner by a Sikh extremist group as retaliation for an army raid.",
        "1985": "Air India Jumbo Jet Boeing 747 'Kanishka' which was travelling to Mumbai from Montreal crashed into the Atlantic Ocean after explosion near Ireland.  329 people on board died.",
        "1987": "D. Chakraborty was appointed as the Narcotics Commissioner of India. He headed this office till 02-07-1991.",
        "1990": "Harindranath Chatopadhyay,  famous poet, actor and former member of Parliament, passed away.",
        "1992": "Tin Bigha Day protest in India of corridor opening to Bangladesh.",
        "1993": "RBI cuts minimum lending rate by 1\\%.",
        "1994": "Two Britishers held hostage by terrorists in Kashmir for 17 days were set free.",
        "1997": "Acharya Tulsi, the founder of Terapanthi sector in Jainism, died. (20-10-98).",
        "2000": "Indian journalist Palagummi Sainath gets Amnesty International Global award for human rights journalism.."
    }
}