{
    "title": "Events for July 23",
    "events": {
        "1555": "Humayun reconquered Delhi after defeating Sher - Shar Alias Sikandar Suri in Machiwara and Sarhind battles. It is said that he won the crown but not the empire.",
        "1856": "Lokmanya Bal Gangadhar Tilak, scholar, mathematician, philosopher, militant nationalist Indian leader and who helped lay the foundation for India's independence, was born at Ratnagiri in Maharashtra.",
        "1898": "Tarashankar Bandopadhyay, well known Bangla novelist, was born.",
        "1904": "The Great Indian Peninsula Railway started First Class restaurant cars on its mail trains.",
        "1906": "Chandrashekhar Azad, great freedom revolutionery and leader, was born at Jhabra, Madhya Pradesh.",
        "1912": "Kilachand Ambalal, great industrialist, was born.",
        "1918": "Saraswati Devi (Smt) Illindala, great Hindi writer, journalist and social worker, was born at Narsapur, Andhra Pradesh.",
        "1923": "Navinchandra Chimanlal Pandya, great educationist, was born at Prantij, Ahmedabad.",
        "1927": "Daily radio transmission broadcasting in India started by Bombay Radio Station. This was the first Commercial Radio Station.",
        "1933": "Jatindra Mohan Sengupta, great leader, lawyer, social worker, freedom fighter, nationalist and president of Bengal Swaraj Party, died at Ranchi. He was addresed by the people of Bengal as 'Deshapriya' (Beloved of the Country).",
        "1956": "India celebrates the birth centenary of Bal Gangadhar \"Lokmanya\" Tilak.",
        "1964": "Samrendranath Roy, great statistician, passed away.",
        "1976": "Hari Chand at Montreal sets record for 10,000m in 28.48.72.",
        "1988": "Jahangir Khan, cricketer (4 Tests for India 1932-36), died.",
        "1990": "Vishwanath Pratap Singh, Indian Prime Minister and Gorbachev sign joint declaration committing their countries to building a nuclear-free and non-violent world in the first Indian-Soviet summit in the post-Gorbachev Soviet Union in Moscow.",
        "1991": "Premdatt Paliwal, president of All India Forward Block, died.",
        "1993": "Indian National Satellite (INSAT-2B), second satellite in the INSAT-2 series, was launched. This is more operational multi-purpose communication and enhanced meteorology satellite. It is still in service. It was aunched by European Ariane launch vehicle.",
        "1996": "R. Bhattacharji was appointed as the Narcotics Commissioner of India. He is heading this office till date.",
        "1997": "India decides to sign U.N. Convention against torture and other cruel, inhuman or degrading treatment or punishment.",
        "2000": "Ram Jethmalani, Union Law Minister, quits the Cabinet after the Prime Minister shows him the door following the outbursts against the Chief Justice of India, Dr. A. S. Anand."
    }
}