{
    "title": "Events for September 23",
    "events": {
        "1743": "Sawai Jaising died.",
        "1803": "British-Indian forces defeated the Marathas in the Battle of Assaye.",
        "1858": "Grant Duf, historian who studied Maratha history, died.",
        "1862": "Sriniwas Shastri, great patriot and veteran politician, was born.",
        "1863": "Rao Tularam Singh Yadav, freedom fighter, was one of the key leaders of the Indian rebellion of 1857, in Haryana, where he is considered a state hero.",
        "1903": "Yusuf Meherali, freedom fighter and socialist, was born.",
        "1906": "Kumar (Mijjan) alias Syed Hasan Ali, film actor, was born in Lucknow, Uttar Pradesh. He has worked in 'Shadows of the Dead', 'Dukhiari', 'Gambler', 'Patan ni Paniari', 'Thoure of Delhi'.",
        "1908": "Ramdhari Singh Dinkar, famous Hindi poet, was born.",
        "1911": "Rappal Sangmeshwar Krishnan, noted physics expert of India, was born.",
        "1952": "Anshuman Dattajirao Gaekwad, batsman in 40 Tests (1974-85), was born in Bombay.",
        "1965": "The Indian Army secured the Kashmir Valley and the only object left was to clean out the remnants of the Gibraltar Force. Under the guidance of United Nations, the cease-fire came into effect.",
        "1967": "P. S. Vaidya, great Indian ODI pace bowler (1995-96), was born.",
        "1974": "First NCC Airforce Squadran (Women) was established at Vanasthali Vidyapeeth, Rajasthan.",
        "1980": "Indira Gandhi gains power to imprison without trial.",
        "1983": "Supreme Court upholds execution of criminals through hanging by rope.",
        "1990": "World Bank clears Rs.1,200 crore aid for Sarovar Dam rejecting objections raised by environmental groups.",
        "1992": "Indian-designed pilotless target aircraft 'Lakshya' successfully tested.",
        "1996": "Sitaram Kesri elected provisional president of Congress (I).",
        "1997": "India win Sahara Cup Cricket series by 4-1 victory over Pakistan.",
        "1999": "India rejects Pakistan's proposal for an international conference on arms control."
    }
}