{
    "title": "Events for October 24",
    "events": {
        "1505": "Don Francis-Di-Almeda of Portugal arrived at Cochin as Viceroy of India.",
        "1579": "Jesuit father and first Englishman S.J.Thomas Stephens arrived at Goa in a Portuguese ship. He settled here and died in 1619.",
        "1605": "Jahangir became the fourth Emperor of Mughal Empire at Agra.",
        "1657": "Kalyan and Bhiwandi came under the rule of Chhatrapati Shivaji Maharaj.",
        "1789": "Jean C Baud, Governor General of Dutch-Indies (1834-6), was born.",
        "1827": "Viceroy Lord Rippan (1880-1884) was born.",
        "1851": "First official telegraph line was opened between Calcutta and Daimond Harbour spanning 33.8 km.",
        "1856": "Veer Narayan Singh, freedom fighter, was arrested by the British Government at Sambalpur for distributing grains from the warehouse to the people. He was sent to jail at Raipur.",
        "1868": "Balasaheb Pantpratinidhi, king of Aundh and painter, was born.",
        "1890": "Shishirkumar Mitra, Physics expert, was born  in Calcutta.",
        "1904": "Lalchand Hirachand, famous industialist, was born.",
        "1930": "Raj Bagri, Indies and British merchant in metal, was born.",
        "1933": "Govindjee, famous scientist, was born in Allahabad, U.P. He found cutting plant sections easier than dissection of animals.",
        "1934": "Arvindrao Laxmanrao Apte, cricketer (brother of Madhav scored 8 & 7 runs in one Test), was born in Bombay.",
        "1938": "Farooq Rehmany Mohammad, journalist, social reformer and political worker, was born at Bandipur.",
        "1945": "UNO Day.",
        "1953": "Selection of the Dassault Ouragan fighter from France at this time reflected the decision to initiate diversification of supply sources. The first four of over 100 Ouragans, or 'Toofanis' as they were to become known in the IAF, reached Palam Airport from France and this type re-equipped Nos.8, 3 and 4 Squadrons in that order.",
        "1954": "Rafi Ahmad Kidwai, Congress leader, died.",
        "1955": "Ghulam Ahmad Hasan Muhammad Parkar, cricketer (Indian batsman vs England 1982), was born in Kalusta, Maharashtra.",
        "1966": "Yugoslavia, UAR call on the US at New Delhi to stop bombing of North Vietnam.",
        "1975": "Bounded labour system was abolished by Ordinance.",
        "1984": "First Metro Train (Underground Train) in India started between Esplanade and Bhowanipore in Calcutta city.",
        "1990": "BJP-sponsored 'Bharat Bandh' in protest against L. K. Advani's arrest evokeed mixed response.",
        "1991": "Ismat Chugtai, famous Urdu author, social worker and campaigner for justice for women, died at the age of 80 years.",
        "1992": "Narmada, World Bank sets time to correct defects.",
        "1994": "The Supreme Court refused to answer Presidential reference on Ayodhya and acquisition of disputed land was upheld.",
        "1995": "Total solar eclipse seen over Rajasthan, UP, Bihar and West Bengal, while partial eclipse seen in the rest of the country.",
        "1997": "Kerala bans ragging in educational institutions by an ordinance.",
        "2000": "Sitaram Kesri (81), former Congress President, died at the AIIMS in New Delhi."
    }
}