{
    "title": "Events for November 24",
    "events": {
        "1881": "Ram Rachhpal, son of Sukhi Ram, called 'Chhotu', freedom fighter, politician and leader,  was born in a 'Jat' famlily in a small village Garhi Sampla in Rohpak district. His life was a saga of sincere and ceaseless striving to improve the condition of the poor peasants in India, popularly known as 'Deenbandhu'.",
        "1899": "Pandit Hiralal Shastri, great social worker, leader and first chief minister of Rajasthan state, was born at Jobner, Jaipur District.",
        "1919": "Gandhiji presides over All-India Khilafat conference at Delhi.",
        "1924": "Rasipuram Krishnaswami Laxman, famous political cartoonist, was born.",
        "1926": "Aurobindo Ghose, former I.C.S. and revolutionary, attained full enlightenment I.e 'Purna Siddhi'.",
        "1930": "Chandrakant Trimbak Patankar, cricketer ( wicket keeper in one Test India vs NZ 1955-56), was born in Pen, Maharashtra.",
        "1932": "The Third Round Table Conference ended in London. As Gandhi was in prison because of his civil disobedience movement he could not attend it. This conference ended without achieving anything.",
        "1941": "Indian infantry attacks German tanks at Sidi Omar.",
        "1948": "Ashok Gandotra, cricketer (Two Tests for India 1969), was born in Rio de Janeiro, Brazil.",
        "1952": "Brijesh Parsuram Patel, cricketer (Indian batsman 1974-77), was born in Baroda.",
        "1963": "Marotrao Kannamwar, former Chief Minister of Maharashtra, passed away.",
        "1969": "Guru Nanak University established at Amritsar, Punjab.",
        "1973": "E. V. Ramasami Naicker (EVR), founder leader of Dravida Kazhagam, passed away at the age of 94.",
        "1988": "Mizoram became the first Lok Sabha member.",
        "1989": "Tendulkar scores a record cricket test 50 aged 16 years 214 days.",
        "1991": "Bihar's ruling JD makes a clean sweep of all the three Lok Sabha seats in the by-elections.",
        "1992": "Milan Kumar Banerjee appointed Attorney General.",
        "1997": "Leander-Mahesh stumble at the final step, finish second in the World doubles tennis championships at Hartford.",
        "1998": "Polling is held in 626 assembly constituencies spread over four States - Delhi, Madhya Prades, Mizoram and Rajasthan.",
        "1999": "The dedication ceremony of Shanmukhananda Hall is put off."
    }
}