{
    "title": "Events for December 24",
    "events": {
        "1524": "Vasco De Gama, Portuguese navigator who discovered India, died in Cochin.",
        "1762": "Gopalrao defeated in the battle of Jamkhindi.",
        "1809": "Christopher \"Kit\" Carson, KY, union brig-general and Indian fighter, was born.",
        "1880": "Pattabhi Sitaramayya, politician and president of Indian National Congress, was born in Andhra Pradesh.",
        "1891": "Chandra Singh Garhwali, freedom fighter and revolutionary, was born in Masson, Patti Chauthan, Tehsil Thalisain, District Garhwal.",
        "1894": "The first medical conference was held in Calcutta.",
        "1902": "Shashi Mukhi of Classic Theatre, Calcutta, was the first Indian to record on gramophone. This song was on 25 cms. one sided disc and the lyrics were \"Kanha Jeevan Dhan\" from the play Shri Krishna. The song was recorded by Gramophome and Typewriter Company.",
        "1905": "Sen Triguna, educationist and technologist, was born.",
        "1921": "Rabindranath Tagore established \"Visva Bharati\" at Santiniketan with Brojendra Nath Seal as the chief guest.",
        "1924": "Mohammed Rafi, famous playback singer, was born.",
        "1932": "The third and last Round Table conference on India ends. It was was held in London.",
        "1972": "Daily newspaper \"Janshakti\" published it's first edition at Jalgaon.",
        "1973": "E.V.Ramasami, founder of DMK party, prominent leader, great social worker and revolutionary freedom fighter, died at the age of 94.",
        "1984": "Eigth General Elections of India began .",
        "1986": "Consumer Rights Act was passed.",
        "1987": "Dr. M.G.Ramachandran, former Chief Minister of Tamil Nadu, died. He was 70 yrs. He was posthumously awarded the 'Bharat Ratna' by the President of India. (17-1-90).",
        "1988": "Jaynendra Kumar, famous Hindi novelist, died.",
        "1993": "Khanprabha Bhaduri, famous Bengali poet and writer, died.",
        "1997": "Congress(I) splits in Bihar with Dr. Jagannath Mishra and Ram Lakhan Singh Yadav floating iits regional outfit, \"Bihar Jan Congress\".",
        "1998": "A.B.Vajpayee, Prime Minister, announces increased cash awards for Asian Games medallists.",
        "1999": "Koneru Humpy won the under-12 boys' title and P. Harikrishna won the Under-14 boys' title at the Asian Youth Chess Championship in Ahmedabad.",
        "2000": "Viswanathan Anand becomes the first Asian to win a world chess title in the world chess championship in Taheran."
    }
}