{
    "title": "Events for January 24",
    "events": {
        "1556": "Humayun died at Delhi. Two days earlier he had slipped on the staircase of a library being constructed at the Old Fort.",
        "1826": "Gnanendra Mohan Tagore, first Indian barrister, was born in Calcutta.",
        "1857": "Calcutta University established.",
        "1870": "Muddan, famous Kannad poet and novelist, was born.",
        "1921": "T. N. Raina, former Army Chief and High Commissioner of Canada, was born.",
        "1924": "Karpoori Thakur \"Jan Nayak\", freedom fighter, teacher and national president of Samyukta Socialist Party, was born in village Samastipur, District Bihar.",
        "1937": "Gandhi announces that he will retire from politics.",
        "1948": "Australia all out 674 vs India (Bradman 201, Hassett 198*).",
        "1950": "Dr. Rajendra Prasad was elected to become the first President of India and 'Jana Gana Mana....' was accepted as the National Anthem of the country.",
        "1951": "Nehru assails US. demand for UN to name Peking as aggressor in Korea, New Delhi.",
        "1952": "The first International Film Festival of India held in Bombay, this event had a great impact on Indian Cinema.",
        "1957": "Kagaz Ke Phool, the first Indian black and white cinemascope film, was made.",
        "1958": "First international Film Festival started in Mumbai.",
        "1966": "Dr. Homi Jahangir Bhabha, chairmain of Atomic Research Institute, passed away near Geneva when Air India Boeing 707 crashed in accident at Alps Hills, Mont Blanc in Switzerland killing all the 117 persons on board.",
        "1976": "Burmah Shell, a private oil company, was nationalised and renamed as Bharat Refineries.",
        "1980": "J.S. Bawa became the director of Central Bureau of Investigation (till 28/02/85).",
        "1994": "Singapore PM Goh Chok Tong arrives in New Delhi on a state visit.",
        "1995": "Congress (I) suspends Arjun Singh from the party.",
        "1996": "H.K.L. Bhagat, senior Congress politician and former minister, arrested in connection with a 1984 anti-Sikh riot case.",
        "1997": "Justice Meera Sahib Fathima Beevi and Justice Sukhdev Singh Kang appointed Governors of Tamil Nadu and Kerala respectively.",
        "1999": "The Orissa police arrest 47 persons in connection with the killing of the Australian missionary.",
        "2000": "Supreme Court imposes, with immediate effect, a ban on industries in Delhi and Haryana from discharging untreated industrial effluents into the Yamuna."
    }
}