{
    "title": "Events for February 24",
    "events": {
        "1483": "Sheikh Mirza, chieftain of a small state of Ferghana, was born in Turkmenistan.",
        "1674": "Prataprao Gujar, a great Maratha warrior at the time of Chhatrapati Shivaji Maharaj, died.",
        "1786": "Charles Cornwallis appointed Governor-General of India.",
        "1867": "Kedarnath Das, geat physiologist, was born.",
        "1880": "Satyanarayan, great poet of Kannada language, was born.",
        "1899": "Maheshchandra Burjorjee Bilimoria, film distributor, was born.",
        "1922": "Kanwar Rai Singh, cricketer (batted at MCG Test for India 1948), was born in Darkati, Punjab.",
        "1924": "Mahatma Gandhi released from jail.",
        "1936": "Laxmibai Tilak, famous marathi poet, passed away.",
        "1946": "Mrs. Kashibai and Mrs. Babbai Lakshman, freedom fighters, were shot dead by the police.",
        "1948": "The State of Junagarh, whose accession to India was protested by Pakistan in the UN Security Council, voted in favour of India in a popular referendum held on 20 February.",
        "1950": "G.J.M.Gazdar, computational linguist, was born.",
        "1957": "General Election ( 2nd) of India begins.",
        "1961": "Government of Madras province was renamed as Tamil Nadu.",
        "1986": "Rukmini Devi passed away.",
        "1988": "Prithvi, India's first Indigenously designed surface-to-surface tactical missile of 250km, was successfully test fired from Sriharikota. India becomes the fifth country to develop such a missile.",
        "1994": "Sharp increase in freight rates in the 1994-95 Railway budget;  Pre-budget Economic Survey puts GDP growth in 1993-94 at 3.8\\%.",
        "1995": "Rishang Keishing (Cong-I) sworn in as the 15th CM of Manipur.",
        "1996": "S. Korean President Kim Young Sam visits India.",
        "1997": "Charles Shobhaj, the notorious murder suspect, to be deported to France after 20 years in Tihar jail.",
        "2000": "The Subrahmanyam Committee report tabled in the Lok Sabha. The panel concluded that the Pakistan intrusion in Kargil took the Indian security establishment by surprise."
    }
}