{
    "title": "Events for March 24",
    "events": {
        "1307": "Malik Kafur, Alauddin Khilji's Commander, won the impregnable fort of Devgiri. The fort was entered by the enemy. Raja Ramdeva was taken prisoner and sent to Delhi where Alauddin recieved him untill his death in 1312.",
        "1855": "First long distance telegram message was opened between Agra and Calcutta at a distance of 1,300 km.",
        "1896": "Thiripad V. T. Bhatt, author and journalist, was born.",
        "1902": "Anusilan Samiti, a revolutionary organisation, was formed in Bengal.",
        "1924": "Virendrakumar Bhattacharya, Gyanpeeth award winner and Assamia novelist, was born.",
        "1944": "Manmohan Singh, famous economist and Finance Minister of India, was born.",
        "1946": "British Cabinet Mission came to India presided by Lord Pethick Lawrence.",
        "1947": "Lord Louis Mountbatten came to India.",
        "1968": "The second Indian-made rocket 'Menaka' successfully launched at the Thumba station.",
        "1974": "Lokprabha weekly started its publication.",
        "1977": "Morarji Desai elected leader of Janata Party and sworn in as the Prime Minister of India at New Delhi. Later he formed his cabinet. He was in the office of Prime Minister till July 28, 1979. This was first non-Congress Government in India.",
        "1981": "Bombay beat Delhi by an innings and 46 runs to win the Ranji Trophy.",
        "1984": "Dilraj Singh, Soccer(Football) player, was born in Vancouver, Canada.",
        "1987": "First developmental launch of new generation rocket ASLV 'Stretched Rohini Satellite Series' (SROSS-1). This carried payload for launch vehicle performance monitoring and for gamma ray astronomy. This plunged within two minutes and 40 seconds of its launching.",
        "1990": "Indian Peace Keeping Force (IPKF) was withdrawn in toto from the northern and eastern provinces of Sri Lanka.",
        "1991": "Bhau Samarth, internationaly famed painter, passed away.",
        "1992": "Congress (I) strength goes up by six seats in the Rajya Sabha on account of biennial polls.",
        "1993": "Six of Memon family escape to Karachi.",
        "1995": "Devchand Somaiyya, famous Table Tennis player, passed away.",
        "1998": "200 people are killed in a tornado on both sides of the West Bengal-Orissa border. The toll includes 80 from West Bengal's Midnapore district.",
        "2000": "Rupali Repale of India becomes the first woman and the youngest to swim the Robben Island channel-both ways."
    }
}