{
    "title": "Events for April 24",
    "events": {
        "1311": "General Malik Kafur returns to Delhi after campaign in South India.",
        "1888": "Bishnu Ram Medhi, chief minister of Assam and Governor of Madras, was born at Hajo.",
        "1918": "Durgaprasad Dhar, former Vice President of Planning Commission, was born.",
        "1929": "First non-stop flight from England to India takes-off.",
        "1932": "450 people seized by British for defying ban on Indian National Congress.",
        "1942": "Shri Dinanath Mangeshkar, famous Marathi singer, nationalist, musician and actor, passed away at the age of 41.",
        "1944": "Shivprasad Gupta, philanthropist, freedom fighter and educationist, passed away.",
        "1959": "Nehru meets the exiled Dalai Lama in Mussoorie.",
        "1965": "Kosi Barrage inaugurated by King Mahendra of Nepal.",
        "1966": "Margashayam Venkataramana, cricketer (Indian off-spinner 1989), was born in Secunderabad.",
        "1972": "Jamini Roy, Padmabhushan awardee and famous painter, passed away.",
        "1973": "Sachin Ramesh Tendulkar, cricketer (prodigy at 16, Indian capt at 23), was born in Bombay.",
        "1974": "Ramdhari Singh alias 'Dinkar', veteran famous Hindi writer and poet, passed away.",
        "1980": "Baba Gurbachan Singh, Nirankari chief, assassinated. His son named as the new chief.",
        "1993": "IA's Delhi-Srinagar Boeing with 141 persons, hijacked by a Kashmiri militant lands, in Amritsar.",
        "1994": "S. L. Kirloskar, 91, industrial magnate, passed away in Pune.",
        "1995": "K. Karunakaran elected to Rajya Sabha.",
        "1996": "SC holds that bank managers acting beyond their authority in allowing overdrafts and passing cheques would be amounted to committing misconduct.",
        "1998": "24 persons are killed and 28 injured when some bogies of a goods train break free and roll back to collide with the stationary Manmad-Kacheguda Express at Parli Vaijnath in Maharashtra."
    }
}