{
    "title": "Events for June 24",
    "events": {
        "1763": "Murshidabad was captured by the East India Company under Major Adams for the second time, and Mir Jaffar was declared the King.",
        "1869": "Hari Chapekar Damodar was born virtually. He was the first terrorist of India.",
        "1885": "Tara Singh, freedom fighter and leader of Akali Dal Master, was born in the village Haryal, District Rawalpindi.",
        "1897": "Padmashree Pandit Omkarnath Thakur, famous music director of Gwalior Gharana, was born at Gujrat.",
        "1901": "John Thottam (Sir Marry Benigna C.D.) Marry, great poetess and teacher, was born in Elangi village at Kerala.",
        "1908": "Gopinath, famous Kathakali dancer, was born.",
        "1928": "Mrinal Keshav Gore, leader in Maharashtra, was born.",
        "1946": "Congress party rejects British plan for provisional govt. pending constitution in New Delhi.",
        "1961": "Indian Manufactured Supersonic fighter HF24 flew took to air for the first time.",
        "1966": "Atul Chandrakant Bedade, cricketer (Indian ODI batsman from 1994), was born in Bombay.",
        "1969": "Ted Hecht, actor (Time to Kill, Song of India, Gangster), passed away.",
        "1974": "India all out for 42 in Lord's Test cricket in 77 mins.",
        "1980": "Varahagiri Venkata Giri, former president of India, died at Madras.",
        "1986": "Government announced  that unmarried mothers under its employment would also get maternity leave.",
        "1989": "A majority of opposition members in the Lok Sabha resign on the issue of CAG report on the Bofors gun deal.",
        "1990": "President R. Venkataraman issues notification formally constituting an Inter-State Council.",
        "1991": "Two LIC officers burnt to death in Kashmir.",
        "1993": "Nanchil K. Manoharan, former DMK Finance Minister, expelled from the party.",
        "1996": "Cong(I) enters into an electoral alliance with Bahujan Samaj Party for forthcoming Assembly election in UP."
    }
}