{
    "title": "Events for August 24",
    "events": {
        "1600": "East India Company's first ship 'HECTOR' reached at Surat Port.",
        "1608": "The first English convoy lands at Surat.",
        "1689": "Calcutta city was established.",
        "1690": "This date is celebrated as Calcutta day, as Job Charnock came to Calcutta and settled here.",
        "1833": "Narmadashankar Lalshankar Dave 'Narmad', versatile author in Gujarati and social reformer, was born.",
        "1888": "Balasaheb Gangadhar Kher, Congress leader in Maharashtra and former Chief Minister of Mumbai, was born at Ratnagiri.",
        "1889": "K. Kelappan, freedom fighter, social reformer, revolutionary, educationist and journalist, was born in Calicut village in district Kerala.",
        "1908": "Shivaram Hari Rajguru (1908 – 23 March 1931) was an Indian revolutionary was born in Khed. He is known mainly for his involvement in the assassination of a British Raj police officer at Lahore and was also member of the Hindustan Socialist Republican Association, who wanted India to be free from British rule by any means necessary.  He was hanged by the British government along with Bhagat Singh and Sukhdev Thapar.",
        "1911": "Veena Das, revolutionery freedom fighter, was born at Krishna Nagar, Calcutta. She fought in protest of Simon Commission and also during the 1930's \"Chatgang Ammunition\". She took part in the assassination of Governor Stainley Jackson.",
        "1916": "Adinath Lahiri, famous geologist, was born.",
        "1925": "Ramkrishna Gopal Bhandarkar passed away.",
        "1946": "Pandit Jawaharlal Nehru was appointed head of India's interim government. He was picked as Vice President of India's Executive Council by Lord Wavell who was British Viceroy of India. Nehru had conducted a campaign of non-violent resistance against British rule.",
        "1947": "Around ten thousand people were believed to have died in border clashes in Punjab.",
        "1952": "Merger of Socialist Party and Krishak Mazdoor Praja Party announced.",
        "1959": "England win 5-0 series against India.",
        "1966": "Mihir Sen swims the Gibralter channel.",
        "1968": "Radhakamal Mukerjee, famous Indian economist, died.",
        "1969": "Varahagiri Venkata Giri (1884-1980), became the fourth President of India. He held this office till August 24, 1974. G. S. Pathak took oath as Vice President of India.",
        "1971": "Crowds invade the pitch as India beat England by four wickets for their first-ever cricket victory in London .",
        "1972": "Namakkal Kavignar, Gandhian poet and painter, passed away.",
        "1974": "Varahagiri Venkata Giri (1884-1980) retired from the post of  President.",
        "1993": "Dinkar Balwant Devdhar, veteran cricketer and non-Test batsman of the 30s, died at the age of 101. He was the instructor of Sachin Tendulkar and Vinod Kambli.",
        "1997": "Union Government decides to eliminate the category of  'superfine' variety of rice for procurement.",
        "1998": "Leander Paes was ranked 73 in single's ranking in tennis. This was his highest single ranking.",
        "2000": "The Calcutta Municipal Corporation celebrated the 310th birth anniversary of the city. A  web portal on Calcutta was also launched on this occasion."
    }
}