{
    "title": "Events for September 24",
    "events": {
        "1629": "Jacques Specx appointed Governor General of Dutch-Indies.",
        "1674": "Chhatrapati Shivaji Maharaj was second time crowned by 'Tantrik Paddhati'.",
        "1726": "King George empowered the company to establish Municipal Corporation and Mayor s Courts in Bombay and Calcutta.",
        "1777": "Sarfoji Bhosle, king of Tanjawar, was born.",
        "1815": "John Sevier, Indian fighter (Gov/Rep-Tn), died at the age of 70.",
        "1829": "Anandram Dhekial Fukan, father of modern Assamia poetry and essay writer, was born.",
        "1856": "Henry, first Viscount Hardinge of Lahore and Governor General of India, passed away.",
        "1859": "Nana Saheb, alias Dhundu Pant, one of the top leaders of Sepoy Mutiny, passed away in Nepal.",
        "1861": "Madame Bhikaji Rustom Cama, mother of the Indian Revolution, was born in Bombay. From an early age she took interest in social and political work.",
        "1873": "Mahatma Jyotirao Phule established the 'Satyashodhak Samaj'.",
        "1914": "Janardan Swami was born.",
        "1921": "Dr. Sakharam Gangadhar Malshe, researcher and critic, was born.",
        "1922": "Jugal Mondal, social worker and politician, was born at Howrah.",
        "1931": "19 people were killed by police during the anti-Hindu rioting in Kashmir.",
        "1932": "Preetilata Waddedara, the first armed woman revolutionary, was hanged for \"Chatgaon Ammunitions Plot\".",
        "1934": "Arvind Laxman Apte, right-hand batsman, was born in Mumbai.",
        "1936": "It was reported that in the past two weeks over 2 million of India's depressed classes had renounced Hinduism in favor of Christianity.",
        "1938": "Piloo Dara Reporter, cricket test umpire for 10 tests from 1984-87, was born in Mumbai. He was the first ever test umpire to be invited in a foreign country along with V. K. Ramaswamy also of India.",
        "1947": "Pakistani raiders invade Kashmir.",
        "1992": "Union Labour Minister announces a new export-oriented emigration policy in place of the regulatory one.",
        "1994": "At least 100 people die after an outbreak of pneumonic plague in the western city of Surat.",
        "1995": "Kanpur University renamed as Chhatrapati Shahu University.",
        "1997": "I. K. Gujral, Prime Minister, formally stated India's claim to permanent membership of Security Council at the U.N. General Assembly meeting.",
        "1998": "In his address to the UN General Assembly, PM Vajpayee said that India wouldl not come in the way of implementing CTBT and may sign it conditionally by September 1999.",
        "1999": "India's Krishnan Sasikiran and China's Wang Yu bagged the boys' and girl's titles respectively in the Asian Junior Chess championship in Vung Tau City, Vietnam."
    }
}