{
    "title": "Events for November 25",
    "events": {
        "25\tNovember\t1538": "Turkish Armada retired.The arrival of a new Portuguese fleet.",
        "25\tNovember\t1866": "Allahabad court was established for Uttar Pradesh territory, it sat in Agra with five Judges between 1866 and 1868. It also has a bench in Lucknow.",
        "25\tNovember\t1879": "Sri Thanwardas Lilaram Vaswani, professor, saint poet, great orator and prolific writer, was born in Hyderabad, Sindh (now in Pakistan). He was the founder of Mira Movement.",
        "25\tNovember\t1890": "Radheshyam, famous stage, film actor and director, was born.",
        "25\tNovember\t1948": "National Cadet Corps was first established.",
        "25\tNovember\t1956": "Lal Bahadur Shastri, Railway Minister, resigns from the office or Railway Minitery, taking moral responsibility for Ayyapan rail disaster thus setting a rare example for politicians.",
        "25\tNovember\t1962": "Dasganu (Ganesh Dattatreya Sahastrabuddhe), modern Marathi saint and poet, passed away.",
        "25\tNovember\t1975": "Chandulal Shah, film maker, passed away.",
        "25\tNovember\t1977": "John Lobo became the Director of Central Bureau of Investigation (till 30/06/79).",
        "25\tNovember\t1984": "Yashwantrao B. Chavhan, first Chief Minister of Maharashtra and former Deputy Prime Minister, passed away.",
        "25\tNovember\t1987": "India all out for 75 vs West Indies at Delhi. Patterson took 5-24.",
        "25\tNovember\t1990": "Sri Lanka all out at 82, Venkatapathy Raju (I) 6-12 off 17.5 overs.",
        "25\tNovember\t1992": "Mamata Banerjee, Union Minister of State for Sports, resigns to fight Bengal CPM.",
        "25\tNovember\t1993": "National Institute of Nutrition, Hyderabad, celebrated its platinum jubilee in 1993 by organizing several scientific activities throughout the year, culminating in the International Symposium on Nutrition during November 25-27, 1993.",
        "25\tNovember\t1995": "The four-states of Gujarat, Goa, Maharashtra and Madhya Pradesh proposes trade bloc for western States (Western Regional Cooperation).",
        "25\tNovember\t1997": "Election Commission de-recognises Janata Party and Congress (Tiwari) as national parties and de-recognises Pattali Makkal Katchi in Tamil Nadu, J & K  Panthers Party and J & K People's Conference in Jammu and Kashmir, Indian Congress (Socialist) in Kerala and Manipur and Marumalarchi Dravida Munnetra Kazhagam in Tamil Nadu. Pattali Makkal Katchi will continue to be recognised as State party in Pondicherry.",
        "25\tNovember\t1998": "Nitish Kumar, Railway Minister, lays the foundation stone for the Chengalpattu-Arakkonam gauge conversion in Kancheepuram. The Kanchi Shankaracharyas stay away from the function following a controversy triggered over the invitation extended to them by the Railways.",
        "25\tNovember\t1999": "Madras HC sets aside Tamil Nadu Governor Fathima Beevi's order rejecting the mercy petitions of four accused in Rajiv Gandhi case.",
        "25\tNovember\t2000": "Karnataka and Tamil Nadu Governments agree on a \"unified command\" for the STF operations against Veerappan."
    }
}