{
    "title": "Events for January 25",
    "events": {
        "1824": "Micheal Madhusudan Dutta, Bengali poet and dramatist, was born in Sagardari village of Jessore district.",
        "1856": "Battle of Seattle; skirmish between settlers & Indians.",
        "1880": "Brahmo Samaj of modernisation and fraternity amongst religions Nababidhan Keshab Chandra Sen introduced.",
        "1914": "Gandhi reaches agreement with South African Union govt. on treatment of Indian nationals at South Africa.",
        "1917": "Captain P.K. Sahgal, freedom fighter who attended Indian Military Academy course at Dehradun, was born at Hoshiarpur.",
        "1930": "Mehdi Baqer, great educationist, was born at Faizabad in UP.",
        "1932": "Rammanohar Vishnunarayan Tripathi, great social worker and political leader of Maharashtra, was born.",
        "1948": "French India Peoples' Convention, Pondicherry, passed a resolution for complete merger of the French India with the Dominion of India.  - G. V. Mavlankar was elected the first Speaker of the Indian Parliament.",
        "1950": "The post of the Governor General of India was abolished.",
        "1954": "Manabendranath Roy, famous leader of socialist revolution, passed away at Dehradun.",
        "1957": "Kashmir becomes Indian state.",
        "1971": "Himachal Pradesh becomes a full-fledged 18th Indian Union state.",
        "1976": "Surinder Amarnath scores 124 on Test debut during India vs New Zealand at Auckland.",
        "1980": "Awards regarding Public Honour were re-started by Goverment of India; Mother Teresa was honoured by Bharat Ratna, Padma Vibhushan, etc.",
        "1983": "Telugu Desam swept to power in Andhra Pradesh.",
        "1988": "Bharat Ratna, India's highest award, was given to Dr. Marudu Gopalan Ramachandran, MGR (Posthumous) (1917-1987).",
        "1989": "Motilal Vora sworn in as CM of Madhya Pradesh.",
        "1992": "Swaran Singh and Vajpayee awarded 'Padma Vibhushan'.",
        "1994": "Mine fire at Asansol India, kills 55.",
        "1995": "India and South Africa sign three pacts to forge special ties.",
        "1999": "Dr. R. Chidambaram, nuclear scientist,  among the 14 distinguished personalities chosen for Padma Vibhushan. Sachin Tendulkar and Ruskin Bond get Padma Shri.",
        "2000": "The Government awards Padma Vibhushan to R.K. Narayan, Dr.M.S. Gill; Padma Bhushan for Rajnikant and Padmashri for A.R. Rehman."
    }
}