{
    "title": "Events for December 25",
    "events": {
        "25\tDecember\t1763": "Suraj Mal Jat, Maharaja of Bharatpur, was killed by Najib-ud -Daulah s troops.",
        "25\tDecember\t1771": "Shah Alam II sat on the Throne of Dehli. Marathas captured Delhi and induced Shah Alam to return to Delhi after an absence of 18 years from the captial.",
        "25\tDecember\t1846": "Swati Tirunal Ramavarma passed away.",
        "25\tDecember\t1861": "Pandit Madan Mohan Malaviya, freedom fighter and founder of Banaras Hindu University, was born at Allahabad.",
        "25\tDecember\t1876": "Mohamad Ali Jinnah, the founder of Pakistan, was born.",
        "25\tDecember\t1879": "Sadhu T.L. Vaswani (1879-1966), altruistic Sindhi poet and servant of God, who found several Hindu missions in India and seven Mira Educational Institutions in his lifetime, was born.",
        "25\tDecember\t1880": "Dr. Mukhtar Ahmed Ansari, a nationalist Muslim leader, politician and journalist, was born at Yusufpur in Uttar Pradesh.",
        "25\tDecember\t1889": "Pandurangi Kodanda Rao, journalist, Hindi writer and social worker, was born in Visakhapatnam, A.P.",
        "25\tDecember\t1919": "Naushad, famous film music director, was born.",
        "25\tDecember\t1921": "Mass boycott greets the Prince of Wales when he arrives in Calcutta.",
        "25\tDecember\t1924": "Atal Krishna Behari Bajpayee, Prime Minister of India and a veteran journalist, was born at Gwalior, Madhya Pradesh.",
        "25\tDecember\t1926": "Dharmavir Bharti, journalist and editor of Dharmyug, was born. His famous books are \"Gunahon Ka Devta\" and \"Suraj Ka Satwa Ghoda\".",
        "25\tDecember\t1932": "King George V's chair collapsed during his Christmas dinner speech.",
        "25\tDecember\t1936": "Ismail Merchant, producer (Householder), was born in Bombay, India.",
        "25\tDecember\t1937": "Pitambar Datt Kaushika, great educationist, was born at Bulandshahar.",
        "25\tDecember\t1943": "Japanese bombers raid Chittagong.",
        "25\tDecember\t1946": "Gandhiji said, at Noakhali, \"I am being tested through and through\".",
        "25\tDecember\t1949": "Dr. Hari Singh Gour, famous law expert, great social reformer, jurist, leader and educationist, passed away.",
        "25\tDecember\t1954": "Manvendranath Roy, great patriot, died.",
        "25\tDecember\t1964": "Anil Kaul, Canadian badminton player (Olympics-96), was born in Amritsar, India.",
        "25\tDecember\t1969": "India all out for 163 at Madras vs Australia, Ashley Mallett takes 5-91.",
        "25\tDecember\t1972": "Chakravarti Rajagopalachari, great revolutionary freedom fighter, social worker, eminent litterateur, first Indian Governor General and the founder President of Swatantra Party, passed away.",
        "25\tDecember\t1974": "Indian Aeroplane Jumbo 747 was hijacked and taken over to Rome.",
        "25\tDecember\t1979": "Opening day of Fourth Test Cricket, India 8-112 v Pakistan at Kanpur.",
        "25\tDecember\t1991": "Ajit Singh expelled from the JD.",
        "25\tDecember\t1994": "Giani Zail Singh, former President of India, died in Chandigarh at the age of 78.",
        "25\tDecember\t1995": "First major multi-organ transplant in the country performed in Apollo Hospital in Madras.",
        "25\tDecember\t1997": "India-Sri Lanka one-day cricket match at Indore abandoned after three overs owing to a bad state of the pitch, which was a rare occurance.",
        "25\tDecember\t1999": "An Indian Airlines aircraft with 187 passengers on board is hijacked. The plane was going from Katmandu to New Delhi. It lands near Abu Dhabi after several hops.",
        "25\tDecember\t2000": "A. B. Vajpayee, Prime Minister, launches a Rs.60,000 crore ''Gram Sadak Yojana''  for linking all villages and the \"Antyodaya Anna Scheme''  for providing cheap foodgrains under the TPDS."
    }
}