{
    "title": "Events for March 25",
    "events": {
        "1609": "Henry Hudson embarks on an exploration for Dutch East India Co. at Pulicat.",
        "1898": "Dalpatrai (Dalpatram Dahyabhai Trawadi), modern Gujrati poet, passed away.",
        "1905": "Mirza Rasid Ali Baig, famous Indian politician, was born.",
        "1911": "L. D. Swamikannu publishes \"Manual of Indian Chronology\" in Bombay.",
        "1916": "S. M. Pandit, famous painter, was born.",
        "1920": "Sardar Sambhaji Chandrojirao Angre, politician and farmer, was born.",
        "1927": "Leslie Claudius, India field hockey (Olympic-gold-1948, 52, 56), was born.",
        "1928": "S. R. Kulkarni, leader of dock workers, was born.",
        "1931": "Ganesh Shankar Vidyarthi matyred in Hindu-Muslim riot at Kanpur. He was also the Editor of weekly 'Pratap'.",
        "1933": "Vasantrao Gowarikar, space scientist, was born.",
        "1954": "The first helicopter S-55 arrived ferried to Delhi. The Indian Air Force experience with rotary wing aircraft. It was indeed a 'red letter day' in the history of IAF a befitting gift on its coming of age ' when the first helicopter wearing IAF markings appeared at Palam in the form of a Sikorsky, S-55. Such a swift action, complete involvement and dedication on the part of the crew and technicians was the clear indication of the standards with which One-O-Four set about its tasks for others to emulate.",
        "1958": "Yograjsingh Bhagsingh Bhundel, cricketer (Indian pace bowler early 80's), was born in Chandigarh.",
        "1963": "Yagyawalk Bharadwaj, famous botany scientist, passed away.",
        "1971": "Aashish Rakesh Kapoor, cricketer (Indian off-spin batsman 1994-  ), was born in Madras.",
        "1983": "Chalpati Rao, great journalist, passed away.",
        "1987": "Marxist-led alliance gets majority in Kerala and West Bengal elections .",
        "1989": "India's first super-computer X-MP-14 of US make was dedicated to the nation.",
        "1990": "Lakshadweep Council elections.",
        "1991": "1991 census report released;  India has 844 million people.",
        "1994": "Buta Singh exonerated by the Akal Takht after 9 years.",
        "1996": "CBI gives a clean chit to PM Rao in the St. Kitts case.",
        "1997": "Justice Jagdish Saran Verma sworn in Chief Justice of India.",
        "1998": "Yashwant Sinha, Finance Minister, and  Railway Minister Nitish Kumar present the interim budgets for 1998- 99.",
        "1999": "Arathi Ponnappa,Former National tennis champion, called it quits from competitive tennis in Bangalore."
    }
}