{
    "title": "Events for May 25",
    "events": {
        "1606": "Guru Arjun Dev, spiritual leader of Sikhs and Hindus, was massacred at the instruction of Emperor Jahangir.",
        "1611": "Emperor Jahangir married Meherunnisa, widow of Sher Afghan. She recieved the title Noor Jahan.",
        "1877": "Sir John Lawrence--passenger steamer of McLean & Co. of Calcutta--sank near the coastline of Orrisa in a storm. This ship carried 732 passengers.",
        "1886": "Rash Behari Basu, great revolutionary, freedom fighter, social reformer and leader, was born at Palara Bighati village, West Bengal.",
        "1894": "Biharilal Chakravorty, bengali poet, passed away.",
        "1899": "Nazrul Islam, revolutionary and Bengali poet, was born in Churulia village of Burdwan district.",
        "1915": "Mahatma Gandhi established Sabarmati Ashram near Ahmedabad.",
        "1917": "Abdul Vavakunju Ummasalumma Khader, freedom fighter, was born in Kerala. He was hanged on September 10, 1943.",
        "1924": "Ashutosh Mukerjee, famous educationalist, passed away in Dumraon at Bihar .",
        "1933": "All young Hindus aged between 12 and 25 years were forced to carry identity cards to prevent spread of terrorism.",
        "1936": "Rusi Framroz Surti, cricketer (Indian slow lefty, hat-trick for Qld 1969), was born in Surat, Gujarat.",
        "1937": "Munshi Ajmeri passed away.",
        "1941": "Sagarmal Gopa, a devoted patriot and freedom fighter, was arrested in Jaisalmer. He wrote two books \"Jaisalmer Rajya ka Gunda Shasan\" and \"Raghunath Singh Ka Mukadma\" for which he was prohibited to enter in Jaisalmer.",
        "1954": "Maharshee Rajratna 'Manikrao' (Gajanan Yashwant Manik), physical expert, passed away.",
        "1961": "Woorkeri Venkar Raman, left-hand batsman and slow-spin bowler, was born in Madras.",
        "1965": "Independent India had further clashes with Pakistan in 1965 and 1971, one over the intractable Kashmir dispute and the other over Bangladesh. A border war was also fought with China in 1962 in the North-Eastern region, which resulted in the loss of Aksai Chin in Ladakh and smaller areas in the North-east. India continues to dispute sovereignty over these areas.",
        "1979": "Commercial Unity Day started.",
        "1990": "Jag Mohan, J&K Governor, resigns. Girish Chandra Saxena appointed new Governor.",
        "1991": "Indian, UN Angola Verification Mission - I ended (UNAVEM - I June 1989 - May 1991).",
        "1993": "Kazakhstan offers Baikonur facilities to India.",
        "1995": "Voting on the Criminal Law Bill differed again in Rajya Sabha.",
        "1996": "Maharashta govt. announces decision to revive Sri Krishna Commission set up to probe the 1993 Mumbai riots.",
        "1997": "Seven Pakistani infiltrators are killed in an encounter with BSF in Ranbir Singh Pora.",
        "1999": "The Prime Minister declares the Centre will take all possible steps to push back infiltrators in Kargil."
    }
}