{
    "title": "Events for June 25",
    "events": {
        "1529": "Babur reached to his capital Agra after winning Bengal.",
        "1658": "6th Mughal Emperor Aurangzeb arrested his father Shahjahan and put him in Agra Fort Jail.",
        "1880": "Syed Muhammad Zamin Ali, great educationist, poet, editor, professor, writer and founder-member of the Hindustani Academy, was born at Mustafabad village in the Rae Bareli district of U.P.",
        "1888": "Lord Louis Mountbatten, British politician, was born.",
        "1900": "Louis Mountbatten, last British Voiceroy and first Governor General of independent India, was born at England.",
        "1908": "Sucheta Kriplani, former Chief Minister of Uttar Pradesh, was born.",
        "1922": "Satyendranath Datta, famous Bengali poet, passed away.",
        "1931": "Vishwanath Pratapsing, former Prime Minister of India, was born.",
        "1932": "India played their first official test match on the ground of Lords against England.",
        "1943": "No. 8 Squadron started functioning absorbing the remaining coastal defence flight personnel, and also issued with a vengeance to achieve operational status.",
        "1945": "Lord Vevil talk to the Indian political leaders.",
        "1975": "President Fakhruddin Ali Ahmed signed the declaration of Emergency Rule in India. Prime Minister Indira Gandhi implemented the same very next day.",
        "1983": "India won 'Prudential World Cup' Cricket Championship held in England after defeating West Indies.",
        "1992": "BJP bags eleven seats in the biennial elections to the Rajya Sabha, Congress (I) secures seven.",
        "1993": "Mahadevan, SBI MD, sacked in the wake of his role in the securities scam.",
        "1994": "Dinsha Pirosha Madan, Chief Justice of Supreme Court, died.",
        "1996": "Sunderlal Bahuguna, noted environmentalist, ends 74-day repentance fast at Rajghat following assurance from PM Deve Gowda.",
        "1997": "USA & India sign a new bilateral treaty for the extradition of fugitive offenders.",
        "1998": "Sikh high priests exonerate the Akali Dal leader and chief of the Shiromani Gurdwara Parbandhak Committee, Gurcharan Singh Tohra, of  charges of violating a ``Hukumnama'' (religious edict) issued by the Akal Takht, which prescribed a complete boycott of the members of the Nirankari missions for their ''blasphemous'' activities.",
        "1999": "PSCB emerged men's and women's champions in the inter-institutional table tennis in Gandhidham.",
        "2000": "The Government agrees to the bifurcation of the Telecom Ministry."
    }
}