{
    "title": "Events for August 25",
    "events": {
        "1888": "Allama Mashriqi, Muslim leader, was born.",
        "1917": "The first significant step towards the Indianization of the Army was initiated when seven selected Indians, serving in the Army, were granted King's Commission in the Infantry and the Cavalry. Before the World War ended, two more Indians, who previously held temporary commissions, were granted King's Commission.",
        "1919": "Bindeshwari Prasad Mandal, former Chief Minister of Bihar and President of Mandal Commission, was born.",
        "1948": "Jana Gana Mana to be the provisional National Anthem till Constituent Assembly made a final decision.",
        "1959": "Jawaharlal Nehru, Prime Minister, declares in New Delhi that India will defend Bhutan and Sikkim if attacked by China.",
        "1960": "Olympics opened at Rome.",
        "1963": "Allama Mashriqi,  Muslim leader, passed away.",
        "1965": "Sanjeev Kumar Sharma, cricketer (Indian pace bowler 1988-89), was born in Delhi.",
        "1969": "Vivek Upendra Krishna Razdan, cricket pace bowler (Indian Test 1989-90), was born in Delhi.",
        "1975": "Bundelkhand University was established in Uttar Pradesh.",
        "1981": "Sharad Pawar, Maharashtra leader, elected the President of Congress.",
        "1990": "GOI announces formation of National Security Council headed by the Prime Minister.",
        "1992": "Mi-4 was re-equipped with the mighty Mi-35 Squadron and was renamed as 104-Helicopter Squadron.",
        "1994": "Ramdas Nayak, President of BJP Mumbai and former MLA was assassinated at Chembur, Mumbai. He was 52.",
        "1996": "194 pilgrims die of cold at the cave temples of Amarnath .",
        "1997": "Neelam J. Singh rewrites her own discussion mark in the domestic circuit meet in Chennai.",
        "1998": "Resurgent India Bonds garner more than 4 billion dollars of which 30\\% are from the Middle East, 20\\% each from South east Asia, US and Europe.",
        "1999": "Former Indian Davis Cup captain Narendra Nath died in Delhi.",
        "2000": "Veerappan seeks release of 121 prisoners, including 51 booked under TADA  at the Mysore prison and compensation to victims of STF excesses ."
    }
}