{
    "title": "Events for November 26",
    "events": {
        "1870": "Dr. Hari Singh Gour, famous law expert, social reformer, writer, jurist, leader and educationist, was born near Saugar.",
        "1890": "Satyabodh Balkrishna Hudlikar, author and educationist, was born at Dharwar (Mysore).",
        "1924": "Jasubhai Motibhai Patel, cricketer (Indian off-spinner, 9-69 v Aust 1959), was born in Ahmedabad.",
        "1931": "Gandhi announces a new civil disobedience campaign in the nationalist newspaper 'Young India'.",
        "1949": "The constitution of India was framed by a Constituent Assembly set up under the Cabinet Mission Plan, 1946. The Assembly held its first meeting on December 9, 1946 and elected Dr. Rajendra Prasad as its Chairman. The Constitution was prepared by the Drafting commission under the chairmanship of Dr. B. R. Ambedkar and was finally adopted on November 26, 1949. Framers of the constitution borrowed ideas from the Constitution of UK, USA, Ireland, Canada, South Africa, Germany and other countries.",
        "1954": "The Atomic Energy Commission starts functioning.",
        "1960": "First S.T.D. system of telephone (Subscriber Trunk Dialing) services started between Lucknow and Kanpur in India.",
        "1978": "Shaukat Ali, great freedom fighter and nationalist Muslim politician, passed away.",
        "1989": "India to have a coalition govt. after the governing Congress party has its majority wiped out in general elections.",
        "1991": "Romanian diplomat Liviu Radu released by Sikh militants after 48 days in captivity.",
        "1992": "A government bill to curb new medical colleges introduced in Parliament.",
        "1995": "Kotyya Pragda, freedom fighter and Rajya Sabha member, passed away.",
        "1997": "Dr. A.P.J. Abdul Kalam, scientific advisor to Defence Minister, chosen for Bharat Ratna.",
        "1998": "Krishan Kant, Vice-President, presents the \"Honest Man of the Year'' award to  Atal Behari Vajpayee in New Delhi. The award was instituted by the International Social Service Organisation.",
        "1999": "The Government plans to set up a judicial commission, says Prime Minister A.B. Vajpayee.",
        "2000": "Police nab Chandradas alias Manichan, one of the prime accused in the Kollam liquor tragedy case, at Nagercoil."
    }
}