{
    "title": "Events for January 26",
    "events": {
        "1876": "Railway route started between Mumbai and Calcutta.",
        "1882": "Telephone line started working between Mumbai and Calcutta.",
        "1893": "Srijiva Nyayatirtha Bhattacharya, famous writer and educationist, was born  Bhatpara, West Bengal.",
        "1915": "Rani Gaidinliu, freedom fighter, social reformer and political leader, was born at Nungkao village, Manipur State.",
        "1919": "Mohammad Cazzambhoy Ibrahim Khan, cricketer (batted in 4 Tests India vs West Indies 1948-49), was born in Bombay.",
        "1926": "V. G. Kanitkar, famous Marathi literatteur, was born.",
        "1927": "Laxman Madhav Katre, former Indian Air Chief Marshall, was born.",
        "1929": "Indian National Congress proclaims goal for India's independence.",
        "1930": "Mahatma Gandhi started the Dandi march to protest against the Salt Act of the British and the same day Indians swore to get 'Total' Swaraj and organised the day as Swaraj Day.",
        "1931": "Gandhiji was unconditionally released from prison.",
        "1950": "India became a Republic within the British Commonwealth and the Indian Air Force dropped its \"Royal\" prefix. At this time, it possessed six fighter squadrons of Spitfires, Vampires and Tempests, operating from Kanpur, Poona, Ambala and Palam, one B-24 bomber squadron, one C-47 Dakota transport squadron, one AOP flight, a communications squadron at Palam and a growing training organisation.",
        "1957": "Shivlal Nandlal Yadav, cricketer (Indian off-spinner 102 Test wickets 1979-87), was born in Hyderabad.",
        "1960": "More medals for armed forces were instituted including the Vishisht Seva Medal (in the classes), Sainya Seva Medal, Videsh Seva Medal and Sena, Nao Sena and Vayu Sena Medals.",
        "1961": "Special stamps dedicated to Mahatma Gandhi in the Champion of Liberty series issued by the United States postal department.",
        "1965": "Hindi Language is accepted as National language of India.",
        "1972": "Amar Jawan, a national memorial, established at India Gate, New Dehli.",
        "1981": "Sandeep Patil scores memorable 174 vs Australia at Adelaide Oval.",
        "1982": "Meera Behn (Medlin Slade) freedom fighter, and Gandhin by thought awarded 'Padma Vibhushan'.",
        "1988": "A Post Office was established at Dakshin Gangotri under the Goa Postal Division. (11-7-89).",
        "1992": "Bharat Bhushan, the legendary romantic film hero of the 1950's, passed away at the age of 71 years.",
        "1993": "Sub Lt. Rubi Singh of the Navy becomes the first woman in India to lead an armed force contingent in the Republic Day parade at New Delhi; British PM John Major attends as the first ever British head of Government as Chief Guest.",
        "1995": "Three powerful bombs rip through a celebration at a sports stadium in Kashmir as the State Governor addresses the crowd;7 people killed and 47 injured.",
        "1996": "47th Republic Day celebrated;Chief Guest was Fernando Henrique Cardoso, President of Brazil.",
        "1997": "Mizoram becomes a dry state, the fourth, after Gujarat, AP and Haryana.",
        "1999": "21 dalits are gunned down by the Ranbit Sena in Jahanabad district in Bihar.",
        "2000": "Mr. K. Vadivel Raj gets the 1999 Kabir Puraskar for rescuing 11 persons of another community during caste violence in September 1998 in a village in Tamil Nadu.",
        "2001": "Bharat Ratna, India's highest award, was given to Ustad Bismillah Khan."
    }
}