{
    "title": "Events for December 26",
    "events": {
        "1530": "Zahir Al-Din Muhammad Babur Shah, founder of Mughal dynasty, passed away at the age of 48 at Dhaulpur.",
        "1801": "Supreme Courts had Bengal and Madras by the charter.",
        "1831": "Hennry Louis Vivian Derozio passed away.",
        "1904": "First cross-country motor car race inaugurated between Dehli and Bombay started its rally. It was organised by Motor Union of Western India.",
        "1907": "23rd session of the Indian National Congress was presided by Dr. Rash Behari Bose. In this session, Congress was split into two groups named 'Extremists' under the leadership of Lala Lajpat Rai and 'Moderates' under the leadership of Dr. Rashbehari Bose. Sir Pherozeshah Mehta took active part on the moderate side. Anand Bazar reported with headings as \"The 23rd National Congress. Presidential Election. Tilak's Amendment. Uproarious Proceedings. Free Fight. Police Aid. Pandal Cleared. Police Escort Tilak. Adjourned Sine Die\".",
        "1914": "Dr. Shushila Nair, social reformer, was born in village Kunjah, district Gunjra, Punjab (now Pakistan). She dedicated her life to serve Gandhiji and Gandhi Ashram and also performed the duties of Indian citizen by taking active participation in freedom movement.",
        "1917": "Prabhakar Machve, famous Hindi and Marathi litterateur, was born.",
        "1921": "Nurul. S. Hasan, educationist and statesman, was born at Lucknow (U.P).",
        "1925": "Krishna G. Ginde, great musician and singer, was born.",
        "1947": "K.M. Munshi is appointed Govt. of India's agent in Hyderabad State.",
        "1978": "Indira Gandhi released after week in jail for refusing to testify on corruption.",
        "1985": "Rajiv Gandhi and Pakistan President Zia-ul-Haq meet in Delhi and agree not to attack nuclear plants in each other's country.",
        "1989": "Keshav Shankar Pillai, international fame cartoonist, painter, writer and Padma Bhushan awardee, passed away.",
        "1991": "Militant Sikhs kill 55 & wound 70 in India.",
        "1997": "Four MPs - Mr. Suresh Kalmadi from Pune, Mr. Anadi Charan Sahu from Cuttack, Mr. Mohan Delkar from Dadra and Nagar Haveli and Mr. Gopal Tandel from Daman & Diu- resign from Congress(I).",
        "1999": "Shankar Dayal Sharma (81), former President of India, died in New Delhi."
    }
}