{
    "title": "Events for October 26",
    "events": {
        "26\tOctober\t1814": "British General Governor declared war against Nepal.",
        "26\tOctober\t1886": "Godavarish Mishra, famous Orria poet, playwright and patriot, was born.",
        "26\tOctober\t1890": "Martyr Ganesh Shankar Vidyarthi was born at Allahabad. He was also the editor of revolutionary weekly 'Pratap'.",
        "26\tOctober\t1891": "Padmabhushan Vaikunthbhai Mehta, famous Gandhian leader, was born.",
        "26\tOctober\t1928": "R.S.Das, a law member of the Viceroy's council, died in Calcutta.",
        "26\tOctober\t1930": "Gulal Bai Parekar, a14-year-old girl led a 13-girls team to hoist the national flag at Esplanade Park. A police sargeant tried to snach the flag and then kidnapped her.",
        "26\tOctober\t1932": "Chinadorai Deshmutu, Indian field hockey player (Olympics-1952), was born.",
        "26\tOctober\t1934": "Akhil Bharatiya Gramin Udyog Sangh (All India Small Scale Industries Association) was founded and inaugrated by Mahatma Gandhi.",
        "26\tOctober\t1935": "Ashok P.Jain, great industrialist, was born.",
        "26\tOctober\t1937": "Pandit Hridaynath Mangeshkar, famous music director, was born.",
        "26\tOctober\t1943": "Cholera epidemic killed 2,155 people in the third week of October at Calcutta.",
        "26\tOctober\t1946": "27 die as violence between Hindus and Muslims continued in Calcutta.",
        "26\tOctober\t1947": "After the tribal column, raping and looting along the way by Pakistani Army continued at Baramulla, 50 kilometres from Srinagar. Maharaja of Jammu & Kashmir Hari Singhji, then, signed the instrument of accession with India and the Indian Armed Forces reacted to the Pakistani Army's infiltration. Great acts of personal gallantry and collective bravery were shown in the Kashmir operations. Major Som Nath Sharma was awarded the PVC, India's highest decoration for valour, and Brigadier Usman, commanding the 50th Parachute Brigade, was awarded the MVC. Both the soldiers were awarded posthumously.",
        "26\tOctober\t1950": "Tirumalai Echambadi Srinivasan, cricketer (Indian opening batsman 1981), was born in Madras.",
        "26\tOctober\t1952": "Pakistan's first Test cricket win vs India. Fazal Mahmood took 12 wkts .",
        "26\tOctober\t1961": "Heavy fighting flared up between India and Communist China in their three-year-old dispute over border lines in the Himalayas. Each side accused the other of initiating the fighting that began along the Tibetan border early in October.",
        "26\tOctober\t1962": "After Chinese attack, Emergency and Defence of India Ordinance was declared for the first time in India by the President.",
        "26\tOctober\t1969": "Neil Armstrong, the first men to land on Moon by 'Apollo II ', and Edwin Aldrin came to Bombay.",
        "26\tOctober\t1981": "Dattatrey Ramchandra Bendre, Gyanpeet awardee and Kannad poet, died.",
        "26\tOctober\t1990": "V. Shantaram, veteran film producer, director and Dadasaheb Phalke awardee, died at the age of 90 years in Bombay.",
        "26\tOctober\t1991": "Anantrao Bhalerao, freedom fighter, journalist and editor of daily newspaper 'Marathwada', died.",
        "26\tOctober\t1995": "India decides to go ahead with Integrated Guided Missile Development Programme in the wake of US stand to supply $370 million arms package to Pakistan.",
        "26\tOctober\t1996": "CBI detects a chain of bank transactions between August '93 and February '96 by four JMM leaders.",
        "26\tOctober\t1999": "The Government rejected the demand that Rajiv Gandhi's name be deleted from the chargesheet in the Bofors case."
    }
}