{
    "title": "Events for April 26",
    "events": {
        "1479": "Vallabhacharya, founder of 'Pushthimarg Panth', was born.",
        "1762": "Shyam Shastri, musician and a great artist of India, was born at Tiruvarur.",
        "1813": "Swati Tirunal Ramavarma, outstanding composer of Carnatic music in Kerala, was born in a royal family of Travancore.",
        "1841": "Bombay Gazette begins publishing on silk.",
        "1858": "Kunwar Singh, revolutionary of Indian mutiny and freedom fighter, passed away. He fought his last battle near Jagdishpur, Bihar on April 23, 1858 and defeated the Britishers but was deeply wounded. He also organised the national rebels.",
        "1895": "Guru Baksha Singh, modern Punjabi litterateur was born.",
        "1908": "Judge Sarv Mittra Sikri, Chief Justice of Supreme Court of India, was born.",
        "1920": "Srinivas Ramanujam, famous Indian mathematician, passed away at Chetpet in Madras.",
        "1924": "Ramabai Ranade, social reformer, passed away. She played a major role in the upliftment of women in India and founded Sevasadan in Bombay, a hostel for the ladies.",
        "1926": "Karachi Autonomous Region established in RSFSR (until 1943).",
        "1929": "British fliers make a record nonstop 4,130-mile trip from London to India.",
        "1945": "Virinchirpuram Krishnamurthi Ramaswamy, cricketer (Indian Test umpire stood in 1996 World Cup), was born in Madras.",
        "1946": "V. K. Ramaswamy, cricket test umpire for 10 tests from 1984-till date, was born at Hyderabad. He has become one of the first Indian Test umpires to be invited to umpire in a foreign country along with P. D. Reporter.",
        "1952": "India says U.N. may disintegrate if powers block consideration of issues in small countries.",
        "1973": "Judge A.N. Ray became the Chief Justice of India. He helded this office till 28/01/1977.",
        "1990": "V. R. P. Menon, an Air Force Engineer, broke the world record in Chandigargh.",
        "1991": "Syed Shahabuddin filed nominations for two seats as a candidate of two different parties within 24 hours.",
        "1992": "Medha Patkar arrested in Gujarat as the third Annual Goldman Environmental Prize of $ 60000 is awarded to her.",
        "1993": "Indian Airlines' IC 491 crashes at Aurangabad, killing 55 passengers.",
        "1995": "SAARC decides to launch South Asia Preferential Trade Area (SAPTA).",
        "1999": "The President dissolves Lok Sabha and orders fresh elections."
    }
}