{
    "title": "Events for May 26",
    "events": {
        "1739": "Afghanistan was separated from the Indian empire as a result of a treaty signed between Mughal Emperor Muhammad Shah and Nadir Shah.",
        "1885": "Govindagraj (Ram Ganesh Gadkari), great Marathi playwright, comedy author and poet, was born.",
        "1906": "Benjamin Peary Pal, internationally famous scientist of Indian agriculture, was born at Mukundpur, Punjab. In 1929, he went to Cambridge to do research on wheat and he returned to Burma with a Ph.D. five years later. In 1933, he got a research job with what is now known as the Indian Agricultural Research Institute in New Delhi. In 1965, Pal became Director General of the newly founded Indian Council of Agricultural Research in New Delhi. He has written several books on roses, the most popular being \"The Rose in India\".",
        "1916": "Rangnath Manohar Joshi (Nirmal Guruji), Marathi author, was born.",
        "1926": "Kankalta, freedom fighter, was born in Bargawadi village at Assam . She was shot when she tried to flur the Indian National Flag in Gopur, Assam.",
        "1931": "One hundred miners were trapped beneath a blazing mine. It was thought that there were unlikely to be any survivors in Madras.",
        "1935": "Swami Mrigendra Channaya, great Social Scientist in Maharashtra, was born.",
        "1945": "Vilasrao Dagdojirao Deshmukh, leader in Maharashtra, was born.",
        "1946": "Gandhiji considers 'Plan' the best document produced by British Government under the circumstances.",
        "1948": "First ever trade agreement with Pakistan.",
        "1957": "Janta Insurance Scheme was inaugurated in Bombay.",
        "1983": "R. V. Marathe, father of Postal Index, passed away.",
        "1993": "The Centre decides to implement the Mandal Commission recommendation to provide 27\\% reservation for the socially and educationally backward classes in the Central Services from 15th June.",
        "1997": "Government decides to allow the use of environment-friendly LPG as a motor vehicle fuel.",
        "1998": "S. Chandrasekar, scientist, was selected for the Niels Bohr-UNESCO gold medal.",
        "1999": "IRS-P4(OCEANSAT) with an Ocean Colour Monitor (OCM) and a Multi-frequency Scanning Microwave Radiometer (MSMR) and two small satellites (KITSAT of Korea and TUBSAT of Germany) launched by PSLV-C2.",
        "2000": "Prabhakar G. Surur (93) died in Mumbai."
    }
}