{
    "title": "Events for September 26",
    "events": {
        "1793": "Rani Rashmoni, great nationalist and social worker, was born in Kona village, 24 Parganas (north), West Bengal.",
        "1820": "Ishwar Chandra Vidyasagar (Banerji), great Indian educationist, social reformer, litterateur, father of Bengali prose and who gave the Bengalees their first Primer in 1855, was born in the village of Birsingha in Midnapore district of Bengal.",
        "1904": "R. V. Jagirdar, famous Kannad play writer, was born.",
        "1911": "Prat Kumar Sinha, cricket Test empire for 2 tests from 1948-53, was born in Bengal.",
        "1919": "Rotary Club's first Indian meeting was held.",
        "1923": "Dev Anand, film producer, director and actor, was born.",
        "1931": "Vijay Laxman Manjrekar, cricketer (father of Sanjay, reliable Indian batsman), was born in Bombay.",
        "1932": "Dr. Manmohan Singh, former finance minister, economist and Governor of R.B.I., was born.",
        "1946": "Gandhiji was interviewed with Wavell.",
        "1956": "Laxmanrao Kirloskar, great social reformer, industrialist, patriot and founder of the Kirloskar Industries, passed away at the age of 88.",
        "1975": "Constitution (39th Amendment) Bill 1975, placing election of the President, Vice President, Prime Minister and Speaker of the Lok Sabha beyond the scrutiny of the judiciary, approved by Parliament.",
        "1977": "Uday Shankar (Chowdhury), producer and director of dance-based film 'Kalpana', passed away. He was the elder brother of Pandit Ravishankar. His main achievement was the blending of the Indian classical style with the Western Ballet and various folk dances.",
        "1979": "Charan Singh launches a new party called the Lok Dal.",
        "1985": "P.T. Usha sets record for 100m (Women) in 11.39 seconds at Jakarta.",
        "1991": "Ordinance to amend MRTP Act and the Companies Act totally removes pre-entry restrictions on new industrial houses and expansion of the existing ones.",
        "1992": "Indian Airlines hike fare by 9 percent.",
        "1996": "Deve Gowda, PM, takes oath as Rajya Sabha member. He was the first PM to enter parliament through RS. Indira Gandhi was already a RS member when elected leader in 1966.",
        "1998": "Sachin Tendulkar make a record 127 runs against Zimbabwe at Calcutta.",
        "1999": "Atal Behari Vajpayee, Prime Minister, dispatched a team of experts to Karnataka and Tamil Nadu to assess the water storage position."
    }
}