{
    "title": "Events for October 27",
    "events": {
        "27\tOctober\t1605": "Akbar (Abul-Fath Djalal-ud-Din), Mughal emperor of India (1556-1605), passed  away of diarrhea or dysentery at the age of 63 years. After his death his body was buried at a mausoleum in Sikandra, Agra.",
        "27\tOctober\t1904": "Jatindra Nath Das, great revolutionary freedom fighter, was born at Bankim Behari in Calcutta.",
        "27\tOctober\t1907": "Brahma Bandhav Upadhyay died.",
        "27\tOctober\t1920": "Kocheril Raman Narayanan was born in the village of Uzhavoor in Kottayam district, Kerala.",
        "27\tOctober\t1923": "Arvind Navinchandra Mafatlal, famous industrialist, was born.",
        "27\tOctober\t1926": "Padmanabh Govind Joshi alias \"Nana\" Joshi, cricket wicketkeeper during 1950's was born in Baroda.",
        "27\tOctober\t1928": "Dattaji Krishnarao Gaekwad, father of Anshuman and batted in 11 Tests 1950's, was born in Baroda.",
        "27\tOctober\t1937": "Abdul Karim Khan, famous singer of 'Kirana Gharana', died.",
        "27\tOctober\t1947": "Indian Governments accepts King of Jammu and Kashmir Maharaja Harisingh's accession merging Jammu and Kashmir in India and sends its troops. Accession of Jammu and Kashmir was then officially announced. No. 12 Sqn was to initiate the remarkable feat of air-lifting the first Sikhs from Palam onto the rough and dusty Srinagar airstrip without planning or reconnaissance as the initial Indian response to the sizeable insurgent forces that were pouring across the border into Jammu and Kashmir.",
        "27\tOctober\t1969": "Darshansingh Pheruman died in Amritsar during the 74th day of his fast, which he had undertaken for the merger of Chandigarh in Punjab.",
        "27\tOctober\t1973": "The first Ladies Police Station started functioning at Calicut in Kerala.",
        "27\tOctober\t1982": "Gandhiji's personal secretary Pyare Lal died.",
        "27\tOctober\t1987": "Vijay Merchant, cricketer (Test average 47.72, 1st-class avg 71), died.",
        "27\tOctober\t1989": "The XIV-World Congress of Neurology was held in New Delhi under the auspices of the World Federation of Neurology and Neurology Society of India. (21-10-89).",
        "27\tOctober\t1992": "Veerappa Moily, Minister of Parliamentary Affairs, resigned from Bangarappa Government in Karnataka.",
        "27\tOctober\t1997": "UP ministry expanded by inducting 70 new members thus taking the total number of a record 93 members.",
        "27\tOctober\t1998": "L. P. Singh, ICS, former Governor of five north eastern states, died in New Delhi. He was 86.",
        "27\tOctober\t1999": "Bahujan Samaj Party (BSP) in Madhya Pradesh splits.",
        "27\tOctober\t2000": "The Vajpayee Government 'clears' the names of Surjit Singh Barnala, Prabhat Kumar and Dinanath Tiwari for appointment as the Governors of the new States of Uttaranchal, Jharkhand and Chhatisgarh respectively."
    }
}