{
    "title": "Events for December 27",
    "events": {
        "27\tDecember\t1797": "Mirza \"Galib\" Asad Ullah Beg Khan aka Mirza Asadullah Baig Khan, a prominent Urdu and Persian Language poet, his pen-names of Ghalib and Asad, was born in Agra.",
        "27\tDecember\t1898": "Shamrao Desmukh, former Central Minister and Agriculture expert , was born.",
        "27\tDecember\t1901": "Gandhiji moves resolution on South Africa at Congress.",
        "27\tDecember\t1911": "Jana Gana Mana.... ,' India ' s National Anthem, was first sung at the Indian National Congress session held at Calcutta.",
        "27\tDecember\t1926": "Imperial Airways announces the first scheduled air service to India from New Year in UK.",
        "27\tDecember\t1929": "Jawaharlal Nehru hoists the national flag at the All India National Congress session held in Lahore. They resolved for \"Purna Swaraj\" (complete independence) on the instance of Gandhiji, the Viceroy of India that time was Lord Irwin.",
        "27\tDecember\t1931": "150 are arrested following 'red shirt' riots in the N.W. Frontier province.",
        "27\tDecember\t1936": "Golden Jublee Session of Indian National Congress, under the presidentship of Jawaharlal Nehru, held at Faizpur urging India to strike at British imperialism.",
        "27\tDecember\t1962": "India and Pakistan begin negotiations over Kashmir.",
        "27\tDecember\t1975": "A coal-mine was exploded at Chasnala mine near Dhanbad. It was India's worst coal mine disaster, it claimed 372 miners lives.",
        "27\tDecember\t1976": "Yashpal, modern hindi litterateur, passed away.",
        "27\tDecember\t1977": "The Congress party splits into two factions, one supporting and one opposing Indira Gandhi.",
        "27\tDecember\t1985": "The Indian National Congress party, led by Rajiv Gandhi, begins its centenary celebrations in Bombay. .",
        "27\tDecember\t1987": "Vijaypal Singh sets a record for TJ in 16.79s at Trivandrum .",
        "27\tDecember\t1988": "The first hot-air Cross India Balloon started its flight in Rajasthan.",
        "27\tDecember\t1990": "DMK led Pondicherry ministry, headed by D. Ramachandran, resigns following loss of majority.",
        "27\tDecember\t1992": "Dhananjay Bhattacharya, famous Bengali singer, died.",
        "27\tDecember\t1996": "Mahashweta Devi, Bengali litterateur, win the Gyanpith Award.",
        "27\tDecember\t1998": "Nobel laureate Prof. Amartya Sen unveils his plans to set up a charity trust with the award money for development of education and health in India and Bangladesh.",
        "27\tDecember\t1999": "PSCB's Prathima Kumari shattered the National clean and jerk mark twice in the women's 58-kg class on the second day of the senior national weightlifting championship in Kalyan."
    }
}