{
    "title": "Events for November 27",
    "events": {
        "27\tNovember\t1001": "Sultan Mehmud of Ghazni began his first real expedition to India by defeating the Hindu King Jaipal. He won Afghanisthan and Punjab in  Peshawar battle. This was the first major Muslim conquest in India.",
        "27\tNovember\t1778": "Joseph Lin flew upto 2,286 meters high with the help of a baloon.",
        "27\tNovember\t1870": "Dattatreya Balwant Parasnis, famous history researcher and collector of historical items, was born.",
        "27\tNovember\t1881": "Kashi Prasad Jayaswal, great lawyer, philosopher and eminent historian, was born at Mirzapur, UP.",
        "27\tNovember\t1888": "Ganesh Vasudeo Malvankar, great social worker, educationist, writer and first speaker of Lok Sabha, was born in Baroda.",
        "27\tNovember\t1907": "Harivanshrai Bachchan, famous Hindi writer and poet, was born at Allahabad.",
        "27\tNovember\t1920": "Kanhaiyalal Bhagwandas Harjal, educationist, was born at Mohpa, Maharashtra.",
        "27\tNovember\t1935": "Prakash Bhandari, cricketer (3 Tests for India in mid-50's, 77 runs), was born in Delhi.",
        "27\tNovember\t1946": "London announces parley on India; Muslims accept, Hindus decline.",
        "27\tNovember\t1962": "Britain agreed to supply arms to India.",
        "27\tNovember\t1972": "Bhutto reports the release of 616 Indian prisoners captured in the Indian-Pakistani dispute at Pakistan.",
        "27\tNovember\t1976": "Gajanan Tryambak Madkholkar, famous journalist, novelist and critic, passed away.",
        "27\tNovember\t1984": "Percy Norris, British Deputy High Commissioner in Bombay, assassinated in Bombay.",
        "27\tNovember\t1992": "Sachin Tendulkar, 19 years and 22 days old, becomes the youngest cricketer to make 1,000 test runs while playing in Johannesburg.",
        "27\tNovember\t1993": "Splendid bowling by Anil Kumble (6 for 12) helps India to beat West Indies by 102 runs in the Hero Cup finals in Calcutta.",
        "27\tNovember\t1994": "Shyam Vyas, veteran Hindi story writer, passed away.",
        "27\tNovember\t1998": "India retains the Asia Cup tennis championship in Delhi beating Uzbekistan 2-1 in the final.",
        "27\tNovember\t1999": "BJP suspends former Chief Minister of Uttar Pradesh Kalyan Singh from the primary membership of the Party for defying Mr. Vajpayee.",
        "27\tNovember\t2000": "Supreme Court grants bail to four AIADMK men accused in the 2nd February Dharmapuri bus burning incident."
    }
}