{
    "title": "Events for January 27",
    "events": {
        "1888": "Jinvijayji Muni, famous Shwetambar Jain Yati, was born.",
        "1901": "Tarkatirtha Laxmanshastri Joshi, the great thinker, master of Sanskrit and editor of Marathi Vishwakosh, was born.",
        "1904": "R. P. Kanitkar, veteran writer, nationalist, journalist and editor, was born.",
        "1924": "Sabu [Dastagir], actor (Elephant Boy, Drum), was born in India.",
        "1926": "Arunkumar Vaidya, former General of Indian Army, was born.",
        "1927": "Michael Craig, actor (Escape 2000, Vault of Horror), was born in Pune.",
        "1931": "Mahatma Gandhi was released from jail, ending eight months of imprisonment for his campaign of civil disobedience against British rule. To avoid demonstrations, Gandhi was released late in the evening from the Yerovda jail and put on a night train to Bombay. There was hope in British circles that the release of Gandhi would end the strife and lead to discussions of dominion status. Gandhi made clear, however, that he would persist in his civil disobedience campaign.",
        "1948": "Gandhiji visits Mehrauli Muslim Fair.",
        "1967": "Delimitation Agreement for Warfare in space was signed by 60 nations in United Nation.",
        "1970": "Probir Sen, cricketer, 20 catches & 11 stumpings and 14 Tests for India, passed away.",
        "1972": "V. S. Sarvate (Tatya Saheb), great revolutionary writer, passed away.",
        "1974": "President V. V. Giri inaugurated the Jawaharlal Nehru Memorial Museum and it was opened for public at Teen Murti House, New Delhi.",
        "1984": "First unit of Atomic Energy Production Centre started at Kalpakkam.",
        "1987": "P. T. Usha nominated the Asian Athlete of 1986 by the US Sports Academy (USA).",
        "1988": "The first ever helicopter mail service was inaugurated at Andaman and Nicobar Islands. The first flight was from Port Blair to Havelock Island and its inaugurated by the Governer of Andaman and Nicobar Island.",
        "1989": "M. Karunanidhi sworn in as DMK CM in Tamil Nadu.",
        "1994": "Union Cabinet approves inclusion of the land reforms laws in the 9th Schedule of the Constitution.",
        "1995": "Rajiv Gandhi Container Terminal open at Kochi port.",
        "1996": "'Prithvi', surface-to-surface missile, test-fired successfully.",
        "1999": "P. Krishnamurthy, former Indian wicketkeeper, died in Hyderabad following a cardiac arrest.",
        "2000": "K.R. Narayanan, President, opposes any tinkering with the Constitution."
    }
}