{
    "title": "Events for April 27",
    "events": {
        "1526": "Babur Shah was declared as the Emperor of Dehli.",
        "1606": "Jahangir arrested Khusroo.",
        "1705": "Aurangzeb captured  the Fort of Vagingera.",
        "1748": "Muhammad Shah, Mughal emperor, passed away and was succeeded by his son Ahmad Shah.",
        "1854": "First telegram was sent between Mumbai and Pune.",
        "1857": "Jamshedji Framji Madan ( J. F. Madan ), founder of India's first Cinema Hall - 'Elphinstone Palace' at Calcutta, Madan & Co. and Parsi Theatrical Company, was born.",
        "1878": "Calcutta University started Women's Education, and allowed women to appear in the Entrance Examination.",
        "1906": "China, as suzerain of Tibet, has agreed to the terms of a treaty proposed by Britain. According to the treaty, foreign powers may not send representatives to Tibet, receive transportation or mining concessions, or occupy, buy or lease any territory in Tibet without British permission. The British want to prevent the Russians from establishing a protectorate over Tibet, which lies on India's northern border. Lord Curzon, Viceroy of India, failed in attempts to communicate with Tibet's ruler, the Dalai Lama. A British military expedition fought its way to the capital at Lhasa and concluded the agreement.",
        "1907": "Fearing uprising in Punjab, British arm volunteers.",
        "1918": "Gandhiji attends Viceroy's War Conference at Delhi and addresses it in Hindustani; subsequently tours Kaira District to raise recruits for army.",
        "1919": "Ustad Allarakha Khan, great Tabla player, was born.",
        "1920": "Dr. Manibhai Desai, great Gandhian leader and Magssese Awardee, was born.",
        "1942": "Gandhi condemns stationing of U.S. troops in India.",
        "1960": "Presidential orders were issued on the report of the Committee of Parliament on official Languages which includes issues relating to preparation of terminology (Hindi glossaries, Hindia translation of codes and procedural literature, imparting training in Hindi to employees propagation of Hindi, language of bills, language to be used in the Supreme Court and High Court etc).",
        "1986": "Congress (I) expels former Union Minister Pranab Kumar Mukherjee from the party for 6 years.",
        "1993": "A national credit fund for women called the 'Rashtriya Mahila Kosh' set up.",
        "1994": "Supreme Court strikes down section 309 of the Indian Penal Code(which makes suicide a punishable offence)- violative of Article 21.",
        "1996": "General Election (11th) of India begins.",
        "1997": "CBI decides to prosecute Bihar CM Laloo Prasad Yadav, former CM Dr. Jagannath Mishra, Union Minister Chandra Deo Prasad Verma and 53 others in the Rs. 950 crore fodder scam case.",
        "2000": "Arun Bharat Ram takes over as the president of the Confederation of Indian Industry."
    }
}