{
    "title": "Events for May 27",
    "events": {
        "1857": "Nana Sahib was captured at Kanpur.",
        "1906": "Maharashtra Sahitya Patrika Day.",
        "1910": "Robert Koch, famous French scientist, passed away.",
        "1919": "Kandukuri Veeresalingam, father of modern Telgu language, author and social reformer, passed away.",
        "1930": "India's major cities are seething with unrest following the arrest of Mahatma Gandhi and thousands of his followers in the campaign of civil disobedience against British rule. Civil unrest in Bombay, where at least six were killed and sixty injured.",
        "1948": "The trial of nine men accused of assassination of Gandhi before a special court judge at the Red Fort. The trial ended on 30th Dec.",
        "1951": "Taraporewala Aquarium was inaugurated at Mumbai by President Dr. Rajendra Prasad.",
        "1952": "United Nationalist Party and the Indian Democratic Party combined to form one opposition party - National Democratic Party with Dr. S. P. Mukherjee as leader.",
        "1957": "Copyright Act was passed.",
        "1962": "Ravishankar Jayadritha Shastri, cricketer (Indian SLA all-rounder 1981-92), was born in Bombay.",
        "1964": "Pandit Jawaharlal Nehru, first Prime Minister and architect of modern India, passed away at the age of 74.",
        "1968": "Second Jawaharlal Nehru award for International Understanding given to Reverend Martin Luther King posthumously.",
        "1990": "Om Prakash Chautala, former CM,  wins Mehem by-election.",
        "1991": "Justice J.S. Verma of the Supreme Court appointed to probe into Rajiv Gandhi murder case.",
        "1992": "M. L. Manchanda, AIR's Patiala engineer who was kidnapped by Babbar Khalsa militants, was found executed.",
        "1994": "Tarktirth Laxmanshastri Joshi, internationally famous omnicient, passed away.",
        "1995": "National Centre for Labour launched in Bangalore to give a boost to the unorganised worker's movement in India.",
        "1996": "A. B. Vajpayee, PM, seeks vote of confidence in his 12-day old govt.",
        "1997": "Sri Lanka claims Independence Cup, winning the second match in the best-of-three finals in Calcutta.",
        "1998": "Minoo Masani, 92, co-founder of the Swatantra Party, passed away in Mumbai after a brief illness.",
        "1999": "Sharad Pawar, Tariq Anwar and P.A. Sangma launch the Nationalist Congress Party.",
        "2000": "In a mini cabinet reshuffle,  Nitish Kumar gets back his Agriculture portfolio, while  Dilip Ray resigns as Minister of State for Steel."
    }
}