{
    "title": "Events for June 27",
    "events": {
        "1838": "Bankim Chandra Chattopadhyay (Chatterjee), famous novelist, \"the father of modern Indian fiction\" and writer of national song 'Vande Mataram', was borm at Katalpara near Naihati, West Bengal. Some of his writings are 'Anandmath' and 'Kapal Kundala'. He was among the first two Bengalee Graduates.",
        "1839": "Maharaja Ranjit Singh, ruler of Punjab and Spiritual Guru of sikh community, passed away.",
        "1894": "Chhaganbapa (Chhaganlal Karamshi Parekh), great social worker, was born.",
        "1906": "Establishment of `Maharashtra Sahitya Parishad'.",
        "1915": "Khanderao Moreshwar Rangnekar, 3 test matches, 33 runs, vs Australia in 1947-48, was born at Mumbai.",
        "1917": "Khanderao Moreshwar Rangnekar, cricketer (batted in 3 Tests India v Australia 1947-48), was born in Maharashtra.",
        "1922": "Vaidyalingam Akhiladam Perunglur, Gyanpeeth awardee and famous Tamil author, was born.",
        "1939": "Rahul Dev (R. D.) Burman \"Pancham Da\", famous music director, was born.",
        "1964": "Teen Murti Bhavan, official residence of the Prime Minister of India, became the Nehru Memorial Museum.",
        "1966": "D. S. Joshi was appointed as the Cabinet Secretary of India. He held this office till 31-12-1968.",
        "1967": "First Indian made AVRO aircraft passenger Plane HS748 handed over to Indian Airlines.",
        "1995": "Environmentalist and 'Chipko' leader, Shri Sunderlal Bahuguna ends the 49-day old fast in demand for a scientific review of the controversial Tehri dam project in UP.",
        "1997": "Surendra Pratap Singh, famous Journalist and former chief editor of Nav Bharat Times Group, died ]at Delhi.",
        "1998": "Mr. Nikhil Chakravartty, journalist and chairman of Prasar Bharati, dies in New Delhi at 84.",
        "1999": "India won the four-nation under-21 women's hockey title, defeating England in the final at the Kean University, New Jersey.",
        "2000": "Maneka Gandhi, Union Minister of State for Social Justice and Empowerment, launches National Initiative for child protection of which childline is an integral part."
    }
}