{
    "title": "Events for July 27",
    "events": {
        "1887": "Sardar Davar Tehmuras Kavasji, social worker and lawyer, was born.",
        "1889": "Branch of Indian National Congress, 'British India Committee' , was established under the leadership of Dadabhai Navroji.",
        "1910": "Bande Ali Khan, great singer of `Beenkar' and `Kirana Gharana', passed away.",
        "1914": "Kalpana Dutta, great freedom fighter, was born at Chatgaon. (27th July, 1914).",
        "1927": "Krishna Baldev Vaid, famous story writer and novelist, was born.",
        "1928": "Rameshwar Sahai Saxena, famous writer, lawyer and journalist, was born at Lalitpur, (UP).",
        "1941": "Japanese forces land in Indo-China.",
        "1947": "Princes were appealed to regard people's paramountcy as a privilege.",
        "1949": "Agreement reached on the ceasefire line in Kashmir.",
        "1959": "Abbas Ali Baig scores 112 for India v England on debut.",
        "1972": "Charu Majumdar, father of Naxalite Movement and the founder President of C.O.I.(M-L), died in prison.",
        "1982": "Indian Prime Minister Indira Gandhi  first visited the US in almost 11 years.",
        "1986": "The Supreme Court orders all-India test for medical seats.",
        "1991": "Army called out in Srinagar valley after an attack on security forces in which 17 persons were killed.",
        "1992": "Amjad Khan, famous film actor, died.",
        "1993": "Rao government defeats the no-confidence motion by 265-251 votes. Seven of the JD (A) vote with government as JD (A) and AIADMK decide to vote for no-confidence motion.",
        "1994": "Parliament votes to ban tests for determining the sex of an unborn child, as these tests have resulted in thousands of aborted female fetuses.",
        "1995": "11 Cong-I and National Conference activists were gunned down in J&K after they were abducted from their homes.",
        "1998": "The Centre announces a hefty hike in the pay scales of university and college teachers."
    }
}