{
    "title": "Events for August 27",
    "events": {
        "1604": "Guru Granth Sahib was established in the Golden Temple of Amritsar.",
        "1781": "Haider Ali and the Britishers fought the battle of Pallilore.",
        "1859": "Dorabji Jamshetji Tata, great industrialist, was born.",
        "1870": "Sharmajivi Sangha was established in Calcutta by Sashipada Banerji.",
        "1910": "Mother Teresa, [Agnes Gonxha Bojaxhiu], nobel Prize awardee and social worker, was born in Skopje, Macedonia in Yugoslavia.",
        "1918": "Nemichandra Jain, stage critic, was born.",
        "1946": "Gandhiji cables warning to British Government against repetition of \"Bengal Tragedy\". He also wrote to Wavell.",
        "1952": "Vigyan Mandir inaugurated at Nazafgarh Road, New Delhi.",
        "1958": "Metric system of weights and measures introduced.",
        "1976": "Major-General (Kumari) Gertude Ali Ram, the first women General in Indian Army, was appointed as the first Director of Military Nursing Services at the Army Headquarters.",
        "1978": "Lord Mountbatten died in an explosion near Ireland.",
        "1987": "B. Shankaranand appointed Chairman of the Parliamentary Committee to enquire into the Bofors gun deal.",
        "1990": "The Cabinet Committee on political affairs decides to put a proposal before the Parliament providing five to ten per cent of Central Government jobs reserved for economically weaker sections.",
        "1992": "The President issues two ordinances making it mandatory for new medical and dental colleges to obtain prior approval of the Medical and Dental Councils of India before their establishment.",
        "1994": "Indian soldiers and Muslim militants clash in Kashmir.",
        "1995": "Andhra Pradesh Governor asks N T Rama Rao to prove his majority on 31st following a split in the Telugu Desam party.",
        "1997": "Daljeet Singh and Debi Bose set national records in the Federation Cup athletics at Chennai in javelin throw and hurdles respectively.",
        "1998": "India's cricket sensation Sachin Tendulkar has an audience with the legendary Sir Don Bradman at the latter's 90th birthday celebrations in Adelaide.",
        "2000": "Mika Hakkinen wins the Belgian Formula One Grand Prix in SPA-Francorchamps at Belgium."
    }
}