{
    "title": "Events for September 27",
    "events": {
        "1703": "More than 8,000 people died in a cyclone in England.",
        "1760": "Mir Zafar was deposed and his son-in-law Mir Kasim became the Nawab of Bengal. He ruled till July 7, 1763.",
        "1833": "Raja Rammohan Roy, great social reformer, lawyer and politician passed away at Stapleton Grove in England.",
        "1856": "Pratap Narayan Mishra, Hindi writer, was born. He is one of the pioneers of mordern Hindi language.",
        "1873": "Vithalbhai Patel, great freedom fighter, social worker, nationalist leader, politician and President of the Central Assembly, was born at Karmasad, Gujarat.",
        "1907": "Bhagat Singh, the legendary revolutionary, was born at Banga in West Punjab, Layalpur now in Pakistan.",
        "1908": "Shiv Verma, great soldier, was born.",
        "1925": "Rashtriya Swayansewak Sangh was established.",
        "1958": "Mihir Sen becomes the first Indian to cross the English Channel from Dover to Calais.",
        "1972": "Shri Shiyali Ramamrita Ranganathan, prolific author and first librarian of the University of Madras, passed away at the age of 80 at Bangalore.",
        "1974": "Pankaj Dharmani, Indian ODI batsman (1997), was born.",
        "1977": "Sanjiva Reddy was elected Speaker of the Lok Sabha. Government revokes the external emergency promulgated on December 3, 1971.",
        "1989": "Hemanta Kumar Mukherjee, noted playback singer and music director, died.",
        "1990": "Kabita Garari sets record for 10 Km W (Women) in 48.10 at Beijing Asian Games.",
        "1993": "Daily newspaper of Marathi Language \"Samna\" started its publication at Sambhaji Nagar (Aurangabad).",
        "1995": "73 people died in a coal mine accident in Gaslitand in Dhanbad district, Bihar, when flood water leaked into the mine.",
        "1999": "Harshad Mehta and three others are convicted for misappropriating surplus funds of the Maruti Udyog Ltd.",
        "2000": "Venus Williams of USA claims the women's gold in the tennis event in the Sydney Olympics."
    }
}