{
    "title": "Events for January 28",
    "events": {
        "1846": "British forcibly separate Kashmir from the Sikhs and sell it to the Maharaja of Jammu for 1,000,000 pounds  after the Battle of Allwal.",
        "1853": "Jose Marti, great author and politician, was born at Cuba.",
        "1865": "Lala Lajpat Rai 'Punjab Kesari', great valiant freedom fighter, social reformer, humanitarian and lawyer, was born in Dhudike village of Ferozepur district, Punjab.",
        "1877": "Pulin Bihari Das, revolutionary journalist, passed away.",
        "1894": "Anandibai Prabhakar Jayawant, famous Hindi writer, was born at Baroda.",
        "1895": "Shankarrao Dattatray Dev, veteran Congress leader, Gandhian and Sarvoday leader, was born.",
        "1898": "Nivedita, an Irish lady of Scottish descent, came to India.",
        "1900": "General K.M. Cariappa, first Indian Commander-in-Chief of the Indian Army, was born at Sanivara, Santhai (Coorg).",
        "1902": "Gandhiji left for Rangoon visit. Stays for a month with Gokhale at Calcutta. Returns to Rajkot and settles down to practise.",
        "1911": "The famous Hope diamond, once worn by Marie Antoinette, was bought tonight for over $300,000 by Ned McLean, son of John McLean. Mrs. McLean wore it as a head ornament, guarded by a former Secret Service man who in turn was guarded by two private detectives. Walnut-sized and exquisitely blue in color, the 44.5-carat stone stems from India. Its owners included Louis XIV, Louis XVI, and a London banker named Hope. A sinister history of ill luck, madness, and violent death clings to the unique gem.",
        "1925": "Raja Ramanna, fourth President of Indian Atomic Energy Commission, was born.",
        "1933": "India in Waldorf Hotel in London read out a four and a half page note in Cambridge.",
        "1937": "Suman Kalyanpurkar, famous singer, was born.",
        "1950": "Supreme Court of India was inaugurated.",
        "1951": "Kashmir issue taken up in UN security council.",
        "1961": "Foundation-stone of the first factory of H.M.T. wrist watches laid in Bangalore.",
        "1976": "Erapalli Prasanna takes 8-76 to rip through New Zealand at Eden Park.",
        "1984": "Sohrab Meherwanji Modi, famous drama and film producer, director and actor, passed away.",
        "1992": "Umanath Vachaspati, Magsesey Award winner, passed away.",
        "1996": "Dev Kanta Baruah, first President of former Congress, passed away at New Delhi at the age of 82.",
        "1998": "All 26 accused, who stood trial in the Rajiv Gandhi assassination case, were sentenced to death. A designated Judge of the TADA court in Chennai found them guilty.",
        "1999": "Central Zone won the Deodhar Trophy, defeating South in their final in Agartala.",
        "2000": "Indian junior cricket team wins the Youth cricket World Cup."
    }
}