{
    "title": "Events for October 28",
    "events": {
        "1627": "Jahangir, Mughal emperor, weak from asthma and no food, died at Bhimghar near Kashmir. He was buried at Shahdara (Lahore) on the banks of the Ravi. During his last days, he remained in the custody of Aurangzeb.",
        "1811": "Yashwantrao Holkar, a diplomat of Peshwa kingdom, died.",
        "1867": "Swami Vivekanand Sister Nivedita, great freedom fighter, revolutionary and politician, was born at Dunganon in Ireland.",
        "1888": "Gandhiji reaches London. Lives on vegatarian diet. Takes lessons in dancing and music for a short time, thinking they are necessary parts of a gentleman's equipment.",
        "1911": "Mutyalswami Muniswami Naidu, cricket Test umpire, one test in 1951-52, was born at Vadodara, Gujarat.",
        "1928": "M.G.K. Menon, Physics expert, was born.",
        "1929": "Narotam Puna, cricketer (Bombay NZ off-spinner v England 1966), was born.",
        "1946": "Gandhiji leaves for Calcutta. Riots break out in Bihar.",
        "1947": "Sheikh Mohammad Abdulla invited to form an interim government in J&K.",
        "1962": "US pledges to rush arms to India.",
        "1964": "Padmabhushan Vaikunthbhai Mehta, famous Gandhian leader, passed away.",
        "1977": "Shantiprasad Jain, industrialist, died.",
        "1981": "Underground Metro Train Compartments were tested on trial basis at Calcutta.",
        "1984": "Federal agents early this morning caught Guru Shree Rajneesh trying to flee the country. Rajneesh was charged with violating immigration laws and arranging phoney marriages for his cult members. The religious leader was nabbed at Charlotte, North Carolina airport when his jet, bound for Bermuda, touched down for re-fueling. The Bhagwan ran a commune of about 1,500 people in Oregon. Thousands more cult members live in Rajneesh's native land India and other countries. He knew the federal government had no faith in him after his chief adviser, a woman named Ma Anand Sheela, was arrested in West Germany for several minor offenses. Rajneesh appeared in court on this date clad in a lavender robe.",
        "1991": "Chruchill Alemao of Goa set free by court.",
        "1992": "Karnataka government withdraws order allowing nine private organisations to start capitation fee for engineering colleges.",
        "1996": "Press Council of India to set up a 5-member committee headed by Chairman P.B. Sawant to inquire into the attack on journalists outside the New Delhi residence of Kanshi Ram.",
        "1997": "Dr. V. Doreswamy Iyengar (77), Veena maestro, household name among Carnatic music lovers, passed away in Bangalore.",
        "1998": "The 1998 Swarna Jayanti Fellowship Award is presented to 11 young scientists.",
        "1999": "Insurance Bill is introduced amid protest in the Lok Sabha.",
        "2000": "The Royal Canadian Mounted police arrest two Sikhs, Ripudaman Singh Malik (53) and Ajaib Singh Bagri (51), in Vancouver in connection with the downing of Air India Boeing 747 en route from Canada to London in 1985."
    }
}