{
    "title": "Events for December 28",
    "events": {
        "28\tDecember\t1688": "Mughal Emperor Aurangzeb demolishes all temples (around 1,000) in Mathura. (During their reign, Muslim rulers had destroyed roughly 60,000 Hindu temples throughout India, constructing mosques on 3,000 sites).",
        "28\tDecember\t1883": "Under the leadership of Surendra Nath Banerji, the political group of Bengal organised National Conference as \"Bharat Sabha\".",
        "28\tDecember\t1885": "Allian Octavian Hume, a Scotsman, founded National Union and it held its first meeting in Bombay Tejpal Hall. The first session of Indian National Congress started under the Presidentship of Vyomesh Chandra Banerjee.",
        "28\tDecember\t1892": "Dr. Shivajirao Ganesh (Daji Patwardhan), famous social worker and Padmashri awardee, was born.",
        "28\tDecember\t1896": "In the Indian National Congress, Vande Mataram was first sung in Calcutta.",
        "28\tDecember\t1905": "Sir Dr. Gajapatairaj Vijaya Ananda, the Maharajkumar of Vizianagram, \"Vizzy\", cricketer and Indian Right Handed Batsman, was born at Vizianagar. He was honoured with Padma Bhushan in 1958.",
        "28\tDecember\t1907": "Vitthal Narayan Kothiwale, great author, was born at Garoth (Malva).",
        "28\tDecember\t1921": "Prince of Wales inagurated Victoria Memorial Hall at Calcutta.",
        "28\tDecember\t1925": "Kasturbhai Lalbhai Shrenik, great industrialist, was born at Ahmedabad.",
        "28\tDecember\t1926": "Shirish Kumar, freedom figher, was born.",
        "28\tDecember\t1928": "First talkie feature film 'Melody of Love' was released in India. The film was made by Universal Picture Corporation, America. It's premier was held at Elphinstone Picture Palace, Calcutta.",
        "28\tDecember\t1930": "Police are stoned by demonstrators as they attempt to prevent an illegal flag-salutation ceremony at Bombay.",
        "28\tDecember\t1931": "The second round of a British-Indian conference on the political future of India collapsed in disagreement over demands by Indian nationalists for complete independence. The British government had seemed willing to grant a limited dominion status. But Mahatma Gandhi, who had come to the conference to present the demands of the All-India Nationalist Congress, refused to accept anything less than complete independence. The breakdown of the talks set off a new round of disorders, Gandhi was greeted by rioting in the streets of Bombay between upper-caste Hindu members of the Congress party and \"untouchable\" caste members who had turned against him.",
        "28\tDecember\t1932": "Britain says it is to release 28,000 prisoners, including Gandhi.",
        "28\tDecember\t1951": "Recognition to Libya by India accorded.",
        "28\tDecember\t1952": "Arun Jaitley, son of Maharaj Kishan Jaitley, was born in New Delhi.",
        "28\tDecember\t1971": "Nanak Singh, famous novelist and poet, died at Preet Nagar.",
        "28\tDecember\t1972": "C. Rajagopalachari, the only Indian Governor General, died.",
        "28\tDecember\t1974": "Pandit Hiralal Shastri, great social worker, leader and first Chief Minister of Rajasthan State, died.",
        "28\tDecember\t1977": "Sumitranandan Pant, famous Hindi poet and literaeur, died.",
        "28\tDecember\t1981": "Salman Rushdie is awarded the Booker Prize for Midnight's Children.",
        "28\tDecember\t1983": "Gavaskar achieves his 30th century beating Bradman's 29.",
        "28\tDecember\t1984": "Eighth General Election of India ends. Indian National Congress party wins with thumping majority.",
        "28\tDecember\t1990": "Following the war threat as the January 15 deadline set by UN for Iraq to withdraw from Kuwait approaches, GOI advise Indians in Gulf to send back their families to India.",
        "28\tDecember\t1995": "Third Indian Remote Sensing Satellite (IRS-1C), carring advanced remote sensing cameras was launched by Russian Molniya launch vehicle. It is still in service.",
        "28\tDecember\t1996": "India all out for 66 at Durban after making 100 in the first innings of the game.",
        "28\tDecember\t1998": "India and Sri Lanka sign an agreement to establish a bilateral free trade area, after the visiting Sri Lankan President Chandrika Kumaratunga and  Prime Minister A. B. Vajpayee, have sorted out the differences that held up the negotiations on it in the past.",
        "28\tDecember\t2000": "The Kanchi Acharya presents the Sri Chandrasekharendra Saraswati national eminence awards to former Prime Minister P.V. Narasimha Rao, Smt. M.S. Subbulakshmi (in absentia), scientist  Ramnarayan Agarwal and pravachan artist Rameshbhai Ojha."
    }
}