{
    "title": "Events for February 28",
    "events": {
        "1568": "Chittorgarh Fort was captured by Mughal Emperor Akbar which was circled from outside since 20th October 1567. This victory was achieved with the help of Jaimal and Patta.",
        "1580": "The first visit of Jesuit Priest of Goa in the Court of Emperor Akbar at Fatehpur Sikri.",
        "1712": "Bahadur Shah I died at Lahore at the age of 72 in the war of succession.",
        "1835": "Medical College was started in Calcutta and it was officially opened on Feb 20.",
        "1859": "Surbhi, farmer lady of Dholi Bavli, Central India, who was arrested for helping her son Bheema Nayak in the freedom movement and was jailed in Mahamandaleshwar jail, passed away.",
        "1884": "Veer Surendra Sai, freedom fighter and revolutionary, passed away.",
        "1900": "Kondedera Madappa Kariappa, first General of independent India, was born.",
        "1918": "Srinivas Ramanujan, famous Indian scientist, was elected Fellow of the Royal Society.",
        "1919": "Sunderlal Khurana, great politician and journalist, was born.",
        "1927": "Krishan Kant, vice President of India and former Young Turk, was born at Kot Mohd. Khan, district Amritsar, Punjab.",
        "1928": "C. V. Raman invented 'Raman Effect' of scattered light, which led him in achieving the 'Nobel Prize'.",
        "1930": "Strike by workers of the Nizam state railways over bonus.",
        "1936": "Kamla Nehru, wife of Pandit Jawaharlal Nehru, great revolutionary freedom fighter and social worker, passed away near Lausanne in Switzerland.",
        "1937": "Subrahmanyan Chandrasekhar discovers the white dwarf maximum mass limit.",
        "1950": "The Finance Minister announces the setting up of the Planning Commission with Nehru and Nanda as Chairman and Deputy Chairman respectively.",
        "1951": "Karsan Devji Ghavri, cricketer (Indian lefty medium pacer early 80s), was born in Rajkot.",
        "1963": "Dr. Rajendra Prasad, the first President of India, passed away at Sadaqat Ashram, Patna.",
        "1967": "General Election ( 4th) of India ends.",
        "1968": "International City Auroville inaugurated the Aurobindo Ashram in Pondechery.",
        "1985": "M.G. Katre became the director of Central Bureau of Investigation (till 31/10/89).",
        "1987": "The National Science Day was celebrated for the first time at the ICMR Headquarters and all its Institutes/Centres in February 1987 through exhibitions, lectures, demonstration campaigns etc. (This has now become an annual event).",
        "1988": "Jaydev, famous music director, passed away.",
        "1989": "S. B. Chavan, Finance Minister, presents a Rs. 7337 crore-deficit budget for 1989-90.",
        "1994": "Budget with Tax Concessions of Rs.40.81 billion and a deposit of Rs.90.60 billion presented by Dr. Manmohan Singh in Parliament.",
        "1997": "Finance Minister P. Chidambaram presents an action-packed budget for 1997-98.",
        "1998": "The third and final phase of polling is held in 131 Lok Sabha constituencies in 10 States and one Union Territory.",
        "2000": "The Supreme Court orders notice to the former Tamil Nadu Chief Minister, Ms. Jayalalitha, on a special leave petition filed by the State Government against the Madras High Court judgment upholding the trial court's order discharging her in the \"coal import case\"."
    }
}