{
    "title": "Events for March 28",
    "events": {
        "1556": "Origin of Fasli Era (India).",
        "1645": "Har Govind Singh, Sikh Guru, died.",
        "1914": "Komagata Maru sailed from Hong Kong to Vancouver with 351 Sikhs and 21 Punjabi Muslim youths under the captaincy of Sardar Gurjeet Singh as a part of 'Ghadar' Movement.",
        "1916": "Ramkrishna Pillai, journalist and social reformer, passed away.",
        "1917": "Umesh Chandra Panigrahi, great author and journalist, was born at Raruan, Orissa.",
        "1926": "Pahelam Ratanji \"Polly\" Umrigar, cricketer (Indian batsman & captain), was born in Sholapur, Maharashtra.",
        "1941": "Netaji Subhashchandra Bose reached Berlin after his secret underground journey from Calcutta.",
        "1943": "S. Satyamurti, social reformer, politician and member of legislative council at Madras, died. He was born in Tirumayyam village in August 19, 1887.",
        "1947": "Abdul Bari, labour leader, passed away.",
        "1954": "The flight undertook its first VVIP commitment, when it carried the first Prime Minister of India, the Late Pandit Jawaharlal Nehru, from Palam to Tilpat range and back to witness the 'Fire Power Demo'. It carried wide spectrum of VVIPs, including the President, the Prime Minister, renowned statesmen, Generals, Luminaries and visiting foreign dignitaries.",
        "1956": "Tirumalai Ananthanpillai Sekhar, great Indian cricket pace-bowler (2 Tests 1982-83 little impact), was born in Madras.",
        "1963": "First meeting of the National Aeronautical Laboratory Executive Council held under the chairmanship of J R D Tata.",
        "1978": "Nafisa Joseph, Miss India Universe (1997), was born.",
        "1984": "Bhausaheb Ranade, famous freedom fighter, passed away.",
        "1986": "Extremist Sikhs kill 13 Hindus in Ludhiana, India.",
        "1990": "Bengal beat Delhi in rained-out cricket Ranji Trophy final on quotient.",
        "1991": "IAF men die in an air crash in Bangalore.",
        "1994": "Leaders attack trade protectionism.",
        "1995": "Haridev Joshi, former Chief Minister of Rajasthan and former Governor of Assam Meghalay, passed away.",
        "1996": "JKLF declared unlawful by central govt.",
        "1997": "India and Pakistan, represented by Salman Haider and  Shamshad Ahmed, Foreign Secretaries, hold official talks on issues at New Delhi.",
        "1998": "The BJP-led alliance survived its first test of trust with the support of Chandrababu Naidu's Telgu Desam Party. Jayalalitha continues to call the shots.",
        "1999": "Pakistan decides to ease visa restrictions for the aged, women and children from India in response to New Delhi's move towards visa relaxation for several categories of Pakistani nationals.",
        "2000": "Delhi police arrest Shoaib Ilyasi, producer of the crime serial ''India's Most Wanted'' for the death of his wife Anju on January 10."
    }
}