{
    "title": "Events for May 28",
    "events": {
        "1414": "Khidr Khan Syed, Governor of Lahore, replaced Daulat Khan Lodi on Delhi's throne.",
        "1883": "Vinayak Damodar Savarkar \"Veer Savarkar\", great freedom fighter, social reformer, politician and writer, was born at Bhagur village near Nasik.",
        "1895": "Bagal Bhai Madhavrao Khanderao, freedom fighter, author and painter, was born.",
        "1903": "Shantanu L. Kirloskar, great industrialist, was born at Sholapur (Maharashtra).",
        "1907": "Purohit Dingambar Vinayak (Nanasaheb), leader in Maharashtra, was born.",
        "1923": "Nandamuri Tarak Ramarao, film star, former Chief Minister of Andhra Pradesh and founder of Telgu Desam Party, was born. He  has acted in many films including 'Patal Bhairavi'.",
        "1925": "Awadh Kishore Narain, educationist, was born.",
        "1930": "Bhagwaticharan Vohra, great revolutionary freedom fighter, died  near the banks of Ravi river during a bomb testing.",
        "1950": "Bhagwaticharan, great revolutionary, passed away.",
        "1963": "Estimated 22,000 die in another cyclone in Bay of Bengal (India).",
        "1964": "A slow-moving funeral cortege containing the body of Jawaharlal Nehru inched through the streets of New Delhi today. A million and a half Indians lined the route to pay final respects to their beloved leader.",
        "1965": "Fire and explosion at Dhori mine in Dhanbad, India kills 400.",
        "1966": "B. S. Chawla was appointed as the Narcotics Commissioner of India. He headed this office till 21-02-1973.",
        "1968": "Bhagwan Gopinathji Bhan, was a mystic saint of early 20th century Kashmir in India. He has been called a \"jivanmukta\" (liberated soul) or \"Aghoreshwar\" and his spiritual state has been described as \"Shambhavi Avastha\" (state of Shiva), died. He was a great devotee of Shiva and Shakti and took intense \"\"Sadhana\"\". His disciples and devotees set up an ashram at Kharyar in Srinagar in his name.",
        "1970": "All India Trade Union Congress was divided.",
        "1972": "Edward VIII, King of Great Britain/N Ireland/emperor (India 1936), passed away at the age of 77.",
        "1978": "The kiss comes to the Hindi screen in 'Love Sublime,' and is seen as a sign of what the govt. calls greater 'creative freedom,' after Indira Gandhi's authoritarian rule at Bombay.",
        "1988": "The first Cultural Exchange Programme was signed between India and China.",
        "1989": "Kerala diocese of Marathakavalli was the first Christian priest in India.",
        "1992": "Indo-US naval exercises begin.",
        "1996": "BJP Govt. incapable of assembling a majority after two weeks. A left-wing coalition takes over headed by new prime minister H. D. Deve Gowda, Janata Dal leader and United Front coalition government. He held this office till 12 April 1997.",
        "1997": "Former Union Ministers Arjun Singh, N.D. Tiwari, R.K. Dhawan and Madhavrao Scindia discharged in the Jain hawala case by special judge V.B. Gupta.",
        "1998": "India takes retaliatory measures against Australia for its unilateral action."
    }
}