{
    "title": "Events for September 28",
    "events": {
        "1827": "A few mountain battery trains flourished and kept the Indian component alive as part of the Royal artillery. Recently, it has been established that 8 Company Bombay Artillery survived axing and is now 5 (Bombay) Mountain Battery. This day is now celebrated as the Raising Day of the Regiment of Artillery.",
        "1837": "Bahadur Shah-II ascended the throne and became the emperor of Delhi at the age of 62 following the death of his father Akbar Shah-II.",
        "1909": "Jairaj, famous film actor, was born. His first film was 'Sparkling Youth' (1930). He was a receipant of Dada Saheb Phalke Award. Some of his films are 'Fight unto Death', 'All for love', 'Bhawani No Bhog', 'Pearl', 'Queen of Faries', 'The Enemy', 'My Hero'.",
        "1924": "In penance for riots, Gandhi, on hunger strike in Delhi, proclaimed he would break his fast only at death.",
        "1929": "Lata Mangeshkar, great playback singer, was born.",
        "1940": "Pundit Sunder Lal Sharma, freedom fighter and social reformer, passed away. He was also known as \"The Chhattisgarh Gandhi\".",
        "1954": "137 people were killed when an Express Train fell from a flood-damaged bridge near East of Hydrabad.",
        "1964": "The simmering dispute of India and Pakistan between the Hindus and Muslims erupted again in Kashmir. Fighting was also reported on this day in the Indian province of Rajasthan. China, which supported Pakistan in the dispute, sent massed troops on its border.",
        "1965": "India-Pakistan hostility erupts into a war lead by Pakistan.",
        "1984": "First floodlights lit ODI between India and Australia held outside of Australia at New Delhi.",
        "1985": "The first Indian Army expedition, sailing around the world in a small 37 feet fibre glass yacht named \"Trishna\", sailed off from Bombay. (10-1-87).",
        "1991": "Shankar Guha Niyogi, an active trade union leader of Madhya Pradesh, was shot dead by unknown assailants.",
        "1993": "Gas pipe below Karakas National Highway exploded claiming 58 lives.",
        "1996": "Sukh Ram sent to Tihar jail in assets case.",
        "2000": "Marion Jones wins the 200m gold medal at Sydney."
    }
}