{
    "title": "Events for December 29",
    "events": {
        "29\tDecember\t1530": "Babur's eldest son Humayun ascended the throne. He was, doubtless, a man of parts.",
        "29\tDecember\t1844": "W.C. Bonerjee, first President of the Indian National Congress, was born in Kidderpore, Calcutta.",
        "29\tDecember\t1885": "A group of middle-class intellectuals in India, some of them British, found the Indian National Congress to be a voice of Indian opinion to the British government. This was the origin of the later Congress Party which was founded in Bombay.",
        "29\tDecember\t1904": "K. V. Puttappa, famous Kannada poet and Gyanpeeth awardee, was born at Hirekodage.",
        "29\tDecember\t1909": "Congress at Lahore adopts resolution praising Indians' struggle in South Africa and urged ban on indenture.",
        "29\tDecember\t1927": "Hakim Ajmal Khan, freedom fighter, litterateur and a true patriot, died.",
        "29\tDecember\t1938": "Mahavir Prasad Dvivedi, famous litterateur, writer, poet and editor, died at the age of 74.",
        "29\tDecember\t1949": "Syed Mujtaba Hussain Kirmani, cricketer (Indian keeper after Engineer), was born in Madras.",
        "29\tDecember\t1953": "The States Reorganisation Commission.",
        "29\tDecember\t1957": "8,000 ton cruiser INS Mysore commissioned.",
        "29\tDecember\t1959": "Durgapur Iron Plant inaugurated.",
        "29\tDecember\t1965": "First Indian-made tank 'Vijayanta' rolled off the Avadi Heavy Vehicles factory.",
        "29\tDecember\t1968": "Chunilal Kalidas Madiya, famous Gujrathi playwright, story writer and novelist, died.",
        "29\tDecember\t1972": "Construction work of Metro Train in Calcutta commenced.",
        "29\tDecember\t1975": "D.K. Barooah elected Congress President.",
        "29\tDecember\t1977": "World's biggest Drive-In theatre started screening in Bombay.",
        "29\tDecember\t1983": "Gavaskar makes the highest Test Cricket score by an Indian, 236* vs West Indies.",
        "29\tDecember\t1984": "Rajiv Gandhi claims for Indian Prime Minister post after his landslide majority in 8th General Elections.",
        "29\tDecember\t1989": "Prasar Bharati Bill and Lok Pal Bill introduced in Lok Sabha.",
        "29\tDecember\t1996": "Trishul', surface-to-air missile successfully tested.",
        "29\tDecember\t1997": "Sonia Gandhi stepped into active politics."
    }
}