{
    "title": "Events for January 29",
    "events": {
        "1597": "Maharana Pratap Singh of Udaipur, great freedom fighter, soldier and revolutionary, passed away. His son Amar Singh succeeded him.",
        "1780": "Hicky's Bengal Gazette, the first news paper in India,  was published in English in Calcutta .",
        "1781": "First Newspaper, J.A.Hickey's Bengal Gazette - January 29, 1781.",
        "1853": "Madhusudan Rao, modern writer in Oria language, was born.",
        "1870": "'Hicleche Bengal Gazette' newspaper published in India.",
        "1896": "Swami Paranabananda Brahamachari, founder of `Bharat Sevashram Sangha', was born in Bajitpur village of Faridpur district. He took 'sanyas' in 1924.",
        "1912": "Judge A.N. Ray, Chief Justice and Supreme Court of India, was born.",
        "1931": "Gandhiji sails for England as Congress delegate to Second Round Table Conference. This conference was attended by Madan Mohan Malaviya and Sarojini Naidu.",
        "1939": "Ramkrishna Mission Sanskritik Sansthan (Institute of Culture) was established.",
        "1948": "Angry refugees ask Gandhiji to retire to the Himalayas.",
        "1953": "Dattatreya Balkrishna Kalelkar \"Kaka Saheb\" was appointed as the Chairman of the Backward Classes Commission.",
        "1955": "'Bhartiya Kamgar Kisan Party' established.",
        "1968": "Laxmidas Purshottamdas Jai, one Test for India, died.",
        "1975": "West Indies won the fifth test against India after winning the exciting cricket series 3-2.",
        "1976": "Parliament approves permanent government and censorship of newspapers at New Delhi.",
        "1977": "Judge Mirza Hameedullah Beg became the Chief Justice of India. He helded this office till 21/02/1978.",
        "1979": "Tamil Nadu Expess, India's first Jumbo passenger train, was flagged off from New Delhi Railway Station for Madras.",
        "1983": "Piloo Mody, veteran Parliament member and senior leader of Janata Party, passed away.",
        "1992": "India and Israel decide to establish full diplomatic relations.",
        "1993": "Test debut of Vinod Kambli, prolific Indian batsman.",
        "1994": "Air India and Indian Airlines converted into companies.",
        "1996": "S.R. Bommai was replaced by Laloo Prasad Yadav as Janata Dal president.",
        "1997": "Fire engulfs most of the three top floors of the Express Towers, skyrise building owned by Indian Express group in Mumbai.",
        "1998": "Suicide by more than 50 farmers reported in the Telangana region in the past few days.",
        "1999": "Alok Kumar of Punjab defeated Devendra Joshi of Maharashtra at the IIT complex at New Delhi."
    }
}