{
    "title": "Events for October 29",
    "events": {
        "1851": "British Indian Association was established in Bengal with Radha Kanta Dev as president and Devendranath Tagore as the Secretary.",
        "1920": "Jamia Milliya Islamia was founded by Dr. Jakir Husain and his collegues at Aligarh. 'Khilafat' and the Non- Cooperation Movement were an integral part of  policy animating.",
        "1929": "Vyankat Chalaiyya Manipalli Narayan Chalaiyya, Chief Justice of Supreme Court, was born.",
        "1930": "Pandit Jawaharlal Nehru is sent back to prison for two yearrs following a speech he made at Allahabad the day after his release from jail.",
        "1935": "Narendra Kumar Chhajerh, great industrialist, was born.",
        "1947": "Mysore's popular ministry sworn in.",
        "1952": "Amalgamation of the Steel Corporation of Bengal with Indian Iron and Steel Company Ltd. to be effective from 1st January 1953 under the latter's name.",
        "1958": "Dhondo Keshav Karve, first social and educational reformer of Maharashtra, honoured by Bharat Ratna Award.",
        "1961": "New All India Muslim League was established.",
        "1962": "China attacked India.",
        "1964": "Priceless and irreplaceable gems, including the famed 'Star of India' of 563.35 carats and 2.5 inches in diameter, were stolen from the American Museum of Natural History, New York, USA, in a daring burglary. An alarm system was discontinued years ago as was the all-night guard in the gem hall, both for reasons of economy. The jewels were uninsured due to high-priced premiums. There were other jewels too that were also robbed during this time..",
        "1967": "Kurtkoti Lingangaunda, great Indian Philosopher, passed away.",
        "1971": "Cyclone and tidal waves struck Orissa state claiming 10,000 lives.",
        "1988": "Kamaladevi Chattopadhyaya, freedom fighter and political leader, passed away.",
        "1990": "Vinod Mehra, famous Hindi film actor, died.",
        "1991": "Barister Waman Barlinge (Dadasaheb), great freedom fighter, former Rajya Sabha member and Chief Minister of Madhya Pradesh, passed away.",
        "1992": "Komar Singh, the first Indian Ambassador to Israel, presented credentials to President Chain Herzog in Jerusalem.",
        "1996": "Kamini' (Kalpakkam Mini), a 30 KW research reactor which uses man-made Uranium-233 as fuel and the only working reactor of its kind in the world, attains 'criticality'.",
        "1997": "P. Chidambaram, Finance Minister, says Indian rupee will be made fully and freely convertible by year 2000.",
        "1999": "L .K. Advani, Home Minister, says the Centre is in touch with cyclone-hit states.",
        "2000": "Jitendra Prasada, senior Congress leader, files nomination papers for the party presidential polls setting the stage for a contest against the incumbent, Ms. Sonia Gandhi."
    }
}