{
    "title": "Events for November 29",
    "events": {
        "29\tNovember\t1644": "The Massachusetts General Court issued a call for local pastors to learn the dialects of neighboring Indian tribes as an aid toward converting them to the Christian faith.",
        "29\tNovember\t1798": "Neplus Naresh Fardinad Chaturth announced that they will fight against France.",
        "29\tNovember\t1869": "Amritlal Vithaldas Thakkar (Thakkar Bappa), social reformer of Gujrat and right hand of Gandhiji in socially segregated Harijans, was born at Bhavnagar, Saurashtra.",
        "29\tNovember\t1916": "Vasant Shridhar Vaidya, great industrialist, was born at Phaltan.",
        "29\tNovember\t1926": "Prabhakar Narayan Padhye (Bhau Padhye), great journalist and litterateur, was born.",
        "29\tNovember\t1928": "Krishnaji Narayan Aathaly, great Marathi litterateur and editor, passed away.",
        "29\tNovember\t1945": "Ugoslaviya in Rajshahi was ended.",
        "29\tNovember\t1947": "The Nizam of Hyderabad said that he would not consider acceding to either dominion, but would agree to a 'standstill arrangement' with India. The agreement is accepted by the Indian government.",
        "29\tNovember\t1948": "Assembly bans discrimination against untouchables.",
        "29\tNovember\t1952": "First international organization for birth control founded in Bombay.",
        "29\tNovember\t1953": "Benegal Narsing Rau, foremost Indian Jurist of his time, passed away at Zurich. He performed some very prominent duties towards the nation. He was Prime Minister of Jammu and Kashmir and a  judge at the Permanent Court of International Justice at Hague.",
        "29\tNovember\t1959": "Govind Sakharam Serdesai, Jagirdar Raobahadur, passed away.",
        "29\tNovember\t1961": "First cosmonaut of the world, Yuri Gagarin of Russia, came to India.",
        "29\tNovember\t1962": "Haryana achieved their target of supplying electricity to 100\\% villages.",
        "29\tNovember\t1988": "Rajiv Gandhi, grandson of Jawaharlal Nehru, resigned as Prime Minister of India, a country which had been ruled by his family for all but five of its 42 years of independence. The end of the dynasty came after elections that were both violent and inconclusive, neither Gandhi's Congress party nor the opposition National Front received a clear majority, although the latter had a few more votes. The only real winner was the fundamentalist Hindu party, Bharatiya Janata, which is now the power broker. If the National Front wants to rule, its leader V.P. Singh needs the religious group's support.",
        "29\tNovember\t1989": "Voters oust Gandhi and Congress party.",
        "29\tNovember\t1991": "Test Cricket debut of Javagal Srinath vs Australia at Gabba.",
        "29\tNovember\t1993": "Jahangir Ratanji Dadabhai Tata \"J.R.D. Tata\", Bharat Ratna awardee, Father of Modern Indian Industries and founder of Indian Aviation industry, passed away at 89 in Geneva.",
        "29\tNovember\t1994": "M.H. Kania, former Chief Justice of India made Chairman of the 14th Law Commission.",
        "29\tNovember\t1996": "The Indian Journal of Medical Research brought out special issues, as part of the 85th year celebrations of ICMR, on Nutrition Research (November 1995) and Diarrhoeal Diseases (July, 1996). The ICMR Bulletin also brought out special issues on such topics as Nutrition, Tuberculosis, AIDS, Tribal Health, etc. so as to coincide with the theme selected for a particular month as part of the celebrations. As part of the global theme initiative coordinated by JAMA, USA, the January 1996 issue of the ICMR was devoted to 'Emerging and Re-emerging Infections'.",
        "29\tNovember\t1999": "Delhi HC dismisses the CBI plea against Jain brothers in Hawala case.",
        "29\tNovember\t2000": "India strikes a counter-trade oil deal with Iraq as part of an effort to build a strategic relationship with Baghdad."
    }
}