{
    "title": "Events for March 29",
    "events": {
        "1561": "Akbar attacked on Malwa at Sarangpur and defeated Bajbahadar.",
        "1849": "Maharaj Dulip Singh left the throne of Punjab that once belonged to his late father Ranjit Singh  and was then occupied by the East India Company. The Britishers had captured it after defeating the Sikh Army at Amritsar.",
        "1857": "Sepoy Mangal Pandey shot the first bullet of 1857 Indian mutiny in the barracks of Barrackpur near Calcutta against British Empire. This was the starting of  the mutiny.",
        "1869": "Sir Edwin Lutyens, Builder of Rashtrapati Bhavan and England's most outstanding architect of his time, was born.",
        "1914": "Sudhir Gupta, famous Hindi poet and educationist, was born in Kalasgram, Bangladesh.",
        "1932": "Sundaram Gundibalirama, right-hand batsman and right-arm medium fast bowler, was born at Udipi in Karnataka.",
        "1939": "Hanumant Singh, cricketer (14 Tests for India-century on debut), was born in Banswara.",
        "1942": "Britain offered dominion status to India after the war if  it cooperated now.",
        "1943": "Shaheed Laxman Nayak, freedom fighter and leader, was hanged at Berhampur Jail.",
        "1952": "India enters into a war with Japan.",
        "1954": "Indian Institute of Public Administration inaugurated.",
        "1963": "Siyaramsharan Gupt, great autor of Hindi language, died.",
        "1970": "Union Government revises the percentage of reservation in service for SC\\STs from 12.5\\% to 15\\%. Orders to be effective from 25 March.",
        "1977": "S. N. Mathur became the director of Central Bureau of Investigation (till 02/05/77).",
        "1978": "Jayasinghrao Mansinghrao Ghorpade, cricketer, 8 Tests for India and 229 runs, passed away.",
        "1979": "Delhi beat Karnataka by 399 runs to win Cricket's Ranji Trophy.",
        "1982": "Delhi (707) beat Karnataka (705) on 1st innings to win Ranji Trophy.",
        "1989": "Central Institute of Fisheries Education gets the distinction of becoming the first Fisheries University in India.",
        "1990": "Adoor Bhasi, Malayalam film actor, passed away.",
        "1992": "Shri Anand Rishiji Maharaj 1008 , Acharya Samrat of  'Jain Shraman Sangh', passed away.",
        "1995": "Harindra Dave, chief editor of Janmabhumi Group and Gujrati author, passed away.",
        "1996": "SC asks All India Indira Congress to modify its name as All Indira Congress (Tiwari).",
        "1998": "The new govt. wins the vote of confidence in the Lok Sabha.",
        "1999": "A massive earthquake in the Garhwal region of Uttar Pradesh in the inner Himalayas claims 85 lives and more than 130 injured."
    }
}