{
    "title": "Events for May 29",
    "events": {
        "1658": "Dara Shukoh was utterly defeated by Aurangzeb in the battle of Samugarh near Agra.",
        "1906": "Terence Hanbury White, novelist (England Have My Bones), was born in Bombay.",
        "1915": "Sita Ram Surajmal Jajoo, social reformer and politician, was born at Neemuch Cantt, M.P.",
        "1933": "Kishorilal Goswami, famous Hindi novelist, passed away.",
        "1936": "Gandhi's eldest son creates a controversy as he converts to the Muslim faith.",
        "1947": "Establishment of Indian Standard Institution.",
        "1952": "The Socialist Party and Krishak Mazdoor Praja Party decide to form a single parliamentary party.",
        "1953": "Ranji Nanan, cricketer (Trinidad off-spinner, 1 Test v Pakistan 1981), was born.",
        "1957": "Satish Kumar Sareen graduated from the first batch of the JSW and went onto the AFFC for flying training.",
        "1965": "Indian Everest team sets a world record by climbing the Everest for the fourth time.",
        "1967": "First blowdown of the 4 ft trisonic tunnel; the tunnel with all auxiliary facilities such as compressor system, electrical sub-station, design office and model fabrication shop is formally set up and commissioned by National Aeronautical Laboratory.",
        "1968": "Dara Singh becomes the world wrestling champion.",
        "1972": "Prithviraj Kapoor, famous film actor, passed away.",
        "1973": "Jo Paul Ancheri, Indian Soccer(Football) player, was born in Trichur, Kerala. He was recognised as Indian Player of the Year in 1994.",
        "1977": "Dr. Suniti Kumar Chatterji, president of Sahitya Academy, National Professor and eminent linguist, passed away.",
        "1979": "Perminder Singh Sangha, Soccer(Football) player, was born in Oslo, Norway.",
        "1982": "Naval Academy at Ezhimala, Kerala, was approved by Union Cabinet.",
        "1987": "Chaudhary Charan Singh, former Prime Minister, leader of farmers and freedom fighter, passed away at the age of 85 yrs.",
        "1991": "P.V. Narasimha Rao elected President of Congress (I).",
        "1992": "Agni-India's IRB missile successfully test-fired from Orissa coast for the first time since May 22, 1989.",
        "1993": "Ramesh More, Shiv Sena MLA,  was murdered."
    }
}