{
    "title": "Events for June 29",
    "events": {
        "1533": "Chaitanya Maha Prabhu, vaishnav Sant, passed away. His mortal remains at Puri.(9/7or 29/6).",
        "1757": "Mir Zafar was installed on the throne as the Nawab of Bengal, Bihar and Orrisa from Murshidabad.",
        "1857": "Battle at Chinhat (Indies rebel under Barkat Ahmed beat British).",
        "1864": "Dr. Asutosh Mukherjee, great judge, educationist and lawyer of Bengal, was born at Calcutta.",
        "1873": "Micheal Madhusudan Dutta, first Bengali modern poet, died.",
        "1893": "Prasanta Chandra Mahalanobis, physics, mathematics expert and founder of Indian Statistical Institute, was born at Calcutta.",
        "1901": "Amal Kumar Sarkar, Chief Justice of Supreme Court of India, was born.",
        "1908": "Pratapsing Gaekwad, Prince of Baroda, was born.",
        "1909": "Pandit Motilal, social reformer and freedom fighter, was born.",
        "1924": "Ezra Laderman, NYC, composer (Jacob & the Indians), was born.",
        "1966": "Damodar Dharmanand Kosambi, famous mathematics expert, died.",
        "1976": "Sandhya Chib, Miss India-Universe (1996), was born.",
        "1991": "A 32-member Left Front cabinet led by Jyoti Basu sworn in in West Bengal.",
        "1992": "Congress (I) nominates K. R. Narayanan for the Vice-Presidentship.",
        "1993": "24 jawans were killed in ambush by NSCN militants in Manipur.",
        "1997": "Anand wins Frankfurt chess classic '97 title in Germany.",
        "1998": "Government decides to grant full statehood for Delhi and create three new States namely Uttaranchal, Vananchal and Chattisgarh.",
        "1999": "An Indian High Commissioner member N. R. Doraiswamy is beaten up by Pakistani intelligence operatives.",
        "2000": "The Election Commission derecognises seven regional parties in some states -- Samata Party in Haryana, Shiv Sena in Dadra and Nagar Haveli and the RJD in Manipur, NTR-Telugu Desam Party in Andhra Pradesh, the Samajwadi Janata Party (Rashtriya) in Chandigarh, the United Minority Front in Assam and the Haryana Vikas Party in Haryana-- These will remain registered but unrecognised parties."
    }
}