{
    "title": "Events for July 29",
    "events": {
        "1748": "Boscawen landed  25 km south of Pondicherry.",
        "1802": "Agreement between Gaikwad of Baroda and Britishers about the army.",
        "1876": "Indian Science Congress Association was established in Bowbazar Street of Calcutta.",
        "1884": "Tyagraj Paramshiv Kailasam, leading playwright of Kannad language, was born.",
        "1891": "Ishwar Chandra Vidyasagar, great Indian educationist, social reformer, litterateur and Hindi writer, passed away in Calcutta.",
        "1901": "Rudyard Kipling, the renowned author of stories and poems about colonial India and an unofficial spokesman for the British Empire, joined the rising chorus of criticism in regard to Britain's conduct in the increasingly unpopular Boer War.",
        "1904": "Jehangir Ratanji Dadabhai Tata,  president of Tata industrial group, was born in Paris, France. He was the first pilot of India to be conferred with the Bharat Ratna.",
        "1911": "Mohan Bagan became the first Indian football team to win the I.F.A. Shield.",
        "1927": "Madhavsingh Solanki, one of the leaders in Gujarat, was born.",
        "1979": "Choudhary Charan Singh was sworn in as the fifth Prime Minister of India heading the Janata (S)-Congress coalition. He held this office till January 14, 1980. Jagjivan Ram became the leader of the Opposition in the Lok Sabha.",
        "1980": "India won Gold Medal in Hockey at Moscow Olympics.",
        "1983": "First Pilot-less Aeroplane of India was tested successfully by the Aeronautical Development Establishment near Kolar.",
        "1984": "Troops were sent to Hyderabad to quell communal riots.",
        "1987": "India and Sri Lanka sign peace accord at Colombo in a bid to end the 5-year old ethnic trouble. This stance taken thereafter by the LTTE added several dimensions to the scenario. It was a multi-purpose role that the Navy has been required to play.",
        "1988": "Syed Modi, 28-year national badminton champion, was shot dead at K. D. Singh Stadium in Lucknow.",
        "1991": "Vazhappadi K. Ramamurthy, Union Labour Minister, resigns on account of differences on Cauvery water issue.",
        "1993": "Two bills seeking to delink religion from politics and to empower the EC to debar parties with religious names introduced in Lok Sabha.",
        "1994": "Opposition stalls parliament proceedings over the 'Action Taken Report' on JPC finding.",
        "1995": "Anup Jalota, famous Bhajan and Ghazal singer, was born.",
        "1996": "Aruna Asaf Ali, freedom fighter and player of important role in Quit India Movement, passed away in New Delhi. She was awarded with Bharat Ratna.",
        "1997": "Rabri Devi inducts 60 ministers, including 22 of cabinet rank, thus raising strength of her Council of Ministers to 74.",
        "1998": "The Pratapsingh Rane Ministry in Goa is dismissed. The Governor instals Dr. Wilfred Desouza as Chief Minister.",
        "1999": "Bandh in Mumbai to protest against the verdict barring Bal Thackeray from voting and contesting any election till December 10, 2001."
    }
}