{
    "title": "Events for August 29",
    "events": {
        "1612": "Battle at Surat in India; English fleet beats Portuguese.",
        "1880": "Madhav Shrihari Ane, greatest Freedom fighter, was born.",
        "1905": "Major Dhyanchand was born in a Rajput family at Prayag at Uttar Pradesh. He is remembered as a Master of Hockey. India celebrates this day as National Sports Day.",
        "1923": "Sir Richard Attenborough, famous actor and director (Gandhi, Young Winston), was born.",
        "1926": "Ramkrishna Hegde, former Central Cabinet Minister and Chief Minister of Karnataka, was born.",
        "1928": "Hiralal Ghisulal Gaikwad, cricket all-rounder who played the only test vs Pakistan, was born in Nagpur.",
        "1931": "Gandhi arrives in London for second Round Table Conference on India.",
        "1947": "Dr. Babasaheb Ambedkar became the President of Constitution Council.",
        "1956": "India gets $ 360 million loan as food aid.",
        "1959": "India sends troops to Tibet border to block the Chinese.",
        "1974": "Lokdal Party established under the presidency of Chaudhary Charan Singh.",
        "1975": "Adinath Lahiri, leading geologist, passed away.",
        "1976": "Poet Kazi Nazrul Islam of Bengal, great revolutionary, died on his visit to Dhaka in Bangladesh.",
        "1982": "Shree Maa Anandmayee of universal fame passed away. Her body was laid to rest at Shree Anandamayee Ashram in Kankhal.",
        "1984": "Indian Airlines Boeing 737 with 68 passengers and a crew of 6 hijacked in Lahore.",
        "1991": "Second operational Indian Remote Sensing satellite (IRS-1B) launched by a Russian launch vehicle, Vostok. It is still in service.",
        "1992": "Eco-mark introduced in Indian market to distinguish eco-friendly products, .",
        "1993": "Tamil refugees leave Madras for Sri Lanka apparently on their own free will.",
        "1994": "Tusharkanti Ghosh, world famous Indian journalist, passed away.",
        "1995": "National Sports Day declared.",
        "1997": "B.M. Sumavathi creats national record in heptathlon in the Federation Cup athletics.",
        "1998": "Sachin Tendulkar receives the Rajiv Gandhi Khel Ratna award and Joginder Singh Saini receives the Dronacharya award, while several other leading sporstmen receive Arjuna award from President K.R. Narayanan in Delhi.",
        "2000": "Supreme Court releases of 115 'Veerappan aides' on bail or otherwise till further orders."
    }
}