{
    "title": "Events for September 29",
    "events": {
        "1708": "British East India Company and New East India company merged.",
        "1725": "Robert Clive, one of the founders of British empire in India and diplomat, was born.",
        "1755": "Robert Lord Clive founded the British empire in India.",
        "1836": "Chamber of Commerce and Industry was established in Madras.",
        "1906": "Chhajju Ram, social worker and teacher, was born at Manawar, Chhamb.",
        "1907": "Labour MP James Keir Hardie accuses UK of running India 'like the Czar runs Russia'.",
        "1914": "Japanese vessel 'Kamagata Maru' reached Baj Baj near Calcutta from Vancouver carrying Indian revolutionaries.",
        "1930": "Ramnath Baburao Kenny, cricketer (batted in 5 Tests for India in 1950's), was born in Bombay.",
        "1932": "Hamid Dalwai, Muslim social reformer, was born.",
        "1942": "The British police shot Matangini Hazra, a 72-year old woman of Tamluk town in Midnapur district, when she was leading the flag at Tamluk in August movement procession.",
        "1959": "Arati Saha successfully swam the English Channel. She was the first Asian lady to achieve the feat.",
        "1964": "1,000 people were killed as a reservoir burst.",
        "1970": "Union Carbide India Ltd in Bombay was commissioned Reclamation Plant Sewage Water of India for commercial use.",
        "1971": "Cyclone & tidal wave off Bay of Bengal kills as many as 10,000 people.",
        "1977": "India and Bangladesh signed settlement for distributing Ganga river water.",
        "1981": "Delhi-Srinagar Indian Airlines Boeing 737 flight was diverted to Lahore, Pakistan by five Khalistan activists of the Dal Khalsa International. On board there were 117 passengers out of which 66 were freed on arrival in Lahore.",
        "1988": "1988 Nobel Peace Prize for U.N. Peace-Keeping Forces.",
        "1990": "Central Government adopt a three-pronged strategy to create additional 30 lakh jobs outside the government sector over the next five years.",
        "1991": "Ustad Yunus Hussain Khan, famous singer of  'Agra Gharana', passed away.",
        "1992": "Ramesh Krishnan and Leander Paes put India into the World round of 16 nations in the Davis Cup tennis by defeating Britain (4-1).",
        "1993": "National Human Rights Commission set up.",
        "1994": "Gulf nations suspend Indian flights on account of plague epidemic.",
        "1996": "Water from Krishna river (AP) released for Madras.",
        "1997": "IRS-1D, fourth Indian Remote Sensing satellite, successfully launched off by PSLV-CI, the country's first operational polar satellite launch vehicle, from Sriharikota. With this launch, India became a member of the exclusive club of nations capable of launching the heavier class of satellites.",
        "1998": "ISRO successfully launches its largest sounding rocket, Rohini (RH-560 mk, 11 total payload, 127 kg).",
        "1999": "Jaswant Singh, External Affairs Minister, meet his Pakistani counterpart Sartaj Aziz meet at the SAARC ministerial meeting.",
        "2000": "Union Minister of State for Agriculture S.B.P.B.K. Satyanarayana Rao quits the from Cabinet."
    }
}