{
    "title": "Events for January 2",
    "events": {
        "2\tJanuary\t1754": "Robert Clive again attacked and annexed Calcutta from Nawab Siraj-ud-Daulah.",
        "2\tJanuary\t1757": "After the Battle of Plassey, Clive, Britisher, defeated Siraj-ud-Daulah, Mir Jafar, Nawab of Bengal and re-captured Calcutta, after it had been seized by the Nawab of Bengal who had used the \"Black Hole\" to imprison British captives.",
        "2\tJanuary\t1878": "Mannathu Padmanabhan, great social worker and first president of the Tranvancore Devasworn Board, was born at Perunna village, Kerala State.",
        "2\tJanuary\t1899": "Monks started living in Belur Math.",
        "2\tJanuary\t1905": "Jainendra Kumar, famous Hindi novelist and patriot, was born.",
        "2\tJanuary\t1930": "Mazharul Haque, greatest social worker, politician, nationalist, poet, journalist and writer, died.",
        "2\tJanuary\t1932": "Sant Harchand Singh Longowal, famous Ragi and reluctant politician, was born in Sangrur's backward Gadarhiani village.",
        "2\tJanuary\t1943": "Vir Bhai Kotwal sacrificed his life.",
        "2\tJanuary\t1947": "Mahatma Gandhi met Lord Bevin, the personal emissary of British Prime Minister Winston Churchil, in Delhi. Beven is reported to have told the great man, ''Eighteen languages, 500 dialects, some 30 religions, a million Gods and Goddesses, 300 million individuals, an infinity of castes and sub castes, and a population (that is) practically illiterate and half of which (are) beggars or thieves... Good luck, sir! Such a nation is ungovernable! It'd take you centuries to get anywhere!''. Gandhiji wrapped his large, white shawl a little more closely around him, and modestly replied, 'India has eternity before her.. and \"All around me is utter darkness\".",
        "2\tJanuary\t1948": "Nehru threatens Indian action to stop Pakistani raids into Kashmir.",
        "2\tJanuary\t1953": "Government set up a Board of Editors under Dr. Syed Mahmood to prepare a history of Freedom Movement in India.",
        "2\tJanuary\t1959": "Kirtivardhan Bhagwat Jha Azad, cricketer (Indian off-spin all-rounder in 7 Tests 1981-83), was born in Purnea, Bihar.",
        "2\tJanuary\t1960": "Raman Lamba, cricketer (Indian opening batsman 1986-87), was born in Meerut.",
        "2\tJanuary\t1964": "Raichaudhary Ambikagiri, nationalist Asamia poet, died.",
        "2\tJanuary\t1967": "University established at Berhampur in Orrisa State.",
        "2\tJanuary\t1973": "General S. H. F. J. Manekshaw appointed as Field Marshall.",
        "2\tJanuary\t1979": "Gavaskar gets twin tons for India for the third time (vs West Indies).",
        "2\tJanuary\t1987": "Dr. Harekrushna Mahtab, great industrialist, leader and former Chief Minister of Orissa, died.",
        "2\tJanuary\t1990": "Election panel made one member body again; Election Commissioners S. S. Dhanoa and V. S. Seigell removed.",
        "2\tJanuary\t1991": "Thiruvananthapuram airport declared India's fifth International Airport.",
        "2\tJanuary\t1992": "Central Ministers Cabinet approved that elections will take place after the death of  any independent candidate.",
        "2\tJanuary\t1993": "Allahabad court allows 'darshan' at Ayodhya.",
        "2\tJanuary\t1994": "Warden's in Arambaug, India lead about a fifty hungry and bruised elephants into a forest for temporary shelter. After a week, the herd strayed from a santuary, stampeding villagers and terrorising peasants.",
        "2\tJanuary\t1997": "Bihar wins team titles in both men's and women's sections in national archery. Limba Ram and Purnima Mahato, both of Bihar, win individual crowns in men's and women's sections respectively. Turkey's `Pocket Hercules', weightlifter Naim Suleymanoglu, who captured three Olympic gold medals, calls it a day in Ankara.",
        "2\tJanuary\t2000": "Sarat Chandra Chatterjee, author of timeless classics 'Charitraheen' and 'Grihadaha',  chosen novelist of the century in an online poll conducted by a literary magazine."
    }
}