{
    "title": "Events for October 2",
    "events": {
        "1422": "Firuz Shah Bahmani died.",
        "1845": "First Shipping Company of India started.",
        "1869": "Mohandas Karamchand Gandhi (Mahatma Gandhi) born to a Bania (trading caste) family at Porbander, Kathiawar. He was the youngest of the three sons of Karamchand alias Kaba Gandhi, Prime Minister successively in Porbunder, Rajkot and Vankaner States, and his fourth wife Putlibai.",
        "1904": "Lal Bahadur Shastri, the second Prime Minister of India (1964-66), was born in Mughalsarai near Benaras in Uttar Pradesh.",
        "1906": "Raja Ravi Verma died at Attingal near Trivandrum, Kerala. He is remembered for his artistic work in 'Ram Panchayatan', 'Vishwamitra-Menaka', 'Shakuntala writing a letter', 'Shiv Parvati'. A commemorative stamp was issued by the Postal Department on April 29, 1971 in his honour.",
        "1910": "D. Arkasomayaji, educationist, was born at Rajahmundry, Andhra Pradesh.",
        "1911": "Ambat Menon, great educationist, was born at Chittore, Kerala .",
        "1929": "Mahatma Gandhi made the Navjivan publication a charitable trust.",
        "1930": "Jayasinghrao Mansingrao Ghorpade, cricketer (8 Tests for India 1952-59 with little impact), was born in Panchgani, Maharashtra.",
        "1934": "Indian Naval Force was established.",
        "1939": "Budhisagar Krishnappa Kunderan, cricketer (Indian keeper-batsman of 60's), was born in Mangalore.",
        "1942": "Menka Devi, freedom fighter, was arrested by the police when she and  her friends were carrying out Gandhi Jayanti procession. She was tortured with cigar butts and the administration set her house on fire.",
        "1944": "Gandhiji was presented a purse of Rs 110 lakhs (£ 8,25,000) for Kasturba Memorial on  his 75th birthday.",
        "1950": "Persis Khambatta, famous actress (Star Trek, Megaforce), was born in Bombay.",
        "1951": "Dr. Shyamprasad Mukharjee established Bhartiya JanSangh Party.",
        "1952": "Community Development Programme started.",
        "1954": "Chandernagar, former under French possession, was made a part of West Bengal.",
        "1955": "Nehru inaugurated an Integral Coach factory at Perambur.",
        "1957": "All India Scheduled Caste Federation formally dissolved and a new political party 'Republican Party of India' was formed.",
        "1961": "Indian Limited Shipping Transport Corporation established.",
        "1969": "Gandhi's birth centenary celebrated all over the country.",
        "1971": "Gandhi Sadan was handed over to the nation.",
        "1972": "Broadcasting of Mumabi Doordarshan started.",
        "1975": "Kumaraswami Kamaraj, great freedom fighter, social reformer, political leader and member of the Lok Sabha, died in Madras.",
        "1979": "Operation (Milk) Flood-II launched.",
        "1982": "Chintaman Dwarkanath Deshmukh, former Finance minister of India, died.",
        "1986": "Rajiv Gandhi survives assassination attempt made by Sikh extremists at Raj Ghat.",
        "1993": "Prime Minister's employment project started in urban areas.",
        "1994": "Gandhi Peace Prize instituted on the lines of Nobel Peace Prize on the great leader's 125th birth anniversary.",
        "1996": "Mother Teresa made honorary US citizen.",
        "1997": "At least 50 Pakistan soldiers were killed and several injured in a retaliatory firing by Indian troops in Nowgam, Uri and Kupwara sectors. Firing had been intermittent along LoC.",
        "1998": "Santanu Deb Barma of Tripura was chosen for Kabir Puraskar for her role in preventing violence and riots in some areas of the state in 1997.",
        "1999": "Home Minister L. K. Advani said that the BJP was ready to provide letters of support.",
        "2000": "Mukesh Kumar, India hockey player, retires from international hockey."
    }
}