{
    "title": "Events for November 2",
    "events": {
        "2\tNovember\t1534": "Guru Ramdas, Sikh Guru, was born.",
        "2\tNovember\t1774": "Lord Robert Clive, one of the founders of British Rule in India, British Army Chief and Diplomat, died. He committed suicide in England at the age of 49 under strain of ill health and charges of his misdeeds in India.",
        "2\tNovember\t1841": "Akbar Khan revolts against Shah Shuja in Afghanistan.",
        "2\tNovember\t1871": "Kashinath Raghunath Mitra, famous editor of monthly magzine 'Manoranjan', was born.",
        "2\tNovember\t1885": "Balwant Pandurang Kirloskar (Annasaheb), first great Marathi musical drama playwright, died.",
        "2\tNovember\t1889": "Tyagmurti Goswami Ganeshdutt, social worker, was born at Chiniot in Jhang district, Punjab.",
        "2\tNovember\t1897": "Sohrab Meharwanji Modi,  theatre and film producer, director and actor, was born.",
        "2\tNovember\t1908": "50 years after the start of direct rule, Edward VII talks of 'prudently extending' democracy.",
        "2\tNovember\t1950": "India rebukes Mao for invasion of Tibet.",
        "2\tNovember\t1956": "Express Train plunged down the Marudaiyar river embarkment killng 143 persons.",
        "2\tNovember\t1967": "Ministry of Education evolves a National Service Scheme for University students.",
        "2\tNovember\t1971": "Hurricane and ensuing tidal wave takes 6,000 lives.",
        "2\tNovember\t1972": "B. D. Pande was appointed as the Cabinet Secretary of India. He held this office till 31-03-1977.",
        "2\tNovember\t1976": "Lok Sabha passes the 42nd Constitution Amendment Bill making India a Socialist Secular Republic and laying down the fundamental duties of citizens.",
        "2\tNovember\t1984": "Violence following Indira Gandhi's assassination takes heavy toll.",
        "2\tNovember\t1990": "Many die in firing in Ayodhya as Karsevaks storm the Ram Janma Bhumi/Babri Masjid structure. Curfew in many areas in north and west India to prevent communal violence. Several people die in violence.",
        "2\tNovember\t1992": "Nine Maharashtra ministers resign.",
        "2\tNovember\t1994": "Three British hostages freed in Saharanpur, UP, after a fierce encounter.",
        "2\tNovember\t1999": "The Delhi HC dismisses a plea against Sonia Gandhi seeking deletion of her name from the register of Indian citizenship.",
        "2\tNovember\t2000": "Sinam Chandramani Singh (18), national bravery award winner, his brother Sinam Robin Singh and their aunt were among 10 killed in firing by eight Assam Rifles personnel at Malom near Imphal."
    }
}