{
    "title": "Events for December 2",
    "events": {
        "2\tDecember\t1552": "Father Francis Xavier (1506-1552), Portuguese Jesuit priest, died. He started his mission by training and employing native clergy in conversion efforts. He spread Christianity to India, Malay Archipelago and Japan.",
        "2\tDecember\t1662": "Francis Xavier was canonised at Goa.",
        "2\tDecember\t1855": "Narayan Ganesh Chandavarkar, one of the founders of Indian National Congress and social reformer, was born.",
        "2\tDecember\t1905": "Anant Atmaram Kanekar, modern Marathi poet, author and journalist, was born.",
        "2\tDecember\t1911": "King George V and Queen Marry visited Bombay, India. The King annulled the partition of Bengal. Delhi was to be made the new capital and the King announced it on 12th December at Delhi Durbur.",
        "2\tDecember\t1918": "Gurudas Banerjee, famous Law expert and first Indian Vice Chancellor of Calcutta University, died.",
        "2\tDecember\t1919": "Akhtari Bai was born.",
        "2\tDecember\t1937": "Manohar Gajanan Joshi was born in Nandvi, Distt. Raigad (Maharashtra).",
        "2\tDecember\t1942": "Sri Aurbindo Ashram School was inaugurated.",
        "2\tDecember\t1947": "Dhiraj Devji Parsana, cricket left-arm medium pace and slow spin bowler, was born in Rajkot. He played vs West Indies 1978-79.",
        "2\tDecember\t1964": "Pope Paul VI greeted by mils.",
        "2\tDecember\t1965": "Border Security Force came into existence.",
        "2\tDecember\t1984": "Following the Bhopal Gas disaster on the night of December 2, 1984, the ICMR initiated a series of interdisciplinary investigations on the health of the people with severe, moderate and mild exposure. A Coordinating Unit, which was later re-designated as the Bhopal Gas Disaster Research Centre was established early in 1985 at the Gandhi Medical College, Bhopal, to monitor and coordinate the managerial and technical aspects of the various projects.",
        "2\tDecember\t1989": "Vishwanath Pratap Singh, Janta Dal leader, became the seventh Prime Minister of India.",
        "2\tDecember\t1991": "Balvinder Singh Nigah, an employee of the catering firm 'Chef Air', arrested for planting a bomb in Air India Jumbo 'Emperor Ashoka'.",
        "2\tDecember\t1992": "Dr. C. Rangarajan appointed Governor of the RBI.",
        "2\tDecember\t1993": "Madanlal Khurana sworn in as BJP Chief Minister of Delhi.",
        "2\tDecember\t1995": "The break away Congress Party re-christens itself as All India Indira Congress Committee.",
        "2\tDecember\t1996": "Dr. M. Chenna Reddy, Tamil Nadu governor, passed away at the age of 78.",
        "2\tDecember\t1997": "Pramod Tiwari sets national hammer record in South Asian athletic meet in Delhi.",
        "2\tDecember\t1998": "Prof. S. Sampath (73), former Director of the IIT Chennai and Kanpur, died. He was the Vice-Chancellor of Sri Sathya Sai Institute for Higher Learning, Prashanti Nilayam, during 1991-93. He was appointed member of the Union Public Service Commission in 1977.",
        "2\tDecember\t1999": "Vishnu Kant Shastri and Ved Prakash Marwah are sworn in Governors of Himachal Pradesh and Manipur respectively.",
        "2\tDecember\t2000": "36 passengers die and 140 suffer injuries after the Amritsar-bound Howrah Mail crashes into the overturned wagons of an Assam-bound train near Jeonpura village in Fatehgarh Sahib district, Punjab."
    }
}