{
    "title": "Events for February 2",
    "events": {
        "1314": "Saint Narhari Sonar, a poet-saint of the Varkari smanaj and goldsmith (sonar) from Maharashtra had taken Samadhi. His transition from a staunch Shaiva to a Vithoba-worshipping Varkari, after a miracle that makes him realize that Vithoba and Shiva are one and the same.",
        "1788": "Pitt's Regulatory Act was was introduced to modify the Indian Administration and put further controls on Government of India after the 1784 Bill.",
        "1814": "Calcutta Museum was established. It was a part of the Asiatic Society at a suggestion of a Danish surgeon Dr. Nathaniel Wallich, who was its first Director also.",
        "1835": "Thomas Babington Macaulay westernises education in India. English is made official government and court language and as medium of instruction.",
        "1862": "Pandit Shambhunath was the first Indian to become Judge of Indian High Court.",
        "1915": "Khushvant Singh, famous journalist, was born.",
        "1917": "Maharshi Vinayak Ramchandra Patwardhan (Annasaheb), collegue of Lokmanya Tilak, passed away.",
        "1921": "Mukundrao Kirloskar was born.",
        "1930": "Vasudev Govind Apte, editor and dictrionay creator, passed away.",
        "1949": "Press Trust of India' was established.",
        "1952": "India won first cricket Test Match at Chepauk Stadium, Madras.",
        "1953": "All India Khadi and Village Industries Board started in New Delhi.",
        "1956": "The president inaugurated the Bhoodan padyatra led by Dr. Sushila Nayar.",
        "1958": "Family tradition still counts for something in Indian politics. Indira Gandhi, the only daughter of Prime Minister Jawaharlal Nehru and the granddaughter of a statesman, has been elected president of the Congress party in India. Mrs. Gandhi will be installed into her new office next Sunday, and her job is not expected to be an easy one. The Congress party has been wracked by internal dissension and has been on the verge of collapse. It is hoped that Mrs. Gandhi, who is 41, will breath some new life into the party. Most of the politicians who have been arguing about the future of their party and country are fairly old. Mrs. Gandhi, who is known for her leftist sentiments, is expected to act quickly to put her own mark on party policies.",
        "1959": "Indira Gandhi was elected the president of the ruling Congress Executive Party. Thereby Congress spilt,and leftist formed Swantantra Party.",
        "1964": "Rajkumari Amrit Kaur, social reformer and freedom fighter, passed away.",
        "1965": "Government sanction was accorded to the Officers Training School  for the start of Short Service Regular Commission.",
        "1967": "US President Johnson orders consignment of 2 mil. tons of food grains to be sent to India.",
        "1968": "TERLS dedicated to the United Nations.",
        "1970": "Bertrand Rusell, great philosopher, mathematician, author and chairmain of the Indian League, died at Merioneth, North Wales at the age of 98.",
        "1977": "Jagjivan Ram, Cabinet member of 30 years, resigns to protest emergency rule causing minor split in Congress party.",
        "1978": "Mahakavi G. Sankara Kurup, Malayalam poet, the first receipent of \"\"Gyanpeeth Puraskar (Award)\"\", and many other awards, passed away.",
        "1982": "Mohanlal Purushottamdas Sukhadia, Chief Minister of Rajasthan, freedom fighter, passed away. He was the Chief Minister of Rajasthan from 1954-1971. He introduced Panchayati Raj in Rajasthan and worked for its industrialisation also.",
        "1986": "Dalai Lama meets Pope John Paul II in India.",
        "1989": "France's highest civilian award, 'Legion d' Honour, conferred upon Satyajit Ray by President Mitterrand at Calcutta.",
        "1993": "Prices of iron and steel hiked.",
        "1996": "Doordarshan Kendra was inagurated at Port Blair.",
        "2000": "The Union Information and Broadcasting Ministry clears Ms. Deepa Mehta's film ''Water'' after the director agreed to make some changes in the script."
    }
}