{
    "title": "Events for April 2",
    "events": {
        "1679": "Aurangzeb reimposed Jizya Tax to finance the spread of Islam on the Hindus.This Jeziya tax was abolished by Akbar.",
        "1702": "Balaji Vishwanath Bhat, first Peshwa, passed away.",
        "1870": "Poona Sarvajanik Sabha was found.  95 members from different parts of Maharashtra assembled in Pune during its founding.",
        "1877": "Narottam Morarjee, great social reformer and the architect of the modern Indian Shipping, was born at Porbandar.",
        "1902": "Gulam Ali Khan Ustad Bade was born.",
        "1926": "The worst Hindu-Muslim riots break out in Calcutta.",
        "1933": "Sir Ranjitsinhji Vibhaji \"Ranji\", Maharaj, jamsaheb of Nawanagar and noted cricketer, passed away. He was referred as \"The prince of a little state, but the King of a great game\". He scored  989 Test runs with a 1st-class avg. 56.",
        "1942": "Congress rejected the proposal of Sir Stepherd Crips.",
        "1948": "Communist leader S.A. Dange arrested in Bombay.",
        "1953": "Asaf Ali, lawyer, nationalist and writer, passed away.",
        "1954": "Nehru calls for a halt to the build up of nuclear weapons.",
        "1970": "Meghalaya, an autonomous hilly state, was established after dividing the hilly areas of Assam.",
        "1980": "S. S. Grewal was appointed as the Cabinet Secretary of India. He held this office till 30-04-1981.",
        "1987": "Indian Standards Institution becomes Bureau of Indian Standards.",
        "1991": "Haryana Governor recommends President's rule.",
        "1992": "Agajan Baig (Aga), famous Hindi film actor, passed away.",
        "1993": "MP High Court quashes dismissal of BJP Government under article 356; the Centre decides to move the Supreme Court.",
        "1994": "Ravi Naik sworn in CM.",
        "1996": "Tamil Maanila Congress (Moopanar) party registered and recognised.",
        "1997": "Sumita Sinha of Dhanbad, (18 years college girl) became a world record holder when a 3,200 kg  Ambassador car passed over her.",
        "2000": "Guru Granth Sahib is a juristic person and can hold property, says the apex court in a judgment of ''far-reaching consequences and great significance''."
    }
}