{
    "title": "Events for May 2",
    "events": {
        "1769": "Sir John Malcom, former Governor of Mumbai and historian, was born.",
        "1907": "Riots break out in Rawalpindi and East Bengal, spreading to the Punjab.",
        "1908": "Police in Calcutta discover a cache of explosives for use in alleged anarchist plot.",
        "1921": "Satyajeet Ray, world famous film director and a very short story writer, was born in a family of artistS. In 1989, he was awarded highest honour of France ''Legion d Honeur''.",
        "1922": "Kedarnath Modi, great Industrialist in Maharashtra, was born.",
        "1926": "Hindu women gain right to seek elected office.",
        "1930": "Riots break out in Amritsar.",
        "1953": "40 persons were reported losing their lives today in the first crash of a jet airliner in commercial service. The jetliner, a British-built Comet, plunged to earth in a violent storm just a few minutes after taking off from Calcutta. It was carrying a party of rubber and tin operators from Malaya to England. There were no survivors. Two Comets have crashed before, one last October and one in March, but neither was carrying passengers.",
        "1954": "Ceylon Asian conference ends with plea for peace in Indo-China, end of atomic tests and condemnation of colonialism.",
        "1968": "Lok Sabha passed the Public Providend Fund Act.",
        "1974": "700 union leaders arrested in a move to avert a rail strike in New Delhi.",
        "1977": "C.V. Narasimhan became the director of Central Bureau of Investigation (till 25/11/77).",
        "1981": "Dr. Yashwant Singh Parmar, the architect of modern Himachal Pradesh and an energetic Chief Minister, passed away.",
        "1982": "Mohun Bagan retains Federation Cup (football) beating Mafatlal at Calicut.",
        "1985": "Banarsidas Chaturvedi, famous writer and journalist, passed away.",
        "1992": "President J.B.Patnaik, former Orissa CM and PCC (I), arrested on corruption charges.",
        "1996": "General Election 2nd phase begins in 204 LS and 223 Assembly constituencies spread over 17 States & union territories.",
        "1998": "The Indian Army at Bandipura market captured 10.5 Kg Charas."
    }
}