{
    "title": "Events for June 2",
    "events": {
        "1756": "Fort William, the English stronghold in Bengal, was surrendered to Siraj-ud-Daulah.",
        "1900": "Sri Ram Sharma Acharya, freedom fighter, social reformer and leader, passed away.",
        "1908": "Sri Aurobindo, freedom fighter, was arrested in  Manik Tala Bomb explosion case.",
        "1953": "Mountaineer Edmund Hillary of New Zealand and his Nepalese Sherpa guide Tensing  became the first men to conquer Mount Everest, the world's tallest mountain. The two reached the pinnacle of Everest, more than 29,000 feet above sea level, at 11.30 a.m.",
        "1955": "A British party scales the third highest peak Mt. Kanchenjunga, highest unclimbed peak.",
        "1965": "The second of 2 cyclones in less than a month kills 35,000 (Ganges R India).",
        "1975": "Devendra Mohan Bose, famous Scientist of Physics, passed away.",
        "1984": "Army takes control in Punjab as 22 people are killed in Sikh struggle for autonomy. The state is declared a restricted area under the Foreigners' Act.",
        "1986": "One thousand Sikhs arrested at demonstrations in Punjab.",
        "1988": "Raj Kapoor, famous film actor, director and Dadasaheb Phalke awardee, passed away.",
        "1990": "Sri Ram Sharma Acharya passed away. (27-6-91).",
        "1991": "Dinesh Goswami, former Law Minister, passed away in a  road accident in Assam.",
        "1992": "The government accepts all the 15 recommendations of the Janakiraman Committee which unearthed massive collusion of banks in the security scam.",
        "1993": "Kurla-Kochi Express rams into goods train near Jolarpet in which 22 were killed and 100 injured.",
        "1997": "Saudi Boeing 747 Jumbo with 348 people on board misses the Meenambakkam international airport, Chennai and forcelands at Tambaram Air Force strip.",
        "2000": "Justice A. M. Ahmadi, former Chief Justice of India, appointed Chairman of the Advisory Committee of the Rajiv Gandhi National Sadbhavana Award."
    }
}