{
    "title": "Events for July 2",
    "events": {
        "1757": "Nawab Siraj-ud-Daula was captured and assassinated. He was stabbed with a knife by Muhammad Beg at the instance of Miran, son of Mir Zafar.",
        "1905": "Shantiswaroop Dhavan, former Governor of West Bengal, was born.",
        "1926": "Ram Sewak Yadav, social reformer, politician and leader, was born in Tala Village, Uttar Pradesh.",
        "1928": "Nandkishor Bal, great Odia poet, passed away.",
        "1929": "Amritlal Basu, famous Bengali playwright, died.",
        "1938": "Chandra K. N. Patel was born at Baramati near Pune. In 1974, he was the youngest scientist to be elected to the US National Academy of Sciences. Besides, he is the recipient of the Ballantine Medal, The Worykin Award and The lamme Medal. Chandra K. N. Patel is the Executive Director of one of the divisions of the AT&T Bell Laboratories, USA.",
        "1941": "Muhammad Baqa Jilani,  one Test for India, 0-55, died at the age of 29.",
        "1950": "Yusuf Meharali, socialist leader, died.",
        "1961": "Prof M S Thacker, DG-CSIR, laid the foundation stone for the wind tunnel complex.",
        "1970": "Pandit Kunjilal Dubey, freedom fighter, educationalist and politician, passed away.",
        "1972": "Shimla Treaty' was singed between Indian Prime Minister Indira Gandhi and her Pakistani counterpart Zulfikar Ali Bhutto.",
        "1991": "Nanankal Krishna Pillai, famous Malyalam poet, died.",
        "1992": "Six new ministers inducted into the Union Cabinet.",
        "1993": "ONGC converted into corporation by ordinance.",
        "1997": "Screening for Hepatitis C made mandatory all over India.",
        "1998": "India and Sri Lanka sign an agreement on promoting agricultural research in New Delhi.",
        "1999": "The Indian Army launches a three pronged attack on Kargil. India is firm on Pakistan pullout from the area.",
        "2000": "At least 30 people had died after a boat collapsed in Kumla river near Pratapur in Madhubani district of Bihar."
    }
}