{
    "title": "Events for August 2",
    "events": {
        "1763": "British troops once again defeated Mir Kasim in 'Giriya' battle.",
        "1781": "Sakharambapu Bokeel, great politician in Maratha kingdom, died.",
        "1858": "British parliament passed the act to handover the administration of India to British Government from East India Company. After the occasion, the Supreme British ruler in India was called as 'Viceroy'.",
        "1861": "Parafulla Chandra Ray, chemical expert and great patriot, was born in the village of Raruli-Katipara IN Jessore district.",
        "1877": "Pandit Ravishankar Shukla, former Chief Minister of Madhya Pradesh, lawyer, politician and social worker, was born in Sagar, M.P.",
        "1880": "Bellary Raghava, famous actor, lawyer, social worker and dramatist, was born.",
        "1885": "Poet Siyaram Saran Gupt, brother of national poet Maithilysharan Gupt, was born.",
        "1891": "Padmashree V. P. Karmarkar (Nanasaheb), famous sculptor, was born.",
        "1919": "Bharat Bhushan Agrawal, famous poet and winner of Sahitya Academy Award, was born.",
        "1922": "Krishnapal Singh, politician and lawyer, was born at Birahuli in Madhya Pradesh.",
        "1935": "The British pass Govt. of India Act, separating Burma, Aden from India.",
        "1942": "Gandhi says that the Japanese might be welcomed in India should they invade due to current Indian discontent.",
        "1953": "Baldev Ramji  Mirdha \"Kisan Kesari\", great social worker, leader and politician, died in harness while going to address a Kisan Conference. He also played a vital role in formation of Rajasthan.",
        "1958": "Arshad Ayub, cricketer (Indian off-spinner  in 13 Tests between 1987-89), was born in Hydrabad.",
        "1959": "Little Theatre was established.",
        "1970": "Smt. Chonira Beliappa Muthamma, India's first woman ambassador, was deputed at Hungary.",
        "1977": "Jaswinder \"Jas\" Jutla, Soccer(Football) player, was born in Glasgow, Scotland.",
        "1980": "Ramshankar Baij, great sculptor, died.",
        "1984": "32 people died in a bomb explosion at Meenambakkam Airport.",
        "1987": "Vishwanathan Anand becomes the first Asian to win the World Junior Chess championship.",
        "1988": "The Supreme Court confirmed death sentence on Satwant Singh and Kehar Singh in Indira Gandhi murder case.",
        "1993": "Seven JD (A) rebel MPs admitted to Congress (I).",
        "1994": "Opposition quits Parliament panels, boycotts sessions.",
        "2000": "The Lok Sabha performs a ''hat-trick'' by setting off the process for the creation of three new states by passing the Jharkhand Bill."
    }
}