{
    "title": "Events for January 30",
    "events": {
        "1528": "Rana Sanga of  Mewar, who had built up an extensive and powerful kingdom over the central and western regions of Northern India, passed away. Mughal Emperor Babur captured Chanderi Fort from Medini Rai, Rana Sangram Singh one of the Lieutenants.",
        "1785": "Sir Charles Metkaff, governor general of East India Company, was born.",
        "1882": "Franklin Delano Roosevelt, great leader and social reformer, was born at Hyde Park, New York.",
        "1903": "Lord Curzon opened the Imperial Library in in Metcalfe Hall at Calcutta.",
        "1905": "Pitamber Das, social reformer and politician, was born at Mowana, U.P.",
        "1908": "Gandhiji was summoned to see General Smuts at Pretoria and released on reaching a compromise.",
        "1911": "Gajananrao Joshi, famous violin player and singer of \"Gwalior Gharana\", was born.",
        "1947": "Gandhiji leaves Patna for Delhi. Mountbatten, new Viceroy, arrives in Delhi.",
        "1948": "Mohandas Karamchand Gandhi, the spiritual leader of Indian independence,  was shot and killed by a Hindu extremist. The 78-year-old Gandhi was shot at point-blank range as he was walking through a garden to a pergola, where he was to deliver his daily prayer meeting.",
        "1949": "Night Airmail Services was inaugurated.",
        "1959": "Uranium Metal Project started producing Uranium at Trombay, Mumbai.",
        "1968": "Makhanlal Chaturvedi, famous Hindi poet, writer and President of All India, passed away.",
        "1971": "Indian Airline's Fokker Friendship aircraft in India was hijacked to Lahore.",
        "1988": "Sheshrao Wankhede, barrister, passed away.",
        "1991": "Union Government dismisses Karunanidhi government. President's rule imposed in Tamil Nadu.",
        "1993": "Dr. Syvatoslav Roerich, 89, renowned painter and husband of film actress Devika Rani, passed away.",
        "1994": "Kapil Dev equals Richard Hadlee's world record of 431 Test wickets.",
        "1996": "Supreme Court directs CBI and other govt. agencies to speed up the Jain hawala probe.",
        "1997": "Mahatma Gandhi's ashes immersed in Sangam.",
        "1999": "Pandit Ravi Shankar, sitar maestro, is chosen for Bharat Ratna."
    }
}