{
    "title": "Events for December 30",
    "events": {
        "30\tDecember\t1803": "East India Comapny captured Dehli, Agra and Bharooch.",
        "30\tDecember\t1865": "Rudyard Kipling, famous English litterateur and author (Jungle Book, Gunga Din-Nobel 1907), was born in Bombay.",
        "30\tDecember\t1879": "Shri Ramana Maharshi (1879-1950), modern Hindu Advaita renaissance saint of Maharshi Research Institute, philosopher and yogi, was born in Tiruchuzhi near Madurai in Tamil Nadu.",
        "30\tDecember\t1887": "Kanhaiyalal Maneklal Munshi, leader of India Freedom Movement, Law expert, Educationist, Litterateur and founder of \"Bhartiya Vidya Bhavan\", was born at Bharuch.",
        "30\tDecember\t1906": "The All India Muslim League was founded in Dacca by a group of big landlords which included Aga Khan III, The Nawab of Dacca and Nawab Mohsin-ul-Mulk-Salimullah. They supported the Partition of Bengal and called for seperate Muslim electrorates and other safeguard for Muslims.",
        "30\tDecember\t1929": "The first inland Indian air mail left New Delhi this morning for Jodhpur, Hyderabad, and Karachi to connect at Karachi with the air service to London.",
        "30\tDecember\t1935": "Lord Reading, former Viceroy and Governor General of India, died at the age of 76 at UK.",
        "30\tDecember\t1941": "Gandhiji, at his own request, is relieved of hi-leadership of Congress by Working Committee.",
        "30\tDecember\t1946": "Jawaharlal Nehru calls on Gandhiji, who says, \"My reason wholly supports my heart\".",
        "30\tDecember\t1947": "India informs Pakistan and other dominion representatives that it has decided to refer the Kashmir issue to the Security Council under Article 35 of the United Nations Charter.",
        "30\tDecember\t1949": "India recognizes People's Republic of China.",
        "30\tDecember\t1953": "The Untouchability (Offences) Bill published in the Gazette of India.",
        "30\tDecember\t1964": "500 people seized by Chinese spies.",
        "30\tDecember\t1971": "Vikram Ambalal Sarabhai, famous nuclear scientist, died.",
        "30\tDecember\t1974": "Opening of the fifth Indian Film Festival. It was presided over by Satyajit Ray at New Delhi.",
        "30\tDecember\t1993": "Government gets majority when 10 members of Ajit faction of the JD merge with the Congress."
    }
}