{
    "title": "Events for October 30",
    "events": {
        "1883": "Swami Dayanand Saraswati, founder of Arya Samaj, died in Ajmer.",
        "1887": "Sukumar Roy, famous Bengali children's litterateur, was born.",
        "1889": "Acharya Narendra Deo, educationist, freedom fighter and politician, was born at Sitapur, U.P.",
        "1908": "Pasumpon Muthuramalingam Thevar, freedom fighter and social worker, was born at Pasumpon village, Tamil Nadu.",
        "1909": "Homi Jahangir Bhabha, famous nuclear scientist, was born in Bombay.",
        "1924": "World Savings Day.",
        "1928": "Madhav Vinayak Gothoskar, cricket Test umpire for 14 tests from 1972-84, was born in Mumbai.",
        "1933": "Dara Nadirsha Dotiwala, cricket Test umpire for 6 tests from 1981-88, was born in Mumbai.",
        "1947": "The first Spitfires from the Advanced Flying School at Ambala reached Srinagar and were soon engaged in strafing the raiders beyond Pattan. Within a week, the Tempests of No. 7 Squadron were playing a decisive role in the battle of Shelatang which halted the forward momentum of the insurgents.",
        "1949": "Pramond Venkatesh Devidas Mahajan was born in Mahaboobnagar (Andhra Pradesh).",
        "1963": "Pasumpon Muthuramalingam Thevar, nationalist, freedom fighter and social worker, died at Madurai.",
        "1966": "First meeting of the Shiv Sena at Shivaji Park.",
        "1976": "Elections to the lower house of the Indian Parliament suspended again until early 1978.",
        "1977": "Demonstrators and police clash in Madras as Indira Gandhi tours the country.",
        "1990": "Several people died and many injured as security forces opened fire at a crowd marching towards Ram Janmabhumi/Babari Masjid to perform 'karseva'.",
        "1991": "Norberto Carvalho, vetern freedom fighter of Goa freedom fight, passed away.",
        "1992": "India and China decide to continue peace measures and open more points for border trade.",
        "1994": "India seeks Chinese support for Security Council membership.",
        "1996": "Pop star Michael Jackson arrives in Bombay.",
        "1997": "Kerala Kaumudi's Kannur edition and Internet edition begin.",
        "1999": "The Central Ministerial team led by Mr. Advani is prevented from making an on-the-spot assessment of the havoc wrecked by the super cyclone.",
        "2000": "The 160-page CBI's report on cricket match-fixing names Azharuddin, Ajay Jadeja, Ajay Sharma, Manoj Prabhakar and former physiotherapist Dr. Ali Irani for their deep-rooted nexus with betting syndicates. It virtually gives a clean chit to Kapil Dev."
    }
}