{
    "title": "Events for April 30",
    "events": {
        "1030": "Sultan Mahmud of Ghazni passed away in his capital.",
        "1843": "Ramchandra Bhikaji Gunjikar, marathi novelist and editor, was born.",
        "1863": "Naval Force East India Comapny was merged with the British Naval Fleet.",
        "1870": "Dadasaheb Phalke alias Dhundiraj Gobind Phalke was born at Trymbakeshwar near Nasik, Maharashtra. He is remembered as the 'Father of Indian Cinema'. He produced India's first feature Film, 'Raja Harishchandra' and founded Phalke & Co. at Bombay. He was a director, producer, writer, editor & laboratorian, portrait photographer and also a scene-painter.",
        "1888": "Hailsones kill 246 in Moradabad.",
        "1896": "Maa Anandamayee (1896-1982), God-intoxicated yogini and mystic Bengali saint, was born at Kheora. Her spirit lives on in devotees.",
        "1908": "Khudiram Bose along with Prafulla Chaki had planned to throw a bomb at a carriage supposed to be carrying  the tyrannical magistrate Kingsford. Unfortunately he was betrayed and was caught and finally was sentenced to death.",
        "1909": "Sant Tukdoji Maharaj, great saint, patriot and social worker, was born at Yawali, district Amravati.",
        "1936": "Mahatma Gandhi started staying in Sevagram Ashram at Wardha in the Central Provinces, making it his headquarters.",
        "1947": "The entire nation is stirred by religious strife.",
        "1958": "Shiekh Abdulla taken into custody.",
        "1977": "Nine Congress-ruled states placed under President's rule. Janata Party formed.",
        "1981": "C. R. Krishnaswamy Rao was appointed as the Cabinet Secretary of India. He held this office till 08-02-1985.",
        "1988": "Raj Kapoor gets Dada Saheb Phalke award for 1988.",
        "1991": "BJP election manifesto promises Presidential form of government.",
        "1992": "Over 7 years after the gas disaster, a Bhopal court orders attachment of Carbide properties in India.",
        "1996": "Re-polling in 445 stations in six states.",
        "1998": "Sukh Ram, former Union Minister, decides to resign as a Minister in the Himachal Pradesh Government.",
        "1999": "Jessica Lal, model and TV personality, was murdered  in a crowded south Delhi restaurant."
    }
}