{
    "title": "Events for June 30",
    "events": {
        "1755": "Jayappa Shinde who was the son of Ronoji Shinde was murdered.",
        "1799": "Krishnaraj Bodiyar was once again declared as the King of Mysore.",
        "1817": "Dadabhai Navroji, veteran leader and industrialist, died.",
        "1823": "Sir Dinshaw Manokji Petit, famous industrialist, was born.",
        "1834": "Congress creates Indian Territory (now Oklahoma).",
        "1855": "Santhals of Rajmahal Hills, Santhal-Paragana, Bihar started their agitation against ill treatment by Britishers, revenue officers, police, landlords and moneylenders under the leadership on Sindhu and Kanhu at Bhoranadhighi, Bengali.",
        "1914": "Mahatma Gandhi's first arrest during campaigning for Indian rights in S Africa.",
        "1917": "Dr. Dadabhai Naoroji, great Indian, patriot and one of the founders of the Indian National Congress, politician and merchant, died at the age of 92.",
        "1928": "Kalyanji, famous music director, was born.",
        "1930": "George Fernandes, worker's leader and politician, was born.",
        "1931": "June Thorburn, actress (Touch & Go, Children Galore), was born in Kashmir, India.",
        "1934": "Chintamani Nagesh Ramachandra Rao, famous Scientist and Chemist, was born. His research work confines to \"Solid State Chemistry\". In 1982 he was elected Fellow of the Royal Society.",
        "1965": "Cease-fire was agreed under UN auspices between India and Pakistan, who signed treaty to stop the war at Rann of Kutch.",
        "1966": "Judge K. Subba Rao became the Chief Justice of India. He held this office till 11/04/1967.",
        "1968": "Makhanlal Chaturvedi, famous journalist and litterateur, passed away.",
        "1979": "R. D. Singh became the director of Central Bureau of Investigation. He was there in this office till 24 Jan. 1980.",
        "1981": "President's rule imposed in Assam.",
        "1984": "W. R. Dhavle, editor, died.",
        "1986": "Mizoram became the state of India.",
        "1991": "A 36-member Congress ministry led by Hiteswar Saikia assumes office in Assam.",
        "1992": "Over 20 Indian pilgrims die in Saudi Arabia due to heatwave and inadequate medical attention.",
        "1993": "AN-12 phasing out marked the end of a glorious chapter of transport operations in the IAF.",
        "1995": "CNN launches a 24-hour news channel in partnership with Doordarshan.",
        "1997": "Joginder Singh, CBI Director, was given marching orders bringing his 11-month-old controversial tenure to sudden end.  R. C. Sharma, Special Director, took over.",
        "1999": "The first ever direct bus service between India and Bangladesh gets delayed due to heavy rain.",
        "2000": "The Ladakh Autonomous Hill Development Council adopts a resolution seeking separation from J&K."
    }
}