{
    "title": "Events for July 30",
    "events": {
        "1622": "Tulsidas, devotee of God Rama Saint, great poet and writer of Ramayana, Hanuman chalisa and many many more, died. There are difference in dates 30/7 or 23/10/1623.",
        "1883": "Badridas Goenka, famous industrialist, was born.",
        "1886": "Dr. S.Muthulakshmi Reddi, first women M.A.L.A.S, was born.",
        "1920": "Rikhye Maj-Gen Indar Jit, Educationist and Former Army Officer, was born at Lahore.",
        "1933": "Gandhiji informs the Government of Bombay of his decision to march from Ahmedabad to Ras with 33 followers to revive Civil Disobedience movement.",
        "1947": "The part of Kashmir, North West Frontier Provience (NWFP), was swallowed up by Pakistan. The formality of raising the flag being done in November.",
        "1957": "Export Risk Insurance Corporation of India was established through which exporting materials were insured.",
        "1960": "Gangadhar Balkrishna Deshpande, great freedom fighter, leader and 'Lion of Karnataka', 0died. He was a loyal Congress leader.",
        "1987": "India says it will revive the 'Agni'  IRBM programe.",
        "1991": "Sabi Fernandes, senior photographer of Indian Express Newspaper Group, died.",
        "1992": "The Supreme Court declares that capitation fee in educational institutions is unlawful.",
        "1993": "CBI arrests Bhupen Dalal and three other brokers for cheating of LIC Mutual Funds involving Rs.173 crore.",
        "1995": "Notification issued for the constitution of Jharkhand Autonomous District Council.",
        "1996": "Delhi High Court rejects Narasimha Rao's petition seeking quashing of 09 order of chief metropolitan magistrate summoning him to appear as co-accused in the $ 100,000 Lakhubhai cheating case.",
        "1997": "Madras High Court restrains, by an interim injunction, the foreign universities/institutions having offices in India from awarding or conferring any degree on Indian students.",
        "2000": "Punjab Police men  and Indian Railways women claim the Federation Cup basketball tournament at Visakhapatnam."
    }
}