{
    "title": "Events for August 30",
    "events": {
        "1645": "Indians and Dutch sign the peace treaty.",
        "1659": "Aurangzeb plotted the death of his brother Dara Shikoh and beheaded him. He was buried in a vault under the dome of Humayun's tomb.",
        "1751": "Sir Robert Clive exhibited a heroic feat when the British troops captured Arcot form Chanda Saheb.",
        "1773": "Narayan Rao Peshwa was murdered by his uncle Raghunath Rao, also called Raghoba, who then proclaimed himself the Peshwa.",
        "1903": "Bhagwati Charan Varma was born.",
        "1908": "Ganpatrao Tapase, senior freedom fighter and former Governor of Uttar Pradesh and Haryana, was born.",
        "1928": "Jawaharlal Nehru lays his plans for a free India and becomes president of Congress Party in 1929.",
        "1934": "Balkrishna Pandharinath Gupte \"Baloo\", cricketer (brother of Fergie, Indian leggie), was born in Bombay.",
        "1979": "Earl Louis Mountbatten of Burma, a World War II hero, last British Viceroy in India and the first Governor General of independent India, was killed when Irish terrorists exploded his family fishing boat off the coast of Ireland. The Provisional wing of the Irish Republican Army immediately took credit for the killing, which it described as 'an execution' designed to further 'the noble struggle to drive the British intruders out of our native land'.",
        "1983": "Indian National Satellite (INSAT-1B) launched. This was also a multi-purpose communication and meteorology satellite, which served for more than its design life of seven years. It was launched by a US Space Shuttle.",
        "1989": "Anti-government  riots leave at least 11 dead.",
        "1990": "Parliament unanimously passes the Prasar Bharati Bill.",
        "1991": "Dr. P. J. Devras, friend of snakes, passed away.",
        "1992": "The first Indian-built ALH (Advanced Light Helicopter) successfully flown in Bangalore.",
        "1993": "LPG, Petrol dealers get higher commission.",
        "1994": "The ruling CPC-led Left Front captures large majority of gram panchayat seats in Tripura civic polls.",
        "2000": "A. B. Vajpayee, Prime Minister, announced a package for small units raising the ceiling on loans from Rs. 10 lakhs to Rs. 25 lakhs. For the handloom sector, a separate scheme costing Rs. 447 crores was also finalised."
    }
}