{
    "title": "Events for January 31",
    "events": {
        "1561": "Akbar's Vajir-E-Ajam 'Bairam Khan' was assassinated at Patan, Gujarat by an Afghan assassin Mubarak Khan Lohani ( whose father was slain by Bairam Khan) in the battle of Machiwara.",
        "1896": "Dattatray Ramchandra Bendre, Bhartiya Gyanpeeth Award winner and Kannad poet, was born.",
        "1903": "Smt. Sharda Bhaurao Diwan, educationalist, was born.",
        "1931": "Gangadhar Mahambre, famous Mmarathi writer, was born.",
        "1941": "Second Lieutenant Premindra Singh Bhagat of the Bombay Sappers showed an act of unparalleled bravery and inspiring leadership when commanding a detachment of 21 Field company of the Bombay Sappers on the road to Gondar, in Abyssinia. Hence, The Victoria Cross (VC) was bestowed upon him and he became the first Indian Commissioned Officer receipeant of The Victoria Cross (VC).",
        "1946": "Subroto Guha, cricketer (right arm swing bowler for India 1967-69), was born in Calcutta.",
        "1948": "Cities swept by riots in wake of Gandhi murder.",
        "1949": "Maharajas of Baroda and Kolhapur decide to merge their states with Bombay.",
        "1958": "First Earth Satellite Explorer I was launched from Cape Kennedy.",
        "1960": "Milkha Singh at Lahore sets record for 200m in 20.7s.",
        "1961": "Dr. Sri Krishna Sinha, first Chief Minister of Bihar,  passed away.",
        "1963": "Peacock declared as National Bird of India.",
        "1969": "Saint Meherbaba passed away.",
        "1976": "Air Chief Marshal Om Prakash Mehra, PVSM, retired as the Air Officer Commanding, India Command.",
        "1983": "The first floating Dry Dock was launched at Howrah.",
        "1985": "Under the 52nd Constitutional Amendment, Anti-Defector Bill was passed unanimously in Lok Sabha. This avoided the Representatives of People to switch over political parties.",
        "1986": "Shri Vishwanath More, famous music director, passed away.",
        "1992": "The Securities and Exchange Board of India given statutory power as an autonomous body.",
        "1994": "Punjab and Haryana High Court orders plastic surgery to remove 'Jebkatri' (pickpocket) tattooed on the forehead of four women by Amritsar Police.",
        "1995": "ISRO and Intelsat sign a $100 m 10-year-long agreement for leasing some of the capacity of the Indian-built INSAT-2E (scheduled for launch in 1997).",
        "1996": "Asia's first Sports University inaugurated in Pune.",
        "1997": "Merger of SCICI and ICICI confirmed with effect from 1/4/1996.",
        "1998": "D. R. Karthikeyan became the director of Central Bureau of Investigation (till 31/03/98).",
        "2000": "All seven accused in the Jain hawala case discharged."
    }
}