{
    "title": "Events for October 31",
    "events": {
        "31\tOctober\t1843": "Tarkanath Gangopadhyay, first realistic social novelist of Bengal, was born.",
        "31\tOctober\t1875": "Vallabhbhai Zaverbhai Patel, 'Iron man of India', was born at Nadiad, Gujarat. He was also the first Deputy Prime Minister of India. His father had served in the army of the Rani of Jhansi against Britishers.",
        "31\tOctober\t1876": "Cyclone hits Bengal centered near Bakarganj (now in Banlgadesh), about 200,000 die.",
        "31\tOctober\t1885": "St. Stephen's Hospital was opened. It was the first hospital for women and children at Delhi.",
        "31\tOctober\t1895": "Cottari Kanakaiya Nayudu, cricketer (India's 1st Test capt), born at Nagpur.",
        "31\tOctober\t1919": "Jaikisan Harivallabhdas, great industrialist, was born.",
        "31\tOctober\t1920": "Inaugural session of the All India Trade Union Congress was conducted in Bombay.",
        "31\tOctober\t1955": "The Prime Minister inaugurated the Cooperative Milk Producers' Union factory at Anand, Gujarat.",
        "31\tOctober\t1962": "Krishna Menon, Home Minister, resign due to attack by China.",
        "31\tOctober\t1963": "Krishna Menon, resigned from the post of Defence Minister of India, due to Chinese attack.",
        "31\tOctober\t1966": "Mihir Sen swam Panama Canal in 34 hours 15 minutes.",
        "31\tOctober\t1975": "Sachin Dev Burman, famous music director, died.",
        "31\tOctober\t1984": "Indira Gandhi, India's four-time prime minister, was gunned down by two members of her personal security guard as she walked from her home to her office in New Delhi. She died after four hours of emergency surgery. The only daughter of former Prime Minister Nehru was 66. Both of her attackers were identified as members of the Sikh religion. One was shot dead. The other was captured. Sikh extremists had threatened to kill Ms. Gandhi since she ordered the raid on their shrine in Amritsar. She had told an interviewer that she was not intimidated by the threats. 'I am not afraid,' she said. 'I am frequently attacked'.",
        "31\tOctober\t1989": "Dr. A. P. Mukherjee became the director of Central Bureau of Investigation till 11/01/90.",
        "31\tOctober\t1990": "Religious clashes between Hindus and Muslims leave more than 180 people dead.",
        "31\tOctober\t1991": "Karsevaks' hoist flags on Masjid in Ayodhya.",
        "31\tOctober\t1994": "26 die as cyclone lashes Tamil Nadu.",
        "31\tOctober\t1997": "Rushmi Chakravarthy makes it a double in the National hardcourt tennis in Mumbai.",
        "31\tOctober\t1999": "The Ram Janmabhoomi Trust president ends fast in support of his eight-point demands including improvement of 'puja' and 'darshan' arrangements of 'Ram Lala' at the temple.",
        "31\tOctober\t2000": "The Income Tax Department 'indicts'  five cricketers - Kapil Dev, Ajay Jadeja, Manoj Prabhakar, Nikhil Chopra and Ajay Sharma - for tax evasion and concealment of income earned through \"dubious sources\"."
    }
}