{
    "title": "Events for December 31",
    "events": {
        "31\tDecember\t1600": "Royal Charter forms the East India Company, setting in motion a process that ultimately results in the subjugation of India under British rule.",
        "31\tDecember\t1706": "Francois Martin, founder of Pondicherry and was its first Governor General, died. He founded Pondicherry, the future capital of French India in 1674.",
        "31\tDecember\t1738": "Lord Charles Cornvalis, Governor General of India (1786-1793), was born.",
        "31\tDecember\t1802": "Peshwa Baji Rao-II, after being defeated by Yashwant Rao Holkar, signed the treaty of Subsidiary Allowance and accepted security of British Government.",
        "31\tDecember\t1861": "Cherrapunji in Assam received rainfall of 22,990 mm in 1861. This was a world record in itself as no other country or place had received rains to such an extent.",
        "31\tDecember\t1900": "Krishna Narayan Ratanjankar, famous musician and writer of Tan Sangrah in three parts and Abhinav Geet Mangari, was born in Bombay.",
        "31\tDecember\t1902": "Dr. Raghuvir, dictionary creator, having knowledge of Vedic Sanskrit, Tebiti, Chinese and Mongolian, was born.",
        "31\tDecember\t1910": "Mallikarjun Bhimramaiya Mansoor, famous singer of \"Jaipur Gharana\", was born.",
        "31\tDecember\t1923": "Vishnu Dayal Jhunjhunwala, great industrialist, was born at Kanpur.",
        "31\tDecember\t1929": "At the Lahore session, under the Presidentship of Jawaharlal Nehru, the Congress adopted a resolution of 'Poorna Swaraj' (Complete Independence), the slogan given by Gandhiji. The tricolour flag of freedom was unfurled and 26th January 1930 was decided to be celebrated as Independence day every year. This session led to Civil Disobedience Movement, Dandi March to break the Salt Law, etc.",
        "31\tDecember\t1941": "Milkha Singh Govindsingh Amritsar, cricketer (brother of Kripal Singh, Indian batsman in 4 Tests), was born in Madras.",
        "31\tDecember\t1943": "Ben Kingsley Scarborough, English actor (Gandhi, Betrayal, Maurice), was born.",
        "31\tDecember\t1956": "Pandit Ravishankar Shukla, former Chief Minister of Madhya Pradesh, lawyer, politician and social worker, died at the age of 80.",
        "31\tDecember\t1961": "99 Infantry Brigade Group, under Brigadier K S Raja, launched operations in Katanga province and regained full control of Katanga amidst stiff resistance offered by a break away faction (Katangese gendarmerie).",
        "31\tDecember\t1965": "Sivaramakrishan Laxman, right-hand batsman and leg break bowler, was born in Madras.",
        "31\tDecember\t1966": "Bishen Singh Bedi made his Test Cricket debut vs West Indies at Calcutta.",
        "31\tDecember\t1984": "Rajiv Gandhi was sworn is as the 6th Prime Minister of India. He succeeded his mother Indira Gandhi. He became the Prime Minister of India for a second time and first time after elections.",
        "31\tDecember\t1988": "Treaty signed between India and Pakistan for not to target nuclear sites of each other.",
        "31\tDecember\t1993": "Manipur placed under President's rule; Bangarappa launches Karnataka Congress Party.",
        "31\tDecember\t1995": "K.P.S. Gill, DGP of Punjab, retires from service.",
        "31\tDecember\t1996": "Gold import policy liberalised.",
        "31\tDecember\t1998": "Air Chief Marshal Satish Kumar Sareen PVSM, AVSM, VM, ADC, retired as the Air Officer Commanding, India Command.",
        "31\tDecember\t1999": "This Indian Railway, carries more than 11 million passengers in a day, runs on more than 62,000 route kilometers and more than 1,07,000 track kilometers daily. This is the largest Railway System under Single Management."
    }
}