{
    "title": "Events for March 31",
    "events": {
        "1663": "Mir Jumla, Mughal Commander, passed away in Bihar.",
        "1843": "Balwant Pandurang Kirloskar (Annasaheb), first musical playwright of Marathi, was born.",
        "1867": "Prarthana Samaj was established by Ranade, Bhandarkar and others at Mumbai in 1864.",
        "1871": "Gangadhar Balkrishna Deshpande, freedom fighter and loyal Congress leader 'Lion of Karnataka', was born.",
        "1904": "British slaughter hundreds of Tibetans.",
        "1913": "Foundation stone of 'Gateway of India' was laid by Sir George Sydneham Clerk.",
        "1926": "Dattatray Balwant Parasnis, who made research in History, passed away.",
        "1930": "Shyamji Krishna Varma, freedom fighter, nationalist and patriot, passed away in Geneva.",
        "1935": "374 infants wed at a mass ceremony.",
        "1942": "During the 2nd World War, Japan was heavily successful in Burma and Andaman which posted a danger to the Indian Security.",
        "1959": "Dalai Lama fled China & was granted political asylum in India.",
        "1964": "Tram-way service ended in Mumbai (Bombay). This last electric tram left Bori Bunder (CST) for Dadar at 10 p.m., crowds lined the route all the way at that late hour to bid farewell to the common man's transport medium.",
        "1972": "Meena Kumari, famous film actress, passed away.",
        "1977": "N. K. Mukarji was appointed as the Cabinet Secretary of India. He held this office till 31-03-1980.",
        "1980": "Nirmal Mukherjee, the last Indian Civil Service Officer, retired from service as Cabinet Secretary.",
        "1986": "Bombay Telephone Nigam renamed as Mahanagar Telephone Nigam.",
        "1990": "Bharat Ratna, India's highest award, was given to Dr. Bhimrao Ramji Ambedkar (1841-1956) (Posthumous).",
        "1992": "Madhav Sinh Solanki, External Affairs minister, resigns on Bofors letter issue.",
        "1993": "Major changes in exim policy announced.",
        "1994": "The Supreme Court orders closure of 11 industrial units around Taj  Mahal.",
        "1995": "Bombay beat Punjab in 1st innings to win cricket Ranji Trophy.",
        "1996": "Karnataka defeat Tamil Nadu in first innings to win Ranji Trophy.",
        "1997": "The Bombay Stock Exchange crashes by 300 points.",
        "1998": "T. N. Mishra became the director of Central Bureau of Investigation (till 04/01/99).",
        "1999": "The PIO card, conferring privileges on persons of Indian origin settled abroad, is formally launched."
    }
}