{
    "title": "Events for May 31",
    "events": {
        "1756": "Jose Cusodio Faria was born in Candolim of Goa. He was a revolutionary scientist and also known as Abbe Faria.",
        "1818": "Samachar Darpan, the first vernacular newspaper, was published in Bengali language by Carey and Marshman from Serampore.",
        "1891": "Buddhagaya Mahabodhi Society, an organization to encourage Buddhist studies in India and abroad, was established by a Buddhist monk Anagarika Dharmapala.",
        "1921": "Suresh Hariprasad Joshi, modern Gujarati poet, story writer and critic, was born.",
        "1926": "Probir \"Khokhan\" Sen, cricket wicket-keeper (India in late 40's/early 50's), was born.",
        "1928": "Pankaj Khirod Roy, cricketer (Indian opener, 413 partnership w/Vinoo Mankad), was born in Calcutta. He was the recipient of Padmashree (1975).",
        "1947": "Gandhiji declares that peace must precede partition, and he would not be party to India's vivisection.",
        "1968": "F.V. Arul became the director of Central Bureau of Investigation (till 06/05/71).",
        "1970": "Indira Gandhi called for international help as the civil war in Bangladesh, or East Pakistan, had turned two million people into refugees. Many of them were suffering from cholera and smallpox. The authorities of West Pakistan refused to care for them, and India couldn't afford to.",
        "1973": "Mohan Kumaramangalam, Central Minister, died in an air crash near Delhi.",
        "1977": "Major Premchand and Naik Nima Dorji Sherpa, in the team on Indian Army Treckers, reached the peak of Kanchenjunga. They were amongst the first Indians to reach this peak.",
        "1981": "First developmental launch of SLV-3, Rohini (RS-D1) placed in orbit. It was used for conducting some remote sensing technology studies using a landmark sensor payload.",
        "1987": "Daman and Diu to remain as union territories after Goa becomes the 25th state of India.",
        "1988": "Dwarika Prasad Mishra, former Chief Minister of Madhya Pradesh, passed away.",
        "1994": "Pandit Samtaprasad, famous Tabla player, passed away.",
        "1995": "Statute Bill, a constitutional amendment bill, introduced in Lok Sabha to extend reservation in jobs and in promotion for SCs and STs.",
        "1996": "J. H. Patel sworn in Karnataka CM.",
        "1997": "Fourth National Games opened at Bangalore.",
        "1998": "India rejects mediation on issues with Pakistan, reiterates its commitment to address outstanding issues bilaterally."
    }
}