{
    "title": "Events for July 31",
    "events": {
        "1658": "Aurangzeb appoints himself Mongol emperor.",
        "1861": "9,300 mm rainfall in July in Cherrapunji, Assam becomes a world record.",
        "1865": "Jagannath Sunkersett, great social worker, educationist and sculptor of modern Mumbai, passed away at the age of 62.",
        "1880": "Nawab Rai\\Dhanpat Rai, 'Prem Chand', great litterateur, writer, editor, journalist and headmaster, was born at Lamahi village near Varanasi, UP.",
        "1902": "Keshav Shankar Pillai, great writer and Padma Bhushan awardee, was born at Kayamkulam in Kerala.",
        "1907": "Damodar Dharmanand Kosambi, famous ancient researcher and mathematician, was born.",
        "1912": "Allan Octavian, great social reformer, patriot, lawyer, journalist and politician, passed away at the age of 84.",
        "1914": "Amar Nath Chawla, politician, was born at Taunggri, (Burma).",
        "1916": "Mohanlal Sukhadia, chief minister of Rajasthan and freedom fighter, was born at Jhalawar.",
        "1919": "Hemchandra \"Hemu\" Ramchandra Adhikari, cricketer (right-handed batsman 1947-59), was born in Baroda.",
        "1933": "Gandhiji was arrested from Sabarmati Ashram and imprisoned without trial.",
        "1938": "Khalid Anwer Ansari, social worker, was born.",
        "1940": "Udham Singh, fiery revolutionary, freedom fighter and social reformer, was hanged by the British Government in the Pantone Villa Jail, London.",
        "1946": "Jinnah threatens sanctions of \"Direct Action\".",
        "1948": "State Transport Corporation was established in Calcutta.",
        "1952": "Bela Mitra, commander of \"Nari Vahini\" and activist of \"Azad Hind Fauj\", passed away. She also worked as partition refugee.",
        "1964": "Air Marshal Aspy Merwan Engineer DFC retired from the Air Officer Commanding, India Command.",
        "1974": "B. S. Chawla was appointed as the Narcotics Commissioner of India. He headed this office till 15-08-1974.",
        "1980": "Muhammad Rafi, famous playback singer, died at the age of 40.",
        "1985": "Lalit Maken, Congress (I) M.P, his wife and a visitor at their residence in Delhi were shot down by terrorists.",
        "1988": "Air Chief Marshal D A La Fontaine PVSM, AVSM, VM. retired as the Air Officer Commanding, India Command.",
        "1990": "Charan Singh Rathi at New Delhi sets record for 20 km W. in 1.25.48\\_\\_.",
        "1991": "Air Chief Marshal Nirmal Chandra Suri PVSM, AVSM, VM, ADC. became the Air Officer Commanding, India Command. He was in this office till 31/July/1993.",
        "1992": "Thailand Airlines crashed in Himalayan Range, 113 persons died.",
        "1993": "Zafar Saifullah was appointed as the Cabinet Secretary of India. He held this office till 31-07-1994.",
        "1995": "Rishang Keshing,Manipur CM, wins the vote of confidence.",
        "1996": "Supreme Court exempts Rao from appearing in CMM court personally.",
        "1997": "V. Thangapandian (64), Tamil Nadu Commercial Taxes Minister, died at Rajapalayam in Virudhunagar district.",
        "2000": "The Lok Sabha passes by voice vote a bill for creation of Chhattisgarh state."
    }
}