{
    "title": "Events for August 31",
    "events": {
        "1569": "Mirza Nur-ud-din Beig Mohammad Khan Salim aka Salim Mirza Jahangir, fourth Mughal Emperor and son of Akbar, was born at Fetehpur Sikri.",
        "1751": "Robert Clive, Britisher, at the age of 26 seizes Arcot in modern Tamil Nadu. He also checked the French advance in South India.",
        "1870": "Dr. Maria Montessori, great teacher, social worker and educationist, was born in Italy.",
        "1914": "Anil Kumar Chakravati, journalist, was born at Kusthia.",
        "1919": "Amrita Pritam, Punjabi poet, novelist and Gyanpeeth award winner, was born.",
        "1925": "Raut Benudhar, great poet and Hindi writer, was born at  Kenojhar in Orissa.",
        "1928": "Nehru report published in India; demands dominion status in British Empire.",
        "1947": "Nehru visits the riot-affected Punjab with Liaqat Ali and Sardar Patel.",
        "1956": "The President of India gave his consent to  the States Reorganistion Bill.",
        "1967": "Satyajit Ray receives the Ramon Magsaysay Award.",
        "1968": "Rohini MSV-I, the first Indian-made two-stage sounding rocket, successfully launched from Thumba.",
        "1969": "Javagal Srinath, cricketer (Indian right-arm pace bowler since 1991), was born in Mysore.",
        "1978": "Air Marshal Hrushikesh Moolgavkar PVSM, MVC, retired as the Air Officer Commanding, India Command.",
        "1979": "M. Hidayatullah, consensus choice of political parties, appointed as Vice-President of India (1979 - 1984).",
        "1981": "Air Chief Marshal Idris Hasan Latif, PVSM, retired as the Air Officer Commanding, India Command. After retirement he held the gubernatorial posts of Governor of Maharastra and Indian Ambassador to France.",
        "1982": "G. S. Pathak, former Vice President of India, died.",
        "1993": "Pranab Mukherjee rejoins the Union cabinet as Commerce Minister.",
        "1994": "Ramdulari Sinha, former Governor of Kerala and former Central Cabinet Minister, died.",
        "1995": "Beant Singh (73), Punjab chief minister, assassinated in R.D.X. explosion in a car. He played a very prominent in supressing the militancy in Punjab. This explosion also killed 14 others.",
        "1997": "Lok Sabha creates history with its largest-ever sitting of about 22 hours for a special golden jubilee session debating issues of national importance.",
        "1998": "The Government decides to raise the retirement age of the three service chiefs of the armed forces, officers and personnel across the board to 62 years.",
        "1999": "Surya Sekhar Ganguly won the National 'B' chess championship in Mumbai.",
        "2000": "J & K police nab two Pakistani militants for the massacre of 35 Sikhs at Chattisinghpora in March."
    }
}