{
    "title": "Events for January 3",
    "events": {
        "3\tJanuary\t1831": "Savitribai Phule, famous social worker, was born at Naigaon in Satara district, Maharashtra.",
        "3\tJanuary\t1836": "Munshi Newal Kishore, son of Jamuna Prasad Bhargava--a zamindar of Aligarh-- and a great erudite scholar, educationist, nationalist, social worker and a pioneer industrialist, was born. He was the founder of Navalkishore Press, Lucknow (1858), which published 2612 books that elaborated Hindi literature. He was the Publisher of Awadhi Newspaper in Asia.",
        "3\tJanuary\t1871": "Father Kuriakose Elias Chavara, freedom fighter and social reformer, died.",
        "3\tJanuary\t1880": "Publication of  'Illustrated Weekly of India' started.",
        "3\tJanuary\t1912": "Shantiprasad Jain, famous industrialist, was born.",
        "3\tJanuary\t1917": "Kartarsingh Duggal, famous Punjabi story-writer and novelist, was born.",
        "3\tJanuary\t1919": "Shambhu Pan, cricket Test Umpire for 9 tests from 1960-70, was born at Bengal.",
        "3\tJanuary\t1921": "First Indian Parliament meets.",
        "3\tJanuary\t1922": "Kirat Chothairam Babani, versatile Sindhi Writer and Journalist, was born.",
        "3\tJanuary\t1923": "Madhukar Arnalkar, famous Marathi writer, was born.",
        "3\tJanuary\t1931": "Yashwant Dinkar Phadke, great critic of literature, was born.",
        "3\tJanuary\t1938": "Jaswant Singh, son of Thakur Sardar Singh, was born in Jasol, Distt. Barmer (Rajasthan).",
        "3\tJanuary\t1945": "No. 8 Squadron becomes the first to convert onto the Spitfire VIII during the previous month and commencing operations on 3 January 1945 in the Kangaw area.",
        "3\tJanuary\t1946": "Three High Ranked Officers of Azad Hind Fauj were released by Gen. C. Auchinleck.",
        "3\tJanuary\t1947": "Gandhiji toured the riot-affected areas in Bihar from January 3 to January 29.",
        "3\tJanuary\t1952": "India adopted birth control program with aid of U.N. World Health Organization.",
        "3\tJanuary\t1966": "Chetan Jagatram Manohar Sharma, cricketer (Indian Test pace bowler, World Cup hat-trick 1987), was born in Ludhiana.",
        "3\tJanuary\t1975": "Lalit Narayan Mishra, great freedom fighter, politician, leader, member of the Lok Sabha and Minister of Railways, died at a Railway Hospital in Danapur due to a bomb blast at Samastipur Railway Station a day earlier.",
        "3\tJanuary\t1978": "Chandrasekar takes 6-52 at MCG in Indian innings win.",
        "3\tJanuary\t1985": "Azharuddin scores 110 in first Test innings.",
        "3\tJanuary\t1987": "Dr. Harekrishna Mehtab, former Chief Minister of Orrisa and Governer of  Mumbai State, died.",
        "3\tJanuary\t1994": "Stalemate persists on the Kashmir issue during Indo-Pak talks that concluded in Islamabad.",
        "3\tJanuary\t1995": "PM inaugurates 82nd Indian Science Congress at Jadavpur University, Calcutta.",
        "3\tJanuary\t1996": "Karnataka agrees to release 6 tmc ft. of Cauvery water to Tamil Nadu, bowing to PM's order.",
        "3\tJanuary\t1997": "Olympian Jaspal Rana sets new national mark in junior men's sports pistol 25 metres in National Shooting in Asansol.",
        "3\tJanuary\t2000": "A. B. Vajpayee, Prime Minister,  accuses Pakistan for the hijack of an Indian Airlines aircraft. (The crisis ended on Dec. 31 last with the Vajpayee Government agreeing to free three terrorists in exchange for the passengers)."
    }
}