{
    "title": "Events for October 3",
    "events": {
        "1831": "Britishers captured Mysore.",
        "1880": "Sakuntal Sangeet  held in Anandodbhav Auditorium in Pune. Annasaheb Kirloskar presented the first musical play in Marathi.",
        "1890": "Laxminarayan Sahu, litterateur, journalist and social reformer, was born.",
        "1903": "Swami Ramanand Tirth, politician and educationist, was born.",
        "1906": "Govind Vinayak Devansthali, Sanskrit researcher, dictionary creator, professor and journalist, was born in Bombay.",
        "1907": "Mansukhlal Maganlal Zaveri, famous Gujrati poet and critic, was born.",
        "1913": "Sudangsu Abinash Banerjee, 'Montu', cricketer, (5 wickets, 1 test vs West Indies) was born in Calcutta.",
        "1950": "India protests U.N. troops' crossing of 38th parallel in New York.",
        "1957": "Republican Party of India established.",
        "1977": "Indira Gandhi arrested on charges of official corruption in New Delhi.",
        "1978": "Dr. Subhas Mukhopadhyay claimed the credit of India's first and the birth of world's second test-tube baby Durga Agrawal, who was born in Belle Vue Nursing Home in  Calcutta.",
        "1984": "India's longest distance train Himsagar Express (from Jammu Tavi to Kanya Kumari) was first flagged.",
        "1985": "Morocco breaks diplomatic relations with India after New Delhi announced its recognition of the Saharwi Arab Democratic Republic.",
        "1988": "Lebanese kidnappers release Mithileshwar Singh after 30 months of being held captive.",
        "1991": "Ganpatrao Tapase, former Governor of Haryana and Uttar Pradesh, died.",
        "1992": "Geet Sethi beats holder Mike Russel of Britain (2529-718) to become the first Indian to win the World Professional Billiards championship in Bombay.",
        "1994": "Bhushan Tiwari, famous Hindi film actor of yesteryears, died.",
        "1996": "Second phase of  UP polling.",
        "1997": "Financial and operational autonomy to be given to 97 profit-making public sector enterprises ('mini-ratnas') other than the navaratnas.",
        "1999": "India finished with seven silver and four bronze medals in the Asian Junior Athletic Championship in Singapore.",
        "2000": "Prime Minister Atal Behari Vajpayee buys peace with the Trinamool Congress chief Mamata Banerjee by agreeing to a partial rollback of the hike in prices of petroleum products."
    }
}