{
    "title": "Events for November 3",
    "events": {
        "3\tNovember\t1605": "Salim renamed himself as Jahangir and became the king of Agra.",
        "3\tNovember\t1618": "Aurangzeb, [Alamgir], great Mughal emperor (1658-1707), was born at Dohad in Gujarat.",
        "3\tNovember\t1900": "Sagarmal Gopa, freedom fighter, was born.",
        "3\tNovember\t1906": "Prithviraj Kapoor, stage and film artist, member of Rajya Sabha and Dadasaheb Phalke awardee, was born.",
        "3\tNovember\t1908": "Shreyansprasad Jain, famous industrialist, was born.",
        "3\tNovember\t1929": "Dr. Hemant Vishnu Inamdar, thesis writer and editor, was born.",
        "3\tNovember\t1933": "Amartya Kumar Sen, economist, was born at Santiniketan (Bangal).",
        "3\tNovember\t1945": "Temporary Octroi Mandal established.",
        "3\tNovember\t1948": "Jawaharlal Nehru, Prime Minister of India, delivered his maiden speech in United Nations Organisation (U.N.O.) General Assembly.",
        "3\tNovember\t1961": "Gold Bond scheme was started to boost Indian economy after Indo-China war.",
        "3\tNovember\t1966": "Hurricane strikes Bengal, killing 1,000.",
        "3\tNovember\t1984": "Body of assassinated Indian PM Indira Gandhi cremated.",
        "3\tNovember\t1986": "Dr. Indrachandra Shastri, versatile in Sanskrit and Pali, died.",
        "3\tNovember\t1988": "Indian armed forces mounted special operations to help the Indian Ocean archipelago of the Maldives and dealt with the 150 sea-borne invaders who stormed Maldivian Capital, Male and soughted to overthrow the democratically elected Government of the Maldives.",
        "3\tNovember\t1990": "Manmohan Krishna, famous film actor, passed away.",
        "3\tNovember\t1991": "India's short range surface-to-air missile (SAM) 'Trishul' successfully tested.",
        "3\tNovember\t1992": "Premnath, hero and villan of Hindi film industry, passed away.",
        "3\tNovember\t1995": "Sheila Kaul becomes Governor of Himachal Pradesh, P. Shivshankar of Kerala and V Reghunath Reddy takes additional charge of Sikkim.",
        "3\tNovember\t1996": "Deve Gowda, PM, to attend G-15 summit in Harare. This was his first foreign trip as PM.",
        "3\tNovember\t1997": "India presents G-15 with agenda for a fair deal in Kuala Lumpur. India calls upon Group of 15 developing countries to \"build convergences among nations and encourage G-7 to pursue structured and issue-based dialogue with us\".",
        "3\tNovember\t1998": "The first geo-scientific data centre of the country is inaugurated at the Geological Survey of India.",
        "3\tNovember\t1999": "Harkishan Singh Surjeet donates property share to his party CPI(M).",
        "3\tNovember\t2000": "BCCI suspends five cricketers -Mohammed Azaruddin, Ajay Sharma, Ajay Jadeja, Nayan Mongia and Manoj Prabhakar--for a period of 15 days after the CBI report."
    }
}