{
    "title": "Events for December 3",
    "events": {
        "3\tDecember\t1790": "Lord Cornwallis took away the regulation power from Nawab Murshidabad and Sadar Nizamat was removed from Adalat in Calcutta.",
        "3\tDecember\t1882": "Nandalal Bose, great Indian painter and master, was born in Bengal.",
        "3\tDecember\t1884": "Dr. Rajendra Prasad, first President of India, was born in Jeradei village of Bihar.",
        "3\tDecember\t1889": "Khudiram Bose, famous revolutionary and freedom fighter of Muzaffarpur Bomb Case, was born at Habibpur village, West Bengal.",
        "3\tDecember\t1948": "Surendra Pratap Singh, famous journalist and chief editor of Navbharat Times, was born.",
        "3\tDecember\t1955": "In exercise of the powers conferred by the provision in Article 343 (2) of the constitution, orders were issued for the use of Hindi language in addition to the English language for specific purposes of the union.",
        "3\tDecember\t1956": "Manik Bandopadhyay, modern Bengali novelist and story writer, passed away.",
        "3\tDecember\t1970": "Rajendra Agriculture University established at Bihar.",
        "3\tDecember\t1971": "During the ensuing melee, three of the Sabres were shot down while all Gnats returning to base were unscathed. The first blood of a new Indo-Pakistan air war had been drawn. Other encounters were to follow over the next 10 days within both Indian and Pakistani airspace, before a full-scale war began.",
        "3\tDecember\t1979": "Dhyan Chand, famous master of Hockey and Padma Bhushan awardee, passed away.",
        "3\tDecember\t1984": "3,000 people died and more than 50,000 people were badly affected when they inhaled poisonous toxic gas emission from the Union Carbide plant. This event is better known as \"the Bhopal Gas Tragedy\", the biggest industrial disaster that occured in India.",
        "3\tDecember\t1989": "Mulayam Singh Yadav named UP CM.",
        "3\tDecember\t1991": "Satinder Kumar Lamba appointed India's Ambassador to Pakistan.",
        "3\tDecember\t1992": "Indian, UN Operations in Mozambique begins - ONUMOZ - from Dec 1992 to Oct 1994).",
        "3\tDecember\t1993": "Bahadur Prasad wins silver in 1500 m in Asian Track and Field meet in Manila.",
        "3\tDecember\t1998": "Maganbhai Kasundra, (50), Gujarat Minister, dies following a heart attack at his residence in Gandhinagar.",
        "3\tDecember\t1999": "Bhopal gas victims take out rallies to mark the 15th anniversary of the tragedy."
    }
}