{
    "title": "Events for February 3",
    "events": {
        "1760": "Sadashiv Bhau, under a large Maratha army, defeated the Nizam in war of Udgir.",
        "1873": "Prabhatkumar Mukhopadhyay, famous Bengali short story writer and novelist, was born.",
        "1900": "Tiruvenkata Rajendra Seshadri, one of the founders of Organic Chemistry in India, was born at Kulittalai in Tamil Nadu.",
        "1905": "Sir Padampat Singhania, great industrialist, was born at Kanpur.",
        "1912": "Bardanand Chattergy, chemical expert, was born.",
        "1916": "Banaras Hindu University was opened under the guidance of Madan Mohan Malaviya.",
        "1921": "The Evens Report on Indian Cinema 1921' was tabled before the Govt. on February 3.",
        "1925": "First Electric Train started its journey from Bombay V. T. (presently known as C.S.T.) to Kurla. This train was on the Central Railway, Bombay.",
        "1928": "Chandrasekhar Vaman Gadkari, cricketer (Indian batsman in 6 Tests 1953-55), was born at Pune.",
        "1929": "The \"Times of India Illustrated Weekly\" was renamed as \"The Illustrated Weekly of India\".",
        "1954": "Over 350 Hindus trampled to death in a stampede at religious rites at New Delhi.",
        "1969": "Thiru Conjeevaram Natrajan Annadurai \"Anna\", a great patriot, writer, editor, orator, former Chief Minister of Tamil Nadu and the commencer of Dravid Movement, passed away. He was the key person in formation of Anna Dramuk Party.",
        "1977": "Government relaxes rules of Emergency to permit normal political activity and electioneering.",
        "1983": "Prime Minister Indira Gandhi laid the foundation stone of Assam's new capital 'Pragjyotishpur'.",
        "1984": "Ravindra Mhatre, great Indian diplomat who was kidnapped in England, was murdered.",
        "1986": "Pope John Paul II meets Mother Teresa at Calcutta.",
        "1988": "INS Chakra was inducted in the Indian Navy when the first Soviet SSN Victor 1 class nuclear propelled submarine and India joined the maritime nuclear powers.",
        "1992": "Kapil Dev becomes the second highest wicket-taker in Test Cricket when he took his 400th wicket, that of Mark Taylor, in the Perth Test (New Zealand's Richard Hadlee with 431 wickets being the first).",
        "1994": "Akash' missile launched successfully.",
        "1995": "The Transplantation of Human Organs Act, notified after 7 months of Presidential assent, becomes enforceable.",
        "1997": "Major fire reduces Calcutta Book Fair to ashes.",
        "1998": "The BJP releases its election manifesto promising to make India a nuclear state; build a Ram temple at Ayodha and  work for a uniform civil code.",
        "2000": "Dr. Bimal Jalan, RBI Governor, unveils a seven-point agenda for banking sector reforms."
    }
}