{
    "title": "Events for March 3",
    "events": {
        "78": "Shaliwahan Shaka Hindu Calender started.",
        "1575": "A battle was fought at Turkra or Turkra Qasba (in the Balasore district) in which the Afghans were routed.",
        "1700": "Chhatrapati Rajaram Maharaj died of lung infection due to smallpox at Sinhagad fort.",
        "1707": "Shehejade Muajjam declared himself as the successor of Aurangzeb and renamed himself Bahadurshah First.",
        "1839": "Jamshedji Nasarvanji Tata, famous industrialist and father of modern technology, was born at Navsari near Surat, Gujarat. He started cotton mills in Bombay and Nagpur and founded the Tata Iron and Steel Company, which  is one of the largest integrated steel mills in the world.",
        "1847": "Alexander Graham Bell, great pioneer, inventor and professor, was born at Edinburgh, Scotland.",
        "1859": "A length of 119 miles of line was laid in the North from Allahabad to Kanpur.",
        "1871": "Congress changes Indian tribes status from independent to dependent.",
        "1885": "Congress passes Indian Appropriations Act (Indians wards of fed govt).",
        "1891": "Office of Superintendent of Immigration (Treasury Dept) created.",
        "1906": "Trailokyanath Goswami, famous Hindi writer and educationist, was born at Nalbari, Assam .",
        "1919": "Hari Narayan Apte, famous Marathi novelist, passed away.",
        "1921": "Ahmed Gulsher, freedom fighter and politician, was born at Satna (M.P).",
        "1924": "Mustafa Kamal Attaturk abolished the caliphate and established a nationalist government and thus Khilafat Movement ended without achieving its aim.",
        "1930": "Untouchable people fought to enter the temple of  'Kala Rama' at Nasik.",
        "1931": "Gandhi and Viceroy Irwin sign Delhi Pact giving Indians right to make salt if civil disobedience stops.",
        "1934": "Amarsingh Pandurang Rane, educationist, was born at Banage, Kolhapur.",
        "1939": "Motganhalli Laxmanarsu Jaisi alais Jaisimha, cricketer (Indian batsman of the sixties), was born in Secundrabad.",
        "1943": "Gandhi breaks his hunger strike after 21 days.",
        "1948": "B. S. Munje, founder of Bhosla Military School, passed away.",
        "1952": "The Indian National Congress secured absolute majority in the Lok Sabha in the General elections.",
        "1967": "India signed the International Space Treaty in Moscow.",
        "1978": "Origin of Saka Era (India).",
        "1982": "Firaq Gorakhpuri \"Raghupati Sahay\", great writer, nationalist and who revolutionised Urdu poetry, died.",
        "1983": "Seventh Non-Aligned Summit started at New Delhi.",
        "1989": "Gwal Pahari in Haryana switched on the solar energy centre of the first pilot 50 kilowatt solar power plant.",
        "1990": "JD-BJP coalition government in Gujarat, Chimanbhai Patel to become CM; Sharad Pawar in Maharashtra and Bhairon Singh Shekhewat of BJP to head the BJP-JD coalition government in Rajasthan.",
        "1993": "Sharad Pawar nominated CM of Maharashtra.",
        "1996": "Haryana govt. bans liquor vends and bars in rural areas.",
        "1997": "Senior Officials Meeting of Indian Ocean Rim (IOR) countries begins in Mauritius.",
        "1999": "Four members of the forward Bhumihar community and alleged members of the Ranbir Sena are gunned down by an armed squad of the People's War Group in Bhimpura village of Jehanbad district in Bihar.",
        "2000": "Nitish Kumar, Samata Party leader,  sworn in Bihar Chief Minister. Governor V.C. Pande's decision evokes widespread criticism."
    }
}