{
    "title": "Events for April 3",
    "events": {
        "1670": "Tanaji Malusure, right hand of Chhatrapati Shivaji Maharaj, passed away during the battle of Singhgad fort.",
        "1680": "Chhatrapati Shivaji Maharaj, great Maratha emperor, patriot, soldier, freedom fighter, revolutionary and great son of India, passed away at Raigarh fort. His son Sambhaji succeeded to the throne.",
        "1700": "Sikandar, former sultan of Vijapur, passed away at Satara in the imprisonment of Mughals.",
        "1857": "Queen Victoria declared as Queen of India also.",
        "1903": "Kamaladevi Chattopadhyay, famous politician, freedom fighter and social worker, was born in South Kanara, Karnataka.",
        "1912": "M. Varadarajan, educationist and author, was born at Tirupattur.",
        "1914": "Sam Hormuj Framji Jamshedji Manekshaw, India's first Field Marshal, was born. He was better known as \"Sam Manekshaw\".",
        "1926": "Muslim-Hindu riots destroy temples, killing 12, wounding 100 in Calcutta.",
        "1932": "Boycott of British goods was so widespread that 70\\% of cotton products were now thought to have come from Japan.",
        "1946": "Sagarmal Gopa, devoted patriot, freedom fighter and political worker, was burnt alive.",
        "1950": "Jayprakash Shankarrao Mundada, cabinet Minister of BJP-Shiv Sena alliance, was born.",
        "1956": "Nehru announces that troops have been sent to control Naga tribal people in the Burmese border area, who are asking for a separate state.",
        "1966": "First Indian-made computer commissioned in Jadavpur University campus.",
        "1978": "Pandit Hridaynath Kunzru, social reformer, politician, passed away. He contributed greatly to public life, fighting against caste system, untouchability etc. He was closely affiliated to the 'Servants of India Society' with Ghokhaleji. He even declined to accept the \"Bharat Ratna\" award conferred on him.",
        "1984": "Sikh terrorists kill a member of Parliament in his home in New Delhi.",
        "1987": "S.H. Vatsyayan passed away.",
        "1988": "Rajiv Gandhi seals the border between Punjab and Pakistan.",
        "1991": "UP Assembly dissolved to pave way for Assembly polls .",
        "1992": "Nagaland brought under President's rule.",
        "1994": "B. Rachaiah,Kerala Governor, takes charge of Goa.",
        "1996": "Union Ministers P. Chidambaram and M. Arunachalam resign over the issue of revival of alliance between Cong (I) and AIADMK.",
        "1998": "Pramod Mahajan, senior BJP functionary, is appointed Political Advisor to Prime Minister \"in the rank and status of Cabinet Minister in the PMO\".",
        "1999": "India's INSAT-2E multipurpose telecommunications satellite is successfully launched from the Kourou space station in French Guyana."
    }
}