{
    "title": "Events for May 3",
    "events": {
        "1718": "Baba Jassa Singh Ahluwalia, great freedom fighter, social reformer and leader, was born at Ahlu village, Lahore.",
        "1764": "Mir Kasim, with the backing of Delhi Emperor, attacked on Patna but this weak Emperor was defeated by Britishers. Britishers became the rulers of Bengal, the richest province of India.",
        "1765": "Clive became Governor of Bengal for second time from England after he returned to Calcutta.",
        "1896": "Vengalil Krishnan Krishna Menon, great nationalist, lawyer, freedom fighter, barrister and member of the Rajya Sabha, was born at Panniyankara in Calicut, Kerala.",
        "1913": "Dhundiraj Govind Phalke, more generally known as Dada Saheb Phalke, was responsible for the production of India's first fully indigenous silent four-reel feature film 'Raja Harishchandra' which heralded the birth of the Indian film industry. The film had titles in Hindi and English and was released on May 3, 1913 at the Coronation Cinematograph in Bombay.",
        "1927": "Riots between Sikhs and Muslims in Lahore claims 14 lives and leaves 100 injured.",
        "1936": "Engelbert Humperdinck [Arnold George Dorsey], famous singer, was born in Madras, India.",
        "1945": "Hurricane-equipped squadrons played a major role in the Arakan offensive which began in December 1944, disrupting the enemy's lines of communication and constantly harrying the Japanese forces until victory was achieved with the re-occupation of Rangoon.",
        "1947": "Indian National Trade Union Congress Intak was established.",
        "1959": "Sadhvi Uma GulabSingh Bharti was born in Dunda, Distt. Tikamgarh (Madhya Pradesh).",
        "1962": "Hundreds of Muslims are killed in clashes with Hindus in West Bengal.",
        "1969": "Dr. Zakir Hussain(1897-1969), third President of India and the first Muslim President who occupied this office on 13 May, 1967, passed away. He is also remembered as an educationist.",
        "1971": "Dhanjay Ramchandra Gadgil, famous economist, passed away.",
        "1977": "Hamid Dalwai, father of Muslim Satyashodhak Mandal in Maharashtra, passed away.",
        "1994": "Election Commission recognises DMK headed by M. Karunanidhi as the rightful claimant to the symbol of rising sun and the flag reserved for it.",
        "1997": "Vijay Pradhan, additional senior counsel for Srikrishna Commission probing 1992-93 riots in Mumbai, resigns. He is not allowed to cross-examine Chief Minister Manohar Joshi.",
        "1998": "Kushabhau Thakre takes over as the new BJP President.",
        "1999": "Cochin Port Trust men and Southern Railway women won the 21st Federation Cup volleyball titles in Pathanamthitta."
    }
}