{
    "title": "Events for June 3",
    "events": {
        "1818": "Maratha wars between British & Maratha Confederacy in India ends.",
        "1844": "Balkrishna Bhatt, essay writer, critic and journalist in Hindi, was born.",
        "1865": "George V, King of England (1910-36), was born.",
        "1890": "Khan Abdul Gafar Khan, follower of Mahatma Gandhi, was born.",
        "1895": "Kavalam Madhava Panikkar, historian and Indian diplomat (Asia & Western Dominance), was born.",
        "1901": "Mahakavi G. Sankara Kurup, Malayalam poet, was born. He was the first winner of the conveted Gyaanpeeth Award in 1965 for his poems \"\"Odakkuzhal\"\" in Malayalam.",
        "1912": "Sohrab Pirojsha Godrej, great industrialist, was born.",
        "1915": "Sir' knighthood was granted to Gurudev Rabindranath Tagore by the British Government.",
        "1916": "Smt. Nathibai Damodar Thakarsey Women's University was established.",
        "1924": "Muthuvel Karunanidhi, politician and playwright, was born in Thirukkuvalai (Thanjavur).",
        "1929": "Chimanbhai Patel, former Chief Minister of Gujarat, was born.",
        "1930": "George John Fernandes, social reformer and politician, was born in Mangalore (Karnataka).",
        "1947": "Evening newspaper 'Jay Hind' published.",
        "1972": "First British designed Indian built mordern warship of the Leander class, 'INS Nilgiri'  commissioned Prime Minister Indira Gandhi, was completely made in Mazgaon Dock, Mumbai.",
        "1977": "K. Brahmananda Reddi elected President of the Indian National Congress.",
        "1985": "The week comprising of five working days was implemented in Central Government Offices for its staff.",
        "1992": "M. N. Goiporia, SBI Chairman, asked to go on leave following security scam.",
        "1993": "K N Venkatasubramanian,IOC Chairman, suspended for leaking information about oil purchase plans to international dealers.",
        "1995": "President's rule in J&K extended for another 6 months.",
        "1997": "Four women ministers (Renuka Choudhry, Kamala Sinha, Ratnamala Savanur & Jayanti Natarajan) join I K Gujral cabinet.",
        "1998": "The naval version of the surface-to-air missile, Trishul, is test-fired in Kochi.",
        "1999": "Flight Lieutenant K. Nachiketa is handed over by the International Committee of the Red Cross to the Indian High Commissioner inside the High Commission premises."
    }
}