{
    "title": "Events for July 3",
    "events": {
        "1350": "Saint Namdev passed away.",
        "1661": "Portugal gives Tanger & Bombay to English King Charles II.",
        "1745": "Ranoji Shinde died.",
        "1751": "Pilaji Jadhav died.",
        "1760": "Maratha army, under Sadashiv Rao Bhau and Vishvas Rao, captured Dehli.",
        "1838": "Mama Parmanand, one of the founders of `Prarthana Samaj', was born.",
        "1863": "Little Crow, [Ta-oya-te-duta], santee Sioux Indian chief, passed away.",
        "1897": "Hansa Mehta, educationist and social reformer, was born at Surat (Gujarat).",
        "1898": "Gopinath Bhagwan was born at Banamohalla, Srinagar. He is one of the most eminent saints who have graced the sacred land of India. An Ashram at Kharyar, Srinagar is set up by his disciples and devotees to preach his meditation.",
        "1908": "Bal Gangadhar Tilak was arrested as a traitor by the Britishers.",
        "1927": "A. Neelameghan, librarian, was born at Ootacamund in Tamil Nadu.",
        "1936": "Jahangir Khan kills a sparrow while cricket bowling during Cambridge U vs MCC match.",
        "1941": "Adoor Gopalakrishnan, cinematographer (Kathapurushan, Mathulikal), was born.",
        "1948": "H. M. S. Auchils was taken over by Indian Navy.",
        "1956": "Pandit Nehru and New Zealand Prime Minister Sir Sidney Holland are given the freedom of the City at London.",
        "1972": "Shimla Non-Arm Agreement on Kashmir signed between Indira Gandhi and Z. A. Bhutto.",
        "1975": "Virendrakishor Roy Chaudhary, famous music director, passed away.",
        "1979": "Construction of the main second Howrah Bridge (Vidyasagar Setu) started.",
        "1985": "Air Chief Marshal D A La Fontaine PVSM, AVSM, VM., became the Air Officer Commanding, India Command. He was in this office till 31/July/1988.",
        "1987": "The Festival of India in the USSR, to be inaugurated, is the largest cultural manifestation to be held by our country.",
        "1991": "Rupee devalued again from 10.58 to 10.96\\% .",
        "1992": "Avinash Ganesh Mohadikar, journalist and former editor of magzine `Vyapar Udyog', passed away.",
        "1996": "25 to 30\\% hike in prices of petroleum products.",
        "1997": "Tamil actor Sivaji Ganesan gets 1996 Dada Saheb Phalke award for outstanding contribution to Indian cinema.",
        "1998": "Kavi Pradeep,  Hindi film lyricist, is selected for the 1997 Dada Saheb Phalke award."
    }
}