{
    "title": "Events for August 3",
    "events": {
        "1780": "British officer captain Bruce conquered Gwalior fort under Major Popham after defeating Sindhiya.",
        "1886": "Maithili Sharan Gupta, first man of modern Hindi poetry and literature, writer, patriot and social worker, was born at Chirgaon village near Jhansi.",
        "1890": "Sriprakash, freedom fighter, prolific writer and member of the AICC, was born at Varanasi.",
        "1898": "Udayshankar Bhatt, modern Hindi dramatist, poet and novelist, was born.",
        "1900": "Nana Patil, great revolutionary, was born.",
        "1905": "Uma Datt Sraswat, famous writer, was born at Biswan in U.P.",
        "1930": "Vyanktesh Bapuji Ketkar, famous astrologist and researcher, died.",
        "1939": "Apoorva Kumar Sengupta, cricketer (1959 Test - India vs WI,  without distinction), was born in Lucknow.",
        "1947": "Shetkari Kamgar Party was established at Devachi Alandi.",
        "1954": "Atomic Energy Department established.",
        "1957": "Devdas Gandhi, son of Rashtrapita Mahatma Gandhiji and noted journalist, passed away.",
        "1960": "Gopal Sharma, great Indian cricket off-spinner (2 Tests 1984-85), was born in Kanpur.",
        "1967": "Rasiklal Das, great revolutionary, died.",
        "1970": "Chonira Beliappa Muthamma,  first women career diplomat, appointed ambassador to Hungary.",
        "1984": "Bomb attack at Madras airport claims 32 lives.",
        "1985": "Ramon Magsaysay Award for Public Service goes to Baba Amte.",
        "1991": "About 280 kgs of gold ornaments valued at $15 million, which had been deposited in the Portuguese bank in Goa by its natives, flown back to India.",
        "1993": "Government assures Lok Sabha that it will revive the proposal for a multi-member election commission.",
        "1994": "The first successful heart transplant operation was performed at the All India Institute of Medical Science, New Delhi, by a team of doctors led by Prof. P. Venugopal  (25-2-96).",
        "1995": "Enron Power Project scrapped by Maharashtra government.",
        "1996": "Leander Paes wins a bronze (tennis) at Atlanta, bringing India an Olympic medal  after a gap of 16 years.",
        "1997": "Mahesh Bhupathi and Leander Paes win the doubles title in the Canadian  Maurier Super Nine Doubles Open tennis championships held in Montreal.",
        "1998": "35 persons were killed as Govind Towers at Bandra in Mumbai collapsed."
    }
}