{
    "title": "Events for September 3",
    "events": {
        "1767": "Colonel Smith was defeated in the battle of Changama that took place between the combined forces of Nizam and Hyder Ali and the British army. This was the first war of Mysore. The British concluded a humiliating peace with Hyder Ali of Mysore.",
        "1905": "Kamlapati Tripathi, leader of Indian National Congess, was born.",
        "1906": "Prithviraj Kapoor, veteran film actor, was born in Peshawar. His first film was 'Challenge' (1929). He is the founder of Prithvi Theatre in Bombay. He is remembered for his  immortal role of Akbar is film 'Mugul-E-Azam'.",
        "1915": "Following the monsoon, a good harvest is expected, except in Gujarat, in northern Rajputana and Punjab where isolated falls were recorded in Delhi.",
        "1916": "Annie Besant started 'Home Rule' movement.",
        "1931": "Kanhaiya Prasad Sharan, politician, journalist and social worker, was born at Muzaffapur, Bihar.",
        "1953": "Laxmanrao Parvatkar (Khaprumama), famous Tabla player, passed away.",
        "1979": "M. M. Bhatnagar was appointed as the Narcotics Commissioner of India. He headed this office till 14-06-1985.",
        "1983": "U.S. Census reports world population at 4.72 billion. China has 1.05 billion and India 731 million.",
        "1984": "Air Chief Marshal Dilbagh Singh PVSM, AVSM, VM, retired as the Air Officer Commanding, India Command.",
        "1987": "Vishwanathan Anand, 17, becomes India's first and the world's youngest Grandmaster.",
        "1992": "Delhi High Court verdict on Bofors challenged in the Supreme Court.",
        "1993": "Pawar resigns from Lok Sabha to take up the newly won Maharashtra Legislative Council seat.",
        "1994": "The government decides to disinvest government holding in 21 Public Sector Units including ITI, IOC and ITDC.",
        "1995": "Ram Jethmalani (lawyer and MP) launches a new party, Bharatiya Lok Panchayat, to rid the country of its evils.",
        "1997": "Anjan (Lalji Pandey), well known lyricist and noted poet, died.",
        "1999": "India launches a new phase of military modernisation after the Kargil conflict.",
        "2000": "National Cricket Academy (NCA) wins the MRF Buchi Babu Cricket tournament in Chennai."
    }
}