{
    "title": "Events for January 4",
    "events": {
        "4\tJanuary\t1881": "Publication of newspaper 'Kesri' started.",
        "4\tJanuary\t1889": "Judge M. Patanjali Sastri, Chief Justice of India, was born.",
        "4\tJanuary\t1892": "J. C. Kumarappa, a Gandhian by thought, was born.",
        "4\tJanuary\t1906": "Prince of Wales laid the foundation stone of Victoria Memorial Hall at Calcutta.",
        "4\tJanuary\t1907": "Govind Rai, renowned Gujarati novelist and writer of  'Saraswati Chandra', passed away.",
        "4\tJanuary\t1909": "Prabhakar Padhye, modern Marathi  litterateur, was born.",
        "4\tJanuary\t1914": "Indira Sant, famous Marathi poet, was born.",
        "4\tJanuary\t1924": "Vidyadhar Gokhle, editor, playwright and politician, was born.",
        "4\tJanuary\t1931": "Maulana Mohammad Ali Jauhar, great orator, eminent journalist, fighter and one of the founders of Jamia Millia Islamia, died at London during the first Round Table Conference. He was closely associated to Mahatma Gandhi and took active part in Civil Disobedience Movement.",
        "4\tJanuary\t1932": "Mahatma Gandhi and other members of his All-India National Congress are back in jail again. After the collapse of the London conference, British authorities  cracked down even harder on Gandhi and his followers, and the Mahatma urged Indians to increase their acts of civil disobedience. \"Wake up from sleep,\" Gandhi said as he ordered a boycott of British goods. \"Discard foreign cloth. Discard narcotics. Discard violence. Defy all orders calculated to crush the national spirit.\" The government  declared Gandhi's Congress an illegal organization. Under new laws, even peaceful picketing is illegal. The Congress party responded to the crackdown by recruiting more followers and striking more plants.",
        "4\tJanuary\t1937": "R. Surendranath, cricketer (Indian pace bowler in 11 Tests early 60s), was born in Meerut.",
        "4\tJanuary\t1940": "Shrikant Sinkar, famous Marathi novelist, was born.",
        "4\tJanuary\t1948": "Burma achieved its independence from Great Britain. In 1989, Burma changed its name to Myanmar to reflect the multi-ethnic composition of the country.  Apart from the Burmese, the main ethnic minority groups are the Karen, Shan, Mon, Chin, and Kachin.  Just as the Burmese did against the British, almost all of these ethnic groups have struggled against the Burmese government for self-determination.",
        "4\tJanuary\t1954": "Judge Mehr Chand Mahajan became the Chief Justice of India. He helded this office till 22/12/1954.",
        "4\tJanuary\t1958": "Waverley John Anderson, Scottish viscount and Governor of Bengal, died at the age of 75.",
        "4\tJanuary\t1964": "The First Diesel Engine came out of the Varanasi Diesel Engine Carshed.",
        "4\tJanuary\t1966": "Indo-Pak Summit, the peace talk between Pakistan and Indian leaders, started at Tashkent. The prominent personalities were Lal Bahadur Shastri and Gen. Ayub Khan.",
        "4\tJanuary\t1967": "Hindustan Aeronautics Ltd. began delivery of the MIG aircraft.",
        "4\tJanuary\t1972": "Pakistan proposed to talk after the war.",
        "4\tJanuary\t1992": "The goverment promulgates an ordinance to prevent countermanding of election in the event of death of independent candidates.",
        "4\tJanuary\t1993": "K. Margabandhu, former UCO Bank chief, was arrested on charges of amassing wealth beyond his means.",
        "4\tJanuary\t1994": "Rahul Dev Burman, famous music director better known as 'Pancham Da', died at the age of 56.",
        "4\tJanuary\t1995": "IAF batch (Angel of Mercy) returns from Somalia after 16 months of stay and 700 sorties.",
        "4\tJanuary\t1998": "V.D.I.S. nets Rs.10,500 crores with Rs 33,000 crore black money disclosed in 4,66,031 declarations made.",
        "4\tJanuary\t1999": "Karnataka's Farah Khan made it three-in-a-row in the National ladies billiards championship in Delhi."
    }
}