{
    "title": "Events for November 4",
    "events": {
        "4\tNovember\t1656": "Mohammed Adil Shah passed away.",
        "4\tNovember\t1845": "Vasudeo Balvant Phadke, great revolutionary, social reformer and father of armed freedom fighting movement, was born at Shirdhon village in Raigad district.",
        "4\tNovember\t1889": "Jamnalal Bajaj, industrialist, social reofrmer and freedom fighter, was born in the village of Kashi -Ka -Bas near Jaipur.",
        "4\tNovember\t1915": "Sir Pherozeshah Mehta also refered as the \"Lion of Bombay\" died in Bombay. He was founder of the English newspaper, \"Bombay Chronicle\", and was knighted in 1904. He was appointed as the Vice Chancellor of the University of Bombay in 1910 and was founder of Central Bank of India.",
        "4\tNovember\t1925": "Rutwik Kumar Ghatak, famous film producer and actor, was born.",
        "4\tNovember\t1930": "Ranjit Roy Chaudhury, educationist, was born at Patna, Bihar .",
        "4\tNovember\t1931": "Mahatma Gandhi paid a visit to Buckingham Palace clad in his loin cloth and homespun shawl, and met India's Emperor on this date. Gandhi's sandals pattered on the floor as he crossed the drawing room to greet King George V and Queen Mary.",
        "4\tNovember\t1936": "Shankutala Devi, great mathematician, was born. She had then defeated the computer in making mental major calculation.",
        "4\tNovember\t1947": "India and Pakistan accuse each other of violating their neutrality agreement in the Kashmir dispute as Indian troops invade the state.",
        "4\tNovember\t1948": "To supplement the Tiger Moths, Prentice basic trainers were delivered to the RIAF during the course of 1948, eventually to see service at Jodhpur, Tambaram and Ambala, but truly epoch making in so far as the Service was concerned was the arrival of three Vampire F.Mk.3 jet fighters in India on November 4, 1948 .",
        "4\tNovember\t1951": "Vijay Merchant scores 154 v England in his last Test Cricket innings.",
        "4\tNovember\t1954": "Himalayan Mountaineering Institute established at Darjiling.",
        "4\tNovember\t1970": "Pandit Shambhu Maharaj, the great Kathak dance master and King of India,  passed away.",
        "4\tNovember\t1971": "148 Indians and rebels die as they try to capture the border post of Akhipaba at Pakistan.",
        "4\tNovember\t1974": "Ahindra Chaudhary, famous Bengali film and stage artist, passed away.",
        "4\tNovember\t1982": "Gen. Zia-ul-Haq of Pakistan visits New Delhi. Agreement to set up a Joint Commission.",
        "4\tNovember\t1988": "The merchant ship was spotted by a maritime reconnaissance aircraft on the morning,  where upon IN ships Godavari and Betwa sped to the scene to bring the rebels to book.",
        "4\tNovember\t1997": "UNESCO named 8 scientists laureates of the five 1997 science prizes for their contribution. Prof. Dorairajan Balasubramanian (58), Director of the Centre for Cellular and Molecular Biology of Hyderabad were named Laureate of Kalinga prize for popularisation of Science.",
        "4\tNovember\t1998": "Viswanathan Anand wins the 3rd Fontys chess tournament at Tilburg. Paramjeet Singh upstages Milkha Singh's 38-year-old 400m record at the national open athletic championship at Calcutta."
    }
}