{
    "title": "Events for December 4",
    "events": {
        "4\tDecember\t1661": "Murad Baksh was executed on the charge of murdering Diwan Ali Nagi.",
        "4\tDecember\t1796": "Bajirao became the second Peshwa.",
        "4\tDecember\t1829": "Britain abolished \"sati\" in India (widow burning herself to death on her husband's funeral pyre).",
        "4\tDecember\t1888": "Romesh Chandra Majumdar, great Bengali historian, was born.",
        "4\tDecember\t1894": "Swami Brahmanand was born at Hamirpur district in UP. He joined freedom movement and participated in Salt Satyagraha, Non Cooperation Movement and Quit India Movement. He also established Brahmanand Inter College (1938), Brahmanand Sanskrit Mahavidyalaya (1943) and Brahmanand Mahavidyalaya (1960).",
        "4\tDecember\t1898": "Kariamanikkam Srinivasa Krishnan, Indian Scientist and Physicist-Philosopher, was born in Tamil Nadu.",
        "4\tDecember\t1910": "Motilal, famous film actor, was born.",
        "4\tDecember\t1919": "Inderkumar Gujral, former Prime Minister of India, was born at Jhelum (Pakistan).",
        "4\tDecember\t1920": "Michael Bates, actor (Clockwork Orange, Patton), was born in Jhansi, India.",
        "4\tDecember\t1924": "Gateway of India was inagurated by Lord Riding.",
        "4\tDecember\t1940": "Khurshid Novrojee, freedom fighter, was arrested for not giving prior intimation to go in tribal area. She had founded Gujarat, Kathiwad and Bombay Presidency \"Women Voluntary Amry\".",
        "4\tDecember\t1959": "Power Project was signed betwen India and Nepal, an agreement on the Gandak Irrigation.",
        "4\tDecember\t1973": "Mohan Rakesh, famous modern Hindi dramatist, novelist and story writer, passed away.",
        "4\tDecember\t1977": "Ajit Agarkar, promising Indian ODI all-rounder, was born.",
        "4\tDecember\t1982": "Asian Games at Delhi concluded.",
        "4\tDecember\t1989": "Hardeo Joshi replaces Shiv Charan Mathur as CM of Rajasthan.",
        "4\tDecember\t1990": "Maharashtra Gomantak Party withdraws support to Goa ministry led by Dr. Luis Proto Barbosa.",
        "4\tDecember\t1991": "Lok Sabha approves a vital bill seeking to bring sick public sector units within the purview of the BIFR.",
        "4\tDecember\t1992": "RBI devalues Rupee by 1.18 \\% against the US dollar. India emerges overall champions with 10 golds; 8 silver and 14 bronzes in the 4th Asian Junior Athletic meet in New Delhi.",
        "4\tDecember\t1993": "Mulayam Singh Yadav, takes over as CM of UP; Bhairon Singh Sekhawat of Congress sworn in as CM of Rajasthan.",
        "4\tDecember\t1997": "World Bank commits to Haryana a loan of $600 millions (about Rs. 2,350 crores) - largest single bank loan to any State.",
        "4\tDecember\t1998": "Ilayaraja, nusic composer, selected for the Lata Mangeshkar award instituted by the Madhya Pradesh Government.",
        "4\tDecember\t1999": "Uman J. Shah is sworn in West Bengal Governor.",
        "4\tDecember\t2000": "India deports TULF functionary-turned LTTE supporter M.K. Eelavendhan, a Chennai resident for over a decade."
    }
}