{
    "title": "Events for February 4",
    "events": {
        "1318": "Banka Mahar, 'bhagwatbhakt', passed away by taking Samadhi.",
        "1628": "Shahjahan was enthroned and proclaimed emperor at Agra.",
        "1757": "Lord Clive remained unsuccessful after sending two ambassadors to make treaty with Siraj -Ud -Daula, while he was marching towards Calcutta.",
        "1909": "Narayan Dattatreya Sane, two test cricket umpire 1959-60, left-hand opening batsman and fast bowler, was born at Vidarbha.",
        "1910": "New Press Censorship bill announced; govt. say repressive measures necessary to halt unrest.",
        "1924": "Kocheril Raman Narayan, ninth Vice President of India and now president of India, was born.",
        "1934": "Madhusudan Das \"Utkal Gourab\", passed away. He was described as a great Indian patriot, who wore himself out is giving shape and reality to various nation-building schemes. He wrote a number of articles and poems both in Oriya, English and Bengali to fill people with enthusiasm and patriotism. He was the first non-official Vice Chairman and then Chairman of Cuttack District Board.",
        "1938": "Birju Maharaj, famous Kathak Dancer \"Guru\", was born.",
        "1944": "Japanese attack Indian Seventh Army at Burma.",
        "1946": "Dr. Satnarayan Nathulal Jatiya was born in Jawad, Distt. Mandsaur (Madhya Pradesh).",
        "1948": "Rakeshchandra Satchidananda Shukla, cricket leg-spinner (1 Test India v Sri Lanka 1982), was born in Kanpur.",
        "1953": "Indo-Pak talk on Kashmir opened under Dr. Graham in Geneva.",
        "1973": "India's then biggest commercial ship merchant fleet 88,000 DWT super tanker \"Jawaharlal Nehru\" commenced its services for the Nation.",
        "1974": "Satyendra Nath Bose, a noted mathematician, professor and physicist, passed away at Calcutta. He contributed greatly to statictical mechanics, the electromagnetic properties of ionosphere, the therories of X-ray crystallography and thermoluminescence, and unified field theory. Bose instituted \"Planck's Law and the Hypothesis of Light Quana\" in 1924.",
        "1976": "Lok Sabha's life extended by one year.",
        "1990": "Ernakulam was declared the first totally literate district in India.",
        "1991": "An abortive bid to hijack a Calcutta-Agartala flight by a 24-year old youth.",
        "1992": "National Renewal Fund for industries set up.",
        "1993": "D. C. Kothari, famous scientist and educationalist, passed away.",
        "1994": "India elected to the executive boards of UNDP, UN Population Fund and UNICEF."
    }
}