{
    "title": "Events for March 4",
    "events": {
        "1858": "J. P. Walker, British Officer, along with 200 prisoners who were mainly from the Indian Sepoy Mutiny, sailed from Calcutta to start a new settlement in the Andaman Islands.",
        "1879": "Bethune' College of Calcutta was established as the pioneer of women s college education in India.",
        "1895": "Surendra Singh Majithia, great industrialist, was born.",
        "1906": "Hakim Abdul Majid started his medial dispensary under the name of Hamdard Dawakhana at Delhi.",
        "1919": "Jagtindar Nath Beri, physics expert, was born.",
        "1924": "Shyam Lal Gupt 'Parshad' wrote the song  'Jhanda Ooncha Rahe Hamara'.",
        "1925": "Jyotirindranath Tagore, great Bengali litterateur and poet, passed away.",
        "1927": "Dr. Laxminarayan Lal was born.",
        "1939": "Lala Har Dayal, revolutionary, nationalist and freedom fighter, passed away at Philadelphia.",
        "1951": "Eleven countries and 489 male and female athletes participated in the first Asian Games started at National Stadium in New Delhi.",
        "1961": "First Indian aircraft carrier naval fighter vessel ''I.N.S. Vikrant''  was commissioned in Belfast.",
        "1990": "Sunderlal Patwa (BJP) and D. Ramachandran (DMK) named CM's of Madhya Pradesh and Pondicherry respectively.",
        "1991": "Finance Minister Yashwant Sinha presents mid-term budget, cut in food and fertiliser subsidy, amounting to Rs. 934 crore, proposed.",
        "1994": "Lech Walesa, Polish President, visit India.",
        "1995": "Kakrapar nuclear power station's second unit located near Surat synchronised to the western grid after mandatory tests.",
        "1996": "Union govt. decides to set up a national grid for the distribution of petroleum products.",
        "1997": "Govt. not to print Re. 1 , Rs. 2 & Rs. 5 currency notes any more, as these three denominations have been coinised.",
        "2000": "Geeta Mukherjee (76), veteran communist leader,  died of a massive heart attack in New Delhi. Popularly known as 'Geetadi', she won every Lok Sabha election from Panskura in West Bengal since 1980."
    }
}