{
    "title": "Events for April 4",
    "events": {
        "1786": "In British Parliament, Berk alleged 11 corruption charges against Indian Governor General Warren Hastings.",
        "1858": "Rani Laxmibai fled to Gwalior through Kalpi after giving a solid blow to British troops.",
        "1889": "Makhanlal Chaturvedi, famous Hindi poet, writer, Hindi litterateur and President of All India, was born in Babai village, Madhya Pradesh.",
        "1898": "Hiralal Sen and his brother Motilal Sen purchased a Bioscope Cinematographic Machine from London. The first show of imported films was arranged by them at Classic Theatre on April 4, after which they formed 'The Royal Bioscope Co.,' controlled by H. L. Sen & Bros., 85/2, Maszid Badi Street, Calcutta. The Bioscope Company started touring the provinces of Bengal, Orissa and Bihar.",
        "1904": "Kundan Lal Saigal, golden voiced singer, legend in his lifetime, actor and film maker, was born in Jammu. Some of his famous songs are \"Ek Bangla Bane Nayara\", \"Diya Jalao\", \"Jab Dil Hi Toot Gaya\".",
        "1905": "More than 10,000 people are feared to have perished in an earthquake that hit the northeast Indian province of Lahore during the night. The town of Dharmsala was almost completely razed to the ground with the entire population rendered homeless and sleeping out in icy conditions. Five hundred Gurkha soldiers were buried alive when their stonebuilt barracks collapsed on them. The towns of Kangra and Palampur have also been leveled to the ground by the worst natural disaster measured at 8 on Ricter Scale. In Lahore, 70 Hindus were killed, Muslim inhabitants were parading in the streets, weeping and offering up prayers with ceremonial rites. Several British administrators and missionaries were known to have been killed or injured. At Simla, Lady Curzon, wife of the Viceroy, had a close escape from death when a chimney crashed into the room in which she was sleeping.",
        "1910": "Sri Aurobindo left politics and reached Pondicherry, where he made the seat of Yoga.",
        "1912": "Dhundiraj Gopal Sapre, Sahityaratna and Sanskrit litterateur, was born.",
        "1926": "Martial law is declared in Calcutta as rioting continues.",
        "1932": "Rameshchandra Gangaram Nadkarni alias \"Bapu Nadkarni\", cricketer (economical Indian slow left-armer 1956-68), was born in Nasik, Maharashtra.",
        "1938": "A. M. Chakrabarty was born in Sainthia at West Bengal. He found that under the optimum conditions of time, temperature and nutrients the Hydrocarbon-eating \"\"qualities'' of four diffrent strains of bacteria could be transferred into one. He also showed that this super-strain of bacteria reproduces itself.",
        "1942": "Japanese Navy destroyed 3 British battleship to sink in the Bay of Bengal during the Second World War.",
        "1947": "San Francisco's Henry Grady chosen the first U.S. ambassador to India.",
        "1951": "West Germany establishes full diplomatic relations with India.",
        "1971": "Pakistan reports seizure of nine Indian army vehicles.",
        "1984": "Squadron Leader Rakesh Sharma was the first Indian Astronaut to go in space from Baikanaur aboard Soviet Space Craft 'Soyuz 11' and revolved around the earth.",
        "1987": "Agney, famous Hindi litterateur and Gyanpeeth Award winning poet, passed away.",
        "1990": "MI-4 was re-equipped with the mighty Mi-35, thus becoming a dedicated Attack Helicopter unit of the IAF.",
        "1991": "Gujarat CM Chimanbhai Patel JD (Gujarat)-to contest the elections with poll understanding with Congress (I).",
        "1994": "Ravi Naik, Goa CM, resigns.",
        "1996": "Supreme Court rules that political parties without audited accounts cannot take advantage of an election law that exempts tax expenditure on candidates.",
        "1997": "World Bank Atlas for 1997 put India as world's fifth largest economy in terms of purchasing power parity estimated around $1318 trillion.",
        "1998": "G. Sarala Devi, 62, CPI leader and general secretary of the National Federation of Indian Women, passed away in Hyderabad.",
        "1999": "India routed China 5-0 in the Davis Cup Asia Oceania Group I second round play-off in Calcutta.",
        "2000": "A. B. Vajpayee, Prime Minister, inaugurates Samvidhan.com, a website about the Constitution. The site is a part of the Hindi portal, Webdunia.com."
    }
}