{
    "title": "Events for May 4",
    "events": {
        "1783": "Tipu Sultan was enthroned as the ruler of Mysore after the death of Haider Ali in a simple ceremony at Bednur. He continued the Second Mysore War against the English. He defeated many EnglishGenerals like Brithwhite & Col. Bailey. Tipu Sultan signed the treaty at Mangalore on 11th March 1784 A.D. which was known as the Mangalore treaty.",
        "1799": "Tipu Sultan is killed in a battle against 5,000 British soldiers who stormed and razed his capital, Seringapatanam.",
        "1832": "Darpan', a  fortnightly magazine started publishing as a weekly.",
        "1849": "Jyotirindranath Tagore, Bengali litterateur and poet, was born.",
        "1854": "The first stamp was officially issued from Calcutta where the first modern post office was established.",
        "1923": "Mrinal Sen, famous film director, was born.",
        "1932": "Many are arrested as Congress agents picket Bombay post offices in celebration of Gandhi Day.",
        "1935": "Dalip Kaur Tiwana, great educationist and writer, was born in Ribbon village, Punjab.",
        "1957": "Rai Chaudhary Hemchandra, great historian, passed away.",
        "1959": "Nehru rejects proposals that India and Pakistan resolve their differences and set up a common alliance against Communist China.",
        "1960": "Washington, Ike signs wheat pact with India for largest U.S. food sale.",
        "1980": "Coal Mine Worker's Day established.",
        "1989": "Ashutosh Mukhopadhyay, famous Bengali litterateur, passed away.",
        "1990": "Supreme Court directs Central Government to set up a Tribunal to resolve Cauvery water dispute between Tamil Nadu and Karnataka.",
        "1992": "India and Russia sign a five-year agreement on trade and economic cooperation.",
        "1993": "Santosh Yadav became the first Indian woman to conquer the Everest twice.",
        "1994": "Fourth developmental launch of ASLV. 113 kg Stretched Rohini Satellite Series (SROSS-C2) was launched by fourth developmental flight of ASLV-D4 from Sriharikota. This carried two scientific payload, a Gamma Ray Burst (GRB) experiment and a Retarding Potential Analyser (RPA). It is still in service.",
        "1995": "The fourth ASLV-D4 blasts off from Sriharikota, successfully placing the SROSS-C2 satellite in orbit.",
        "1998": "India is placed on the US Special 309 watch list."
    }
}