{
    "title": "Events for June 4",
    "events": {
        "1902": "Richard Allen, India, field hockey goal tender (Olympic-gold-1928), was born.",
        "1903": "Gandhiji established the weekly journal \"Indian Opinion\" organised at Phoenix farm near Durban.",
        "1912": "Alungal Mathai Thomas, social reformer, politician and diplomat, was born at Kurikad, Kerala.",
        "1926": "Dalai Lama introduces a tax on ears for Tibetans to equip the army. Those with only one ear will pay half the tax.",
        "1932": "Mahendranath Gupt, follower of Ramkrishna Paramhans, passed away.",
        "1936": "Nutan, film actress, was born.",
        "1941": "National Seva Dal was established.",
        "1947": "Dharmanand Damodar Kosambi, internationally famous Pandit of Buddhism, passed away.",
        "1953": "University of Cambridge confers honorary Doctorate of Laws on J. L. Nehru.",
        "1955": "Ministry of Iron & Steel inaugurated.",
        "1958": "The three-men Indian Mountaineering group  successfully climbed the high Peak in the Garhwal Hills Range.",
        "1959": "Chakravarti Rajagopalachari opposed the Socialist Policies of Indian National Congress and founded Swatantra Party alongwith Ranga.",
        "1972": "First Environment Day.",
        "1986": "Masti Vyanktesh Iyengar, famous Kannad author and Gyanpeeth Puraskar awardee, passed away.",
        "1987": "A Swedish Government enquiry finds that Bofors paid commission to middlemen for concluding Arms Purchase Agreement with India.",
        "1989": "Melville de Mellow, Eminent broadcaster, died.",
        "1992": "Stock broker Harshad Mehta and his associates arrested.",
        "1993": "The Babri tribunal strikes down ban on RSS and Bajrang Dal and upholds outlawing of VHP.",
        "1994": "Army successfully test-fires the short range surface-to-surface missile, 'Prithvi'.",
        "1997": "Special Judge Ajit Bharihoke discharges former Prime Minister P. V. Narasimha Rao and former Union Minister Prof. K. K. Tewary in St. Kitts forgery case for lack of sufficient evidence."
    }
}