{
    "title": "Events for July 4",
    "events": {
        "1729": "Kanhoji Angre, former Chief of Navy in Maratha kingdom, died.",
        "1760": "Meeran, Mir Jaffer's son, accidently died on the banks of Ganga near Patna due to lightning.",
        "1789": "British East India Company signed a treaty with the Nizam of Hydrabad and Peshwa of Pune against Tipu Sultan, King of Mysore, on the understanding that a cavalry of 10,000 would attack Tipu's territory and the conquered area would be divided amongst the three.",
        "1897": "Alluri Seetaram Raju, freedom fighter, was born in a Kshatriya clan in Andhra Pradesh. He is rememberred as one of the great sons of India in the annals of Indian history who fought valiantly for his motherland in the early period of the freedom movement.",
        "1899": "Vishnuprasad Ranchhoddas Trivedi, famous critic in Gujrati, educationist and author, was born at Umreth, Gujarat .",
        "1900": "Swami Shivanand Saraswati, religious leader, was born.",
        "1902": "Swami Vivekanand (Narendra Vishwanath Dutta), Indian religious leader and social reformer, died at Memorial Rock, KanyaKumari. His brilliant career came to a sudden end only at the age of 39.",
        "1912": "Pandit Nivrittibuwa Sarnaik, singer of  'Jaypur Gharana', was born.",
        "1914": "Savlaram Ravji Patil (P. Savlaram), film lyrisist and story writer, was born.",
        "1922": "Ghulam Ahmed, cricketer (off-spinner in 22 Tests for India in 1950's), was born in Hyderabad.",
        "1933": "Mahatma Gandhi sentenced to one year imprisonment.",
        "1985": "Police inquiry said bombs caused Air India jet disaster in New Delhi.",
        "1986": "Sunil Gavaskar celebrated his 115th Test in cricket at Edgbaston.",
        "1989": "Union Deputy Ministers were promoted to the rank of Ministers of State.",
        "1991": "Fourth test of missile 'Prithvi'.",
        "1992": "Sanskrit made a compulsory subject from sixth to intermediate classes in Uttar Pradesh.",
        "1994": "Labhuben Mehta, famous Gujrathi author, died.",
        "1995": "Rajan Pillai, business tycoon and biscuit king of India, who was convicted by a Singapore court for multi-million dollar fraud, was arrested in New Delhi.",
        "1997": "Centre frees from its control nine top public sector undertakings, accounting for over Rs. 10,000 crore profits annually, to become global giants by providing them full financial and operational autonomy. This included newsprint and paper from licensing controls.",
        "1999": "The Indian Army recaptured Tiger Hill after a 11 hour assault, and hoisted the tricolour atop the 16,500 ft. peak.",
        "2000": "Volvo's Environmental Prize went to Prof. Amulya K. N. Reddy of India and three others for their work on ''How the world's energy resources can be made to suffice as the population grows''."
    }
}