{
    "title": "Events for September 4",
    "events": {
        "1665": "Raja Jai Singh treaty of Purandar was signed between the Mughals and Chattrapati Shivaji Maharaj.",
        "1825": "Dadabhai Naoroji, first Indian in British parliament and merchant, was born at Navsari, Gujarat. He coined the word 'Swaraj'.",
        "1862": "Kaminikumar Chanda, social reformer and politician, was born.",
        "1880": "Bhupendranath Dutt, Bengali litterateur and politician, was born.",
        "1888": "Mahatma Gandhi left for London, England to study Law.",
        "1895": "Siyaramsharan Gupt was born.",
        "1921": "British govt. sends ultimatum to rebels in India, demanding their surrender within 48 hrs, at Madras.",
        "1927": "World fliers reach Karachi, India.",
        "1929": "N. Hanumantha Rao, cricket test umpire for 9 tests from 1978-84, was born in Karnataka.",
        "1946": "Interim Government formed.",
        "1947": "Gandhiji breaks fast.",
        "1952": "India returns Peking's famine-relief aid, saying it had political strings attached.",
        "1962": "Kiran Shankar More, great Indian wicket-keeper in 49 Tests 1986-93, was born in Baroda.",
        "1967": "6.5 earthquake at Koyna Dam in Maharashtra kills 200 people.",
        "1979": "India need 438 to win v England, game ends at 8-429.",
        "1980": "Second Commonwealth Regional Heads of Government Conference in New Delhi.",
        "1983": "INSAT-1B runs into snag, its solar array fails to deploy fully.",
        "1984": "Air Chief Marshal L. M. Katre, PVSM, AVSM and Bar, became the Air Officer Commanding, India Command. He was in this office till 01/07/1985.",
        "1987": "Roop Kanwar, an 18-year-old girl, commits Sati (burning herself in her husband's funeral pyre) in Deorala in Rajasthan.",
        "1990": "Congress (I) opposes the Prasar Bharati Bill in the Rajya Sabha saying the party wants the bill to be sent to a select committee.",
        "1993": "New Bank of India merged with Punjab National Bank.",
        "1996": "Narasimha Rao questioned by CBI.",
        "1997": "Dharmavir Bharti, great journalist and editor of Dharamyug, died at 6 am.",
        "1998": "Mumbai Metropolitan court acquits Union Minister for Environment and Forests Suresh Prabhu in a case of cheque bouncing.",
        "1999": "Umesh Chandra, Assistant Inspector General of Police, shot dead by the PWG in Hyderabad."
    }
}