{
    "title": "Events for January 5",
    "events": {
        "5\tJanuary\t1316": "Mughal Emperor Shah Jahan was born.",
        "5\tJanuary\t1592": "ShahJahan, Mughal emperor of India,  was born at Lahore.",
        "5\tJanuary\t1659": "Aurangzeb defeated Shah Shuja in the battle of Khawan near Allahabad.",
        "5\tJanuary\t1671": "Chhatrapati Shivaji Maharaj captured the 'Salher' fort from Mughals.",
        "5\tJanuary\t1869": "Venkatesh Tirko Kulkarni, famous Kannad novelist 'Galagnath', was born.",
        "5\tJanuary\t1890": "Ganendra Mohan Tagore died.",
        "5\tJanuary\t1893": "Paramahansa Yogananda (1893-1952), universalist Hindu, great saint, social reformer, writer and litterateur was born at Gorakhpur. He was the renaissance founder of Self Realization Fellowship (1925) in US, author of famed 'Autobiography of a Yogi' (1946), popular book globalizing India's spiritual traditions.",
        "5\tJanuary\t1934": "Dr. Murli Manohar Manmohan Joshi was born in Delhi.",
        "5\tJanuary\t1941": "Mansur Ali Khan Pataudi, cricketer (Nawab of Pataudi jr., Indian batsman & youngest Indian Test Captain), was born in Bhopal.",
        "5\tJanuary\t1948": "Parthasarathy Harishchandra Sharma, cricketer (Indian batsman of the mid-70's), was born in Alwar, Rajasthan.",
        "5\tJanuary\t1952": "John Hope Victor Alexander, Viceroy of India (1936-43), died at the age of 64.",
        "5\tJanuary\t1953": "Andhra University celebrated its silver jubilee.",
        "5\tJanuary\t1955": "Kumari Mamata Promileswar Banerjee was born in Calcutta (West Bengal).",
        "5\tJanuary\t1957": "Adintrim Sales Tax Act was introduced and the Central Sales Tax Act of 1956 came into force.",
        "5\tJanuary\t1968": "Government of India accepts the administrative reforms commission's recommendation to appoint a Lok Pal.",
        "5\tJanuary\t1974": "Virendranath Dasgupta, great revolutionary, died.",
        "5\tJanuary\t1982": "C. Ramchandra (Chitalkar), famous music director, died.",
        "5\tJanuary\t1985": "Rajiv Gandhi promises to solve the Punjab problem without yielding to 'separatist ideologies.",
        "5\tJanuary\t1988": "India's first indigenously built 'Braille' script released short hand machine for the blind.",
        "5\tJanuary\t1990": "Mohammad Azharuddin was made captain of Indian cricket team.",
        "5\tJanuary\t1992": "Ravi Shastri scores 206 at SCG before being Warne's 1st cricket Test wkt.",
        "5\tJanuary\t1994": "Tamil Nadu Assembly passes two bills making the Chief Minister, the Chancellor of all universities instead of the Governor.",
        "5\tJanuary\t1995": "PM gives valedictory address at the 8th World Tamil Conference in Madurai.",
        "5\tJanuary\t1998": "Laloo Yadav, RJD president, and BSP chief Kanshi Ram launch a seven-party \"Jan Morcha\".",
        "5\tJanuary\t2000": "Tamil Nadu regains Subbiah Pillai Trophy one day cricket tournament."
    }
}