{
    "title": "Events for November 5",
    "events": {
        "1509": "Don Francis-Di-Almeda of Portugal was succeeded as the Viceroy of Protuguese India by Affonso de Albuquerque, who is regarded as the real founder at Portuguese power in India.",
        "1556": "Mughals, under the leadership of Akbar, defeated Hindu ruler Hemu in the second battle of Panipat.",
        "1605": "Accession of Jahangir.",
        "1870": "Chittaranjan Das, freedom fighter, famous lawyer and orator, was born at Calcutta.",
        "1892": "John Burdon Sanderson Haldane, biologist, was born at Oxford.",
        "1906": "Initials of the place of issuance of notes were started to be printed instead of Issuing Circle's name.",
        "1907": "Special commissioner appointed to deal with famine conditions.",
        "1915": "Balasaheb Devras, sar sanghchalak of RSS, was born.",
        "1920": "Indian Red Cross society was founded in India under Bengal Act VIII. St.John Ambulance Association is a wing of this societywhich directed Improvement of Health, Prevention of Diseases and Mitigation of Suffering activities.",
        "1927": "Lord Irwin, Viceroy of India, met Gandhiji, S.Shriniwas Iyengar and M.A. Ansari Congress leaders at New Delhi.",
        "1928": "R. V. S. Perishastri, former Chief Election Commissioner of India, was born.",
        "1929": "Narottam Morarjee, great social reformer and the architect of the modern Indian Shipping, died.",
        "1930": "Arjun Singh, leader of Madhya Pradesh, was born.",
        "1931": "M. G. Subramaniam, cricket test umpire for 2 tests from 1983-84, was born in Karnataka.",
        "1945": "Case was filed against the Azad Hind Army Soldiers at Red Fort in Delhi.",
        "1950": "Faiyaj Khan, famous singer of Indian classical music, died.",
        "1951": "Western Railways and Central Railways were formed in Bombay; seperate Time Tables were setup.",
        "1956": "University Grants Commission Act sets up UGC.",
        "1961": "Pandit Jawaharlal Nehru arrived in New York. This was the first ocassion when an Indian Prime Minister went to United States.",
        "1976": "Lok Sabha votes to extend its own life by another year.",
        "1977": "Indira Gandhi arrested and released unconditionally. The External Affairs Minister, Atal Bihari Vajpayee addresses the United Nations General Assembly in Hindi.",
        "1990": "Janata Dal splits. The breakaway group claims support of 58 M.P.'s to elect Mr. Chandrashekhar as leader. V.P. Singh's government loses confidence motion in the Lok Sabha.",
        "1994": "Russi Modi appointed Chairman of Air India and Indian Airlines.",
        "1995": "Narsimha Rao, PM, reaches Argentina for G-15 summit at Buenos Aires.",
        "1996": "United Front suffers a setback with one of its constituents, the Madhya Pradesh Vikas party, deciding to walk out and merge with Congress (I).",
        "1997": "Railway ministry doubles compensation amounts from Rs. 2 lakh to Rs.4 lakh to victims of railway accidents and other untoward incidents.",
        "1998": "Baba Nagarjun \"Vaidyanath Mishra\" died. He wrote in Hindi, Maithali and Sanskrit. Some of his noted works are \"Patra-Heen- Nagna Gachh\", \"Dukhmochan\", \"Yugdhara\" and \"Sahath\" \"Pret Ka Bayan\".",
        "1999": "The CBI arrests the Bihar Road Construction Minister Illiyas Hussain and conducts raids in the Bitumen scam case.",
        "2000": "The Interpol issues a \"look-out'' notice for the five persons and two of their accomplices, who hijacked an Indian Airlines plane in December 1999."
    }
}