{
    "title": "Events for December 5",
    "events": {
        "5\tDecember\t1657": "Murad proclaimed himself Emperor of India.",
        "5\tDecember\t1872": "Bhai Vir Singh, great poet, social worker, writer, educationist, musician, humanitarian and Padma Bhushan awardee, was born at Amritsar.",
        "5\tDecember\t1898": "Josh Malihabadi, famous Urdu poet, was born.",
        "5\tDecember\t1905": "Sheikh Muhammad Abdullah, former Chief Minister of Jammu and Kashmir, was born in Soura, Srinagar, Kashmir.",
        "5\tDecember\t1931": "Jayant G. Nadkarni, former Admiral of Indian Navy, was born.",
        "5\tDecember\t1933": "Balendu Shantilal Jain, famous hindi writer, was born at Kunchord, M.P.",
        "5\tDecember\t1935": "Bipinchandra Joshi, chief of Indian Army general, was born.",
        "5\tDecember\t1943": "The Japanese planes attack Calcutta port.",
        "5\tDecember\t1946": "Dada Maharaj Satarkar passed away.",
        "5\tDecember\t1950": "Sri Aurobindo Ghosh, great revolutionary, freedom fighter and teacher, passed away.",
        "5\tDecember\t1951": "Abanindranath Tagore, a great Modern Indian Painter and sculptor, passed away in Calcutta.",
        "5\tDecember\t1959": "K. S. Duleepsinhji, cricketer (12 Tests for England, 995 runs), passed away.",
        "5\tDecember\t1990": "With the induction of 60 ministers, the Bihar Cabinet becomes the largest ever cabinet in India with a total of 71 ministers.",
        "5\tDecember\t1991": "The government reduces visa fees for tourists intending to visit India.",
        "5\tDecember\t1992": "V. P. Singh and hundreds arrested in Barabanki on the way to Ayodhya.",
        "5\tDecember\t1993": "Congress forms its seventh ministry in Madhya Pradesh. Digvijay Singh elected CM.",
        "5\tDecember\t1994": "V.P.Singh, former PM, resigns from the Parliament.",
        "5\tDecember\t1998": "Jaswant Singh and Pramod Mahajan take over as the new Foreign Minister and Minister for Information and Broadcasting. Jagmohan takes over as Minister for Communications.",
        "5\tDecember\t1999": "The Union Home Ministry ask Intelligence Bureau (IB) to conduct an inquiry against IB officials in ISRO spy case.",
        "5\tDecember\t2000": "Postal staff go on a nationwide indefinite strike which the Government termed as 'illegal'."
    }
}