{
    "title": "Events for February 5",
    "events": {
        "1630": "Har Rai, Sikh Guru, was born.",
        "1919": "Sitaram Kesri, veteran Congress leader, was born.",
        "1922": "Amar Nath Sehgal, sculptor, was born at Campbellpur (W. Pakistan). His important works are \"Voice of Africa (Ghana-1958)\", A Cricketer (1961) and Mahatma Gandhi, Amritsar, To space Unknown (bronze, Moscow-1963)\", etc.",
        "1924": "Gandhiji was released after operated on for appendicitis in Sassoon Hospital, Poona.",
        "1931": "Krishna Film Co., Bombay produced a 7,659 feet long 'Krishnatone Talkie Programme No. 1, which was released quite before the release of 'Alam Ara,' first talkie film of India.  The Krishnatone Programme was censored at C.C. No. 9906 on February 5 and the programme contained the following: (1) Arabic Song (2) Indian Orchestra No.1 (3) Indian Orchestra No.2 (4) Indian Orchestra No.3 (5) Jal Tarang Solo (6) Hindi Song No. 1 (7) Hindi Song No.2 (8) Hindi Song No. 3 (9) Bengali Song (10) Garba No. 1 (11) Garba No. 2 (12) Gujarati Comic Song (13) Hindi Chorus Song No. 1 (14) Hindi Chorus Song No. 2 (15) Dilruba Solo (16) Violin Solo (17) Goanese Song.",
        "1936": "Baba Maharaj Satarkar (Nilkanth Gyaneshwar Gore - Satarkar) was born.",
        "1949": "Judgement on Gandhi's murder; Godse and Apte to be executed.",
        "1968": "Narottam Nagar, veteran hindi writer, passed away.",
        "1970": "Kauai Aadheenam, Hindu monastery, site of Kadavul Hindu Temple, Saiva Siddhanta Church headquarters, San Marga Sanctuary and editorial offices of Hinduism Today were  founded today at Hawaii's Garden Island.",
        "1981": "Kuda Bux, great Indian mystic (I'd Like to See), passed away at 75.",
        "1986": "Laxmanrao Sardesai, famous Marathi and Konkani litterateur, passed away.",
        "1991": "The last of 1.2 lakh Indians in Kuwait manage to return to India.",
        "1992": "Last day of Test Cricket cricket for Dilip Vengsarkar.",
        "1993": "The Supreme Court directs the Union Government to forcibly produce Manipur Speaker Dr. Borobabu Singh before it on March 23 in a  contempt case.",
        "2000": "A.B. Vajpayee, Prime Minister,  defends the Gujarat Government's order lifting the ban on Government employees from participating in RSS activities."
    }
}