{
    "title": "Events for March 5",
    "events": {
        "1699": "Maharaja Jaisingh-II crowned as King of Jaipur kingdom and sat on Amber throne.",
        "1851": "Geological Survey of India was established in Calcutta.",
        "1868": "Harishchandra Sakharam Bhatwadekar alias Save Dada, who filmed the felicitation function of Wrangler R. P. Paranjapye, was born. This film was titled as \"The Fresh Indian Regular of Cambridge University.\" He was the First Short Documentary Film Maker of India.",
        "1905": "Shushila Didi, great freedom fighter, was born at Datton Chuhad village, Punjab. She is remembered for her association in the revolutionary activities of Bhagat Singh.",
        "1916": "Biju Patnaik, famous Oriya leader and Chief Minister, was born.",
        "1918": "Shriranga Vasudev Sohoni also known as \"Ranga Sohoni\", Indian cricketer (pace bowler of late 40's avg 101), was born in Nimbora, Maharashtra.",
        "1919": "M.L. Kapoor, great industrialist, was born at Lahore.",
        "1922": "Ebrahim Suleman Maka, Indian cricket wicket-keeper (2 Tests vs West Indies1952), was born at Daman.",
        "1931": "Mahatma Gandhi & British viceroy Lord Irwin sign a pact referred in Indian History as \"Gandhi-Irwin Pact\", after which the civic disobedience movement was taken back.",
        "1948": "C. Rajagopalachari appointed the first Indian Governor General to succeed Lord Mountbatten on 21 June.",
        "1961": "Sachin Sengupta, famous writer, dramatist and journalist, passed away.",
        "1989": "Baba Prithvisingh, founder of Labour Party, passed away.",
        "1990": "Government announces an interim relief of Rs. 360 crore to 5 lakh victims of the 1984 Bhopal gas tragedy.",
        "1991": "Congress threatens to withdraw support to the minority government of Chandrasekhar on the issue of police surveillance in Rajiv Gandhi's residence.",
        "1992": "Sunder, comedy actor, passed away.",
        "1993": "The government de-reserves the mining industry throwing it open to private sector as well as to foreign investment.",
        "1995": "Jalal Aga, famous comedian and character artist, passed away.",
        "1997": "Pravin Thipsay wins the United Insurance GM chess tournament in Dhaka.",
        "1999": "The indigenously-built multi-barrel rocket launcher ''Pinaka'' is successfully test-fired at Chandipur-on-sea in Orissa."
    }
}