{
    "title": "Events for April 5",
    "events": {
        "1581": "Mahmud Gawan was appointed as Prime Minister, an office which he held till his execution.",
        "1614": "Indian princess Pocahontas marries English colonist John Rolfe.",
        "1663": "Chhatrapati Shivaji Maharaj attacked  Shahistekhan at Pune.",
        "1848": "Satara kingdom came to end.",
        "1908": "Babu Jagjivan Ram, valiant freedom fighter, was born in Chandwa village in Bhojpur, Bihar. He held many prominent ministerial portfolios such as Communications Minister (1952-56), Railway Minister (1956-62), Food and Agriculture Minister (1967-70) and Defence Minister (1970-74). After 1977, he became the Deputy Prime Minister (Defence) in Janta regime. Thereafter, he established Congress (J). His uninterrupted representation in the Parliament from 1936 to 1986 is a world record. This day is commemorated as \"Samta Diwas\".",
        "1919": "India's first modern shipping company Scindia Steam Navigation's first ship 'Liberty' started its journey. The weight of the ship was 5,940 tonnes.",
        "1922": "Pandita Ramabai, social worker and philosophist, passed away.",
        "1930": "Mahatma Gandhi reached Dandi, a small costal village in Gujarat, after travelling 385 kms with 78 followers to break the recently imposed \"Salt Law\". This event is known as 'Dandi March' and was started from Sabarmati Ashram near Ahmedabad.",
        "1938": "Anil Rakeshi, great poet, Hindi writer and critic, was born at Nahan (H.P.).",
        "1940": "Charles Freer Andrews, a Christian Missionary, died in Calcutta. He is also referred as \"Deenabandhu Andrews\".",
        "1944": "221 Advance Base Depots laid down their lives to repulse several waves of Japanese attacks and succeeded in safe evacuation of Ordnance stores to an alternate site.",
        "1949": "Indian Boy Scout and Girl Guide were established and renamed as Bharat Scouts and Guides.",
        "1950": "Spurred by recent clashes in East and West Bengal between Muslims and Hindus, Indian Prime Minister Jawaharlal Nehru and his Pakistani couterpart Ali Khan today reached agreement on a \"Bill of Rights for Minorities\". This bill included a provision for \"drumhead justice,\" or summary justice to persons convicted of violating minority rights.",
        "1957": "The first Communist ministry in a state was installed in Kerala.",
        "1961": "Indian Drugs and Pharmaceuticals Limited was established in New Delhi by Indian Government for allopathic drugs.",
        "1979": "First Naval Museum of India established in Bombay.",
        "1984": "Rakesh Sharma,Squadron leader, becomes India's first spaceman  when he is launched aboard Soyuz T-11 of Soviet Union.",
        "1987": "The centenary of Bombay Fire Brigade was celebrated. (CIVIC).",
        "1989": "Pannalal Patel, great Gujrati litterateur, died.",
        "1990": "Lok Sabha passes the Punjab Bill.",
        "1991": "Kerala Assembly dissolved paving way for elections.",
        "1993": "The Left and Democratic Front earns two third majority at the Tripura Assembly elections."
    }
}