{
    "title": "Events for May 5",
    "events": {
        "1479": "Sikh Guru Amardasji, great social worker and teacher, was born at Basare village near Amritsar district.",
        "1818": "Karl Marx, great journalist, chief editor, writer and social worker, was born at Trier, Germany.",
        "1903": "Tirupur Subramaniam Avinashilingam Chettiar, freedom fighter, educationist and politician, was born at Tirupur (Tamil Nadu).",
        "1906": "Ursula Jeans, actress (I Lived With You, Over the Moon), was born in Shimla, Himachal Pradesh.",
        "1916": "Giani Zail Singh, President of India, was born in Sandhwan village, Punjab.",
        "1929": "Curfew was imposed in a bid to quell Hindu-Muslim riots that had claimed 21 lives in Bombay.",
        "1930": "Gandhiji was arrested and imprisoned without trial. As a result there was ''hartal'' (strike)all over India. Over 100,000 people were jailed before the end of the year.",
        "1932": "Prabhatkumar Mukhopadhyay, famous Bengali short story writer and novelist, passed away.",
        "1942": "Henry Albert John Gidney, great leader and politician, died at New Delhi.",
        "1944": "Gandhi-Jinnah talks break down on Pakistan issue.",
        "1946": "Simla Conference in session from May 5 to May 12; Gandhiji's deliberations prove anfractuous.",
        "1947": "Gandhiji denies in an interview that communal division of India is inevitable.",
        "1955": "Indian parliament accept Hindu divorce.",
        "1966": "Jan Congress Party was established in Orissa.",
        "1971": "India appeals for urgent aid for 1.8 mil. for Bangladeshi refugees in New Delhi.",
        "1972": "Loknathan P. S., great economist, passed away.",
        "1977": "Chandra Shekar chosen President of the Janatha Party.",
        "1983": "Keshavrao Kothavle 'Lalit', editor of monthly magzine, passed away.",
        "1986": "Controversial Muslim Women Bill passed by Lok Sabha.",
        "1989": "Naval Tata, famous industrialist, passed away.",
        "1992": "Prithvi, India's medium range surface-to-surface missile, successfully launched.",
        "1993": "Balak Brahmachari, [Marxist Godman], famous Indian guru, passed away at 73 yrs.",
        "1994": "Revolt against Nar Bahadur Bhandari government in Sikkim, Sanchaman Limboo elected new leader.",
        "1998": "Yashwant Sinha and Madan Lal Khurana, Union Ministers, are discharged in the hawala case.",
        "2000": "Supreme Court permits former Tamil Nadu Chief Minister Jayalalitha (petitioner) to have herself and the others examined as ''defence witnesses'' in connection with the trial of the 'Colour TV scam case'."
    }
}