{
    "title": "Events for June 5",
    "events": {
        "1659": "Dara Shukoh celebrated his coronation at Deorai after the final defeat.",
        "1879": "Narayan Malhar Joshi,  father of Labour Union Movement in India, was born at Goregaon in the Kolaba district, Maharashtra.",
        "1882": "Cyclonic Storm & floods in Arabian Sea hit Bombay. About 100,000 people drowned.",
        "1896": "Muhammad Ismail Sahib, president of the Madras State Muslim League and freedom fighter, was born at Pettai, Tamil Nadu. He was the member of Rajya Sabha as well as Lok Sabha.",
        "1923": "Santosh Kumar Kisku Rev, great educationist and social worker, was born.",
        "1927": "Sarjit Singh Bal, educationist, was born in Renala Khurd, Punjab.",
        "1929": "S.V. Subramanian, great Hindi writer, was born at Virakeralanpudur, Tamil Nadu.",
        "1961": "Ramesh Krishnan, Indian tennis star, was born. He was also the  winner of Junior Wimbledon 1979.",
        "1966": "Indian rupee devalued by 36.5 percent.",
        "1973": "Madhav Sadashiv Golvalkar, politician and RSS chief, passed away.",
        "1974": "Smallpox epidemic in the country.",
        "1975": "Ramsing, great freedom fighter and editor of `Navyug Patrika', passed away.",
        "1980": "Manipur University was established.",
        "1981": "Gopal Saini at Tokyo sets record for 3000m ST. in 8,30.88.",
        "1984": "Operation 'Blue Star' was launched by Indira Gandhi. Indian commandos stormed into Sikh's holiest gurudwara Golden Temple in Amritsar to flush out the terrorists and other anti-government elements. Jarnail Singh Bhindranwale and over 325 people were killed in the temple. Thus a great rebel arose  all over the nation and specially in Punjab.",
        "1989": "Missile `Trishul' tested successfully.",
        "1992": "Hindi weelky of Indian Express Group 'Screen' published.",
        "1993": "Unlawful Activities (prevention) Tribunal headed by Justice P N Nagi upholds the ban on Islamic Sevak Sangh.",
        "1994": "Shakti Singh at Bangalore sets record for DT in 61.72.",
        "1995": "Manmohan Singh re-elected to Rajya Sabha from Assam.",
        "1996": "Kubernath Rai, well known writer, passed away.",
        "1997": "I. K. Gujral's visit to Nepal was marked by signing of Power Trade Agreement and MoU on civil aviation.",
        "1998": "Ali Sardar Jafri, Urdu writer, is presented the Jnanpeeth award for 1997.",
        "1999": "The Army releases documents seized from three Pakistani soldiers in the Batalik sector to substantiate its claim that Pakistan regulars are involved in the Kargil conflict."
    }
}