{
    "title": "Events for July 5",
    "events": {
        "1658": "Aurangzeb arrested Murad.",
        "1857": "Baigum Hazrat Mahal again attack on Lucknow.",
        "1882": "Hazrat Inayat Khan (1882-1927), classical singer and Muslim mystic, was born. He was instrumental in bringing Sufism to the music.",
        "1901": "B. N. Sircar, producer and founder of International Film Craft and New Theaters Ltd., Calcutta was born at Bhagalpur. His films are Boker Bojha, Chorekanta, Chasar Meye (1931).",
        "1905": "Lord Curzon joined the part of Bengal to Asam and divided Bengal.",
        "1916": "Archik Venkatesh Gopalkrishna, great poet, journalist and orator, was born at Dharwar, Mysore.",
        "1917": "'Hindumashinary Society' was established by Gajanan Bhaskar Vaidya.",
        "1946": "Ram Vilas Jamun Paswan was born in Shaharbanni, Distt. Khagaria (Bihar).",
        "1947": "Indian Act, 1947 was presented in British Parliament, which was then accepted by the emperor on 18th July.",
        "1957": "Dr. Anugrah Narain Singh, great leader, freedom fighter, educationist and Minister of India, died..",
        "1968": "Naval Submarine wing in Indian Naval Force came into existence with the arrival of the first submarine from the Soviet Union.",
        "1970": "Indian ship capsized in Krishna River in eastern India claiming 150 lives.",
        "1981": "Rajan Mahadevan recites 31,811 digits of ¦(pie) from memory.",
        "1984": "Indian Airlines airbus hijacked, lands in Lahore.",
        "1990": "G. C. Saxena, J&K Governor, promulgates J&K Disturbed Areas Act, 1990, declaring several districts as disturbed area.",
        "1992": "Centre scraps octroi in Union Territories.",
        "1993": "Supreme Court dismisses the stay petition of Union Government regarding lifting of ban on the RSS and the Bajrang Dal by the Babri Tribunal.",
        "1994": "Vaikom Mohammed Basheer, 86, Malayalam literary genius, died in Beypore in Kerala.",
        "1995": "Tarapur nuclear station controls the leakage and soil contamination within the natural background radiation levels.",
        "1996": "Janata Dal expels dissident Maneka Gandhi from primary membership of the party.",
        "1997": "Janata Dal splits. Laloo Prasad Yadav forms Rashtriya Janata Dal and Sharad Yadav was elected as the Janta Dal president.",
        "1998": "An Amusement and Picnic Resorts Pvt. Ltd. with five dolphins and sea lions was inaugurated at Mahabalipuram.",
        "1999": "Two buses, which were inaugurated from Dhaka, arrive in Calcutta.",
        "2000": "The Prime Minister rules out restoring pre-1953 status to Jammu and Kashmir."
    }
}