{
    "title": "Events for August 5",
    "events": {
        "1604": "John Eliot, \"Apostle to Indians,\" Bible translator, baptized.",
        "1905": "Subhadrakumari Chauvhan, famous Hindi poet, was born.",
        "1907": "Kashi Nath Pandey, politician and Trade Unionist, was born in Fursatpur Village.",
        "1909": "Dwijhans Kalika Prasad Dixit, great poet and educationist, was born at Gram Dedani in Uttar Pradesh.",
        "1921": "Malhi Govind, modern Sindhi novelist, was born.",
        "1939": "In the first case to be brought under Prohibition laws, a railroad passenger was today convicted of possessing a bottle of brandy in Bombay.",
        "1950": "Gopinath Bardoloi, architect of modern Assam, freedom fighter and leader, passed away.",
        "1965": "M. V. Sridhar, cricketer (scored 366 for Hyderabad vs Andhra Pradesh, 1994), was born.",
        "1969": "Bapu Krishnarao Venkatesh Prasad, cricketer (consistent Indian Test pace bowler 1996-), was born in Bangalore.",
        "1975": "The RSS, Anand Marg, Jamat-i-Islami, and 23 other organisations were banned. Parliament approved Conservation of Foreign Exchange and Prevention of Smuggling Activities Act (COFEPOSA). Maintenance of Internal Security Act (MISA) approved by the Parliament.",
        "1978": "Five died and 70 were injured as upper-caste Hindus clashed with untouchables in Maharashtra.",
        "1981": "Jagjivan Ram heads breakaway Congress(U) and calls new party Congress (J).",
        "1986": "Vellupillai Prabakaran, Tamil rebel leader, died. The vision of secession for Sri Lanka's Tamil minority may have come to an end. But so, too, might the violence that the nation had endured. Today, Tamil rebel leader Vellupillai Prabakaran accepted the peace accord signed last week by India and Sri Lanka. Prabakaran surrendered to Indian forces and his men turned over their weapons. The pact is seen as a compromise by the co-signers. But to the dejected Tamil leader, who has fought since childhood for a Tamil victory, it was a stinging defeat. The treaty creates an autonomous multi-religious zone in the eastern and northern provinces. The rebels dreamed and passed away for a separate state of their own.",
        "1991": "Leila Seth was sworn the Chief Justice of Himachal Pradesh High Court. She is a judge of Delhi High Court.",
        "1992": "Achyutrao Patwardhan, leader of 'Quit India Movement', died at Varanasi at the age of 86.",
        "1994": "Yakub Abdul Razak Memon, a key accused in 1993's Bombay blast case, was arrested.",
        "1999": "The Global Peace March demands demilitarisation of the entire planet.",
        "2000": "Lala Amarnath (88), former Indian cricketer, died in New Delhi."
    }
}