{
    "title": "Events for September 5",
    "events": {
        "1457": "Property Tax was passed.",
        "1612": "East India Company's Navy eastablished.",
        "1659": "Queen Saibai, wife of Chhatrapati Shivaji Maharaj, died.",
        "1793": "Mir Kasim lost To Britishers near Rajmahal in battle of Udaynala.",
        "1846": "Sir Charles Metkaf, Governor General of East India Company, died.",
        "1872": "V. O. Chidambaram Pillai, great freeom fighter, social reformer, prolific writer, politician and leader, was born at Ottapidaram village in Tamil Nadu.",
        "1888": "Dr. Sarvepalli Radhakrishnan (1888-1975), panentheist, great renaissance philosopher, eminent writer, free India's first vice-president and second president, was born at Tiruttani near Madras.",
        "1904": "Bhalchandra Pandharinath Bahirat, editor and expert of Saint literature, was born.",
        "1909": "Phiroze Edulji Palia, left-hand batsman and slow spin bowler, was born in Mumbai. He played in India's first Test at Lord's in 1932.",
        "1918": "Ratanji Jamshetji Tata, famous Indian industrialist and social reformer, died.",
        "1957": "Wealth Tax Bill passed in Rajya Sabha.",
        "1962": "Dr. Radhakrishnan's birthday declared as Teachers Day.",
        "1967": "Central Hindi Committee constituted under the chairmanship of the Prime Minister.",
        "1979": "Earl of Mountbatten's funeral held in Burma.",
        "1987": "Shanbagh, Vandana Rao, Shiny and Usha sets record in the women's category for 4x400m race in 3.31.55 seconds at Rome .",
        "1988": "The country goes without newspapers on this day as the entire newspaper industry had protested against the Defamation Bill.",
        "1990": "Rajya Sabha approves the Prasar Bharati Bill rejecting by voice vote three motions moved by the Congress(I) to refer the Bill to a joint select committee.",
        "1995": "30 member Ladakh Autonomous Hill Council sworn-in that was conceded by the Government of India in 1993.",
        "1997": "Mother Teresa, founder of Missionaries of Charity who was awarded with Nobel Prize (1979) and Bharat Ratna, died at the age of 87 due to heart attack late in the evening around 9:30 pm in Calcutta.",
        "1998": "University and college teachers affiliated to the All-India Federation of University and College Teachers Organisations call off their nation-wide strike."
    }
}