{
    "title": "Events for January 6",
    "events": {
        "6\tJanuary\t1664": "Chhatrapati Shivaji attacked on Surat.",
        "6\tJanuary\t1818": "Dominion of Holkar in India are annexed with Rajput states and come under the British protection.",
        "6\tJanuary\t1832": "Publication of 'Darpan' magazine started.",
        "6\tJanuary\t1842": "4,500 British & Indian troops leave Kabul..",
        "6\tJanuary\t1847": "Saint Tyagaraja, great musician, died.",
        "6\tJanuary\t1932": "Meenatai Thackrey, social worker, was born.",
        "6\tJanuary\t1942": "Four of the flight's six aircraft were promptly lost to Japanese bombing and No. 4 Flight gave place in Moulmein to No. 3 Flight which had meanwhile re-equipped with four ex-RAF Blenheim ls. B-314 completed first commercial flight around the world.",
        "6\tJanuary\t1947": "All India Congress Commitee accepted the division of country.",
        "6\tJanuary\t1948": "Security Council takes up India's complaint charging Pakistan with aggression in Kashmir.",
        "6\tJanuary\t1953": "Stalin Peace Prize awarded to Dr. S. Kitchlew.",
        "6\tJanuary\t1959": "Kapildev Ramlal Nikhanj, cricketer (India's finest all-rounder 1978-94, Cup-1982), was born in Chandigarh.",
        "6\tJanuary\t1972": "America declared Naval Drill in the Indian Ocean.",
        "6\tJanuary\t1976": "Baliram Bhagat elected Lok Sabha Speaker.",
        "6\tJanuary\t1979": "Rohini-200, first monsoon experimental rocket, launched from Thumba.",
        "6\tJanuary\t1980": "In the general election (7th) of India, Indira Gandhi led Indian National Congress Party gains two-thirds majority in the Lok Sabha legislative elections.",
        "6\tJanuary\t1981": "Indian Ocean bed on their research ship Gavesani of the National Institute succeeded from the depth of 4,300 metres.",
        "6\tJanuary\t1983": "Indian National Congress lost for the first time in Andhra Pradesh and Karnataka State Assembly Elections.",
        "6\tJanuary\t1987": "Jaidev, famous music director, passed away.",
        "6\tJanuary\t1989": "Lord Sudhindra Prasanna Sinha died.",
        "6\tJanuary\t1992": "Sachin Tendulkar completes 148* vs Australia at the SCG.",
        "6\tJanuary\t1993": "India and Bhutan sign agreement on the giant Sankosh hydro-electric project.",
        "6\tJanuary\t1996": "CBI identifies two key figures - Satyanarayana Gauda and Daya Manikam Anand - in Purulia arms drop case.",
        "6\tJanuary\t1997": "Sumita Ghosh (CISF) sets a National junior women's record in the standard rifle 3 position in National shooting.",
        "6\tJanuary\t1999": "Shiv Sena activists dug up the Kotla pitch in Delhi with a view to prevent the Indo-Pakistan first Test which was to commence from Jan. 28."
    }
}