{
    "title": "Events for October 6",
    "events": {
        "1779": "Elphinston, historian and administrator of Mumbai province, was born.",
        "1808": "Ardaseer Cursetjee Wadia, professor, pioneer, innovator, chief engineer and Inspector of Machinery at the Steam Factory at Bombay and one of the dignitaries, was born.",
        "1858": "Nanasaheb Peshwa, a revolutionary of first mutiny, died.",
        "1862": "Indian Penal Code was notified. However, it was implemented from 1st January 1862.",
        "1893": "Meghnad N. Saha, astrophysicist, was born. In 1920, he developed the 'Thermal Ionization Equation', which has remained fundamental in all works on stellar atmospheres. This equation has been widely applied to the interpretation of stellar spectra, which are characteristic of the chemical composition of the light source.",
        "1913": "V. R. Kant, famous poet, was born.",
        "1927": "First Indian Cinematograph Enquiry Committee, under the chairmanship of Diwan Bahadur T. Rangachariar, was appointed by the Government.",
        "1935": "Jeevan D. Ghosh, cricket Test umpire from 1978-91, was born in Bengal. He has the distinction of having the longest umpiring career of 32 years in India.",
        "1949": "Jawaharlal Nehru laid the foundation stone of National Defence Academy in Kharakvasla near Pune.",
        "1954": "Nehru declared the National Health Scheme for the entire country.",
        "1963": "Baba Kharak Singh, freedom fighter and grand old man of Punjab, died.",
        "1969": "Bruna Coutinho, Indian Soccer(Football) player, was born in Calangute, Goa. He was recognised as Indian Player of the Year in 1996.",
        "1974": "Vengalil Krishnan Krishna Menon, great freedom fighter, barrister, leader, politician, nationalist and member of the Lok Sabha, passed away. He resigned as the defence minister soon after the Chinese aggression.",
        "1983": "Punjab Government was dismissed to halt religious and political violence by Indira Gandhi, who imposed President's rule in the state.",
        "1985": "P.T. Usha sets record for 400m (Women) in 51.61 seconds at Canberra .",
        "1990": "Justice Ranganath Mishra sworn in as Chief Justice of Supreme Court.",
        "1992": "Z. R. Ansari, former central minister, died.",
        "1997": "Abhijit Kunte wins Asian Junior Chess title.",
        "1998": "Railways wins the BOB-Senior National Hockey championship for women defeating Haryana in the final at Chennai.",
        "1999": "Sonia Gandhi, Congress(I) president, won the Bellary Lok Sabha seat defeating her BJP rival Sushma Swaraj by a margin of 56,100 votes.",
        "2000": "Mamata Banerjee, Trinamool Congress chief,  withdraws her resignation from the Union Cabinet of Ministers."
    }
}