{
    "title": "Events for November 6",
    "events": {
        "6\tNovember\t1904": "Hariharnath Shastri, worker's leader, was born.",
        "6\tNovember\t1905": "Ram Bachan 'Aravind' Dwivedi, great Hindi, Bhojpuri poet and writer, was born at Dubouli, Bihar.",
        "6\tNovember\t1910": "Satakopan Chandilyan Bhashyam, journalist, was born at  Tirukkoilur, Madras.",
        "6\tNovember\t1913": "Mohandas K. Gandhi, leader of Indian Passive Resistance Movement, was arrested for leading Indian miners march in South Africa by British troops.",
        "6\tNovember\t1930": "First Round Table Conference held at London.",
        "6\tNovember\t1931": "Chithira Tirunal Bala Ramavarma, ascended throne and ruled state of Travancore as Maharaja, passed away.",
        "6\tNovember\t1937": "Yashwant BipinBihari Sinha was born in Patna (Bihar).",
        "6\tNovember\t1946": "P. S. Shivswami Iyyer, great politician and administrator, passed away.",
        "6\tNovember\t1950": "King Tribhuvana of Nepal flees to India.",
        "6\tNovember\t1951": "Judge M. Patanjali Sastri became the Chief Justice of India. He helded this office till 03/01/1954.",
        "6\tNovember\t1952": "Dipal Jayant Tilak, journalist and editor, was born.",
        "6\tNovember\t1962": "National Defence Council established.",
        "6\tNovember\t1985": "Sanjeev Kumar, film actor, died.",
        "6\tNovember\t1988": "The graduated use of force finally compelled the rebels to surrender and the personnel of Godavari then took over. When psychological pressure did not succeed, warning shots were fired by both the naval ships.",
        "6\tNovember\t1993": "First-ever elections to the Delhi Assembly.",
        "6\tNovember\t1996": "India wins Titan's cup beating South Africa in Mumbai.",
        "6\tNovember\t1997": "Supreme Court acquits former Union Minister for Power and Food Kalpanath Rai  held under TADA for alleged harbouring of an accused in \"1992 Bombay J.J. Hospital shootout case\".",
        "6\tNovember\t1998": "Koneru Humpy wins the World under-12 girls' chess title in Oropesa del Mar, Spain. Azharuddin becomes the highest run-getter (displacing Desmond Haynes, 8648 runs) in LOI history in the Coca Cola cup, Sharjah.",
        "6\tNovember\t1999": "Red carpet welcome to Pope. He appreciated the religious freedom in India.",
        "6\tNovember\t2000": "Richa Mishra creates a national record in the women's 400m individual medley in 5.15.28sec in the 55th Senior National Aquatic championship in Calcutta."
    }
}