{
    "title": "Events for December 6",
    "events": {
        "6\tDecember\t1732": "Warren Hastings, the first Governor-General of East India Company in India, was born in Churchill village of Oxfordshire in UK.",
        "6\tDecember\t1756": "British troops under Robert Clive occupy Fulta India.",
        "6\tDecember\t1857": "Raja Nahar Singh arrested by the Showers to kept him first in Motia Mahal and then at Metcalfe House, Delhi.",
        "6\tDecember\t1892": "Rukmini Lakshmipathi, great social reformer and leader, was born at Madurai.",
        "6\tDecember\t1897": "Lekhraj Kishanchand Mirchandani (Aziz), famous Sindhi poet, essay writer and critic, was born.",
        "6\tDecember\t1907": "Revolutionaries looted Chingaripota station.",
        "6\tDecember\t1929": "British Viceroy meets with Indian leaders to discuss dominion status for India.",
        "6\tDecember\t1931": "Bengal Congress to boycott British goods.",
        "6\tDecember\t1946": "Homeguard Organination was established.",
        "6\tDecember\t1952": "First Indo-Soviet Trade agreement signed.",
        "6\tDecember\t1956": "Dr. Bhimrao Ramji Ambedkar (Babasaheb), great social worker, politician and writer of Indian constitution, passed away in Bombay.",
        "6\tDecember\t1962": "India closes its consulates in Communist China.",
        "6\tDecember\t1971": "US bars aid to India for aggression against Pakistan.",
        "6\tDecember\t1976": "Nana Patil, great revolutionary, passed away.",
        "6\tDecember\t1987": "MiG-29, re-christened `Baaz', inducted into the Indian Air Force.",
        "6\tDecember\t1990": "VHP-sponsored 'karseva' in Ayodhya passes off peacefully.",
        "6\tDecember\t1992": "300,000 Hindus destroy the mosque of Babri at Ayodhya, India. 4 die and BJP government in UP, led by Kalyan Singh, was dismissed and President's rule promulgated. Then countrywide riots followed. Pakistan and Bangladesh condemned demolition.",
        "6\tDecember\t1993": "Samrendra Kundu, former foreign state minister and socialist of Orrisa, passed away.",
        "6\tDecember\t1995": "Prabhakar Barve,painter of international fame, passed away.",
        "6\tDecember\t1997": "Space shuttle Columbia's astronauts return to earth following a two-week science mission on an enquiry awaiting them because of botched satellite release. Columbia and its crew of six, including India-born Kalpana Chawla, swooped through a clear chilly sky and landed on runway at Kennedy Space Centre. Astronauts save runaway $10-million satellite by catching it with their hands.",
        "6\tDecember\t1998": "13th Asian Games inaugurated at Bangkok.",
        "6\tDecember\t2000": "The Supreme Court gives a clean chit to former Prime Minister P. V. Narasimha Rao upholding the trial court's order, and discharging him and former Union Minister K.K. Tewary from the 'St.Kitts forgery case'."
    }
}