{
    "title": "Events for February 6",
    "events": {
        "1827": "Shyam Shastri, musician and a great artist of India, passed away at the age of 65 years.",
        "1887": "Manabendra Nath Roy (his childhood name was Narendranath Bhattacharya), leftist thinker, great Indian politician and philosophist, was born at Arbelia village of 24-Parganas of West Bengal. He was the founder of 'Radical Democratic Party' after quitting Congress during World War II.",
        "1915": "Poet Pradeep (Ramchandra Divedi) was born at Bandnagar, MP.",
        "1931": "Motilal Gangadhar Nehru, revolutionary, founder of 'Swaraj Party', political leader and barrister, passed away at Lucknow.",
        "1932": "Dorabji Jamshetji Tata, great industrialist, passed away.",
        "1937": "Baldev Singh, Chahal campaigner, was born.",
        "1939": "Sayaji Rao Gaekwad III of Baroda, great nationalist and social reformer, passed away.",
        "1949": "India to nationalize the estate of Nizam, the world's richest man, from Hyderabad.",
        "1950": "N. R. Pillai was appointed as the Cabinet Secretary of India. He held this office till 13-05-1953.",
        "1952": "George VI (1895-1952), King of the United Kingdom, died of lung cancer at the age of 56 (succeeded by daughter, Elizabeth II). In 1947, His title of Emperor of India was deleted.",
        "1953": "Congress, PSP, CP and Jansangh recognised as All India parties by the Election Commission.",
        "1954": "Kashmir Assembly accepts re-unification with India.",
        "1955": "55 miners die in explosion in Bihar State.",
        "1959": "Ann Chandy was appointed the first Woman judge of Kerala High Court. In 1937, she became the 'munsif'.",
        "1966": "Madurai Kamraj University established.",
        "1985": "Vikram Kumar, Soccer(Football) player, was born.",
        "1990": "Ashok Shandilya of Railways wins National billiards crown.",
        "1992": "The Centre decides to wind up the 7-year-old Food Processing Industry ministry.",
        "1994": "Ram Mahadik, Congress leader, passed away.",
        "1995": "India and France decide to set up permanent Secretariat in Paris during the Indo-French Joint Business Council in Delhi.",
        "1996": "Supreme Court upholds election of CPI (M) leader O. Bharathan to Kerala Assembly from Edakkad (91).",
        "1998": "V. V. S. Laxman scores 301* for Hyderabad against Bihar.",
        "2000": "''Water'' shooting stopped following suicide by a Shiv Sena activist; and director, Ms. Deepa Mehta asked to leave Varanasi."
    }
}