{
    "title": "Events for April 6",
    "events": {
        "1606": "Khusru Prince and his father Jahangir rebelled and fled from Agra.",
        "1664": "Harkhishan Singh, Sikh Guru, died.",
        "1773": "James Mill of Scotland, great philosopher and historian (British India), was born.",
        "1897": "Gandhiji submits long memorial to Chamberlain, Secretary of State for Colonies, regarding landing incidents background. Carries on programme of petitioning local and Imperial authorities, as well as of communicating with British and Indian public men regarding discriminatory laws.",
        "1906": "Kaveri Bhaskar Karve, teacher and author, was born at Harnai, Ratnagiri, .",
        "1919": "Mahatma Gandhi declared an All India Strike against the Rollatt Act .This was the first strike.",
        "1930": "Mahatma Gandhi picked up a lump of natural salt for breaking the 'Salt Law'. He was arrested at Dandi. This movement gathered strength and within a month about one lakh people were sent to jail. This violation of Salt Law was the second great step in India's Freedom Movement.",
        "1934": "Nilkanth Yashwant Khadilkar, editor of Marathi daily newspaper, was born.",
        "1942": "During the second world war, for the first time Japanese air-bombers attacked India, and the mainland took place at Visakhapatnam.",
        "1955": "Vinayak Maharaj Masurkar, great Samarth Saint, died.",
        "1956": "Dilip Balwant Vengsarkar, cricketer (prolific Indian batsman 1976-92),was born in Rajapur, Maharashtra. He has received Arjun Award (1981) and Padmashree (1987).",
        "1966": "Mihir Sen, first Indian swimmer to achieve many remarkable feats,  swam across the 'Palk Strait'  measuring 22 kms between India & Sri Lanka (Cylone).",
        "1968": "Indira Gandhi,PM, inaugurated the construction of Bokaro Steel Plant.",
        "1978": "Karnataka beat Uttar Pradesh by an innings and 193 runs to win Ranji Trophy.",
        "1980": "Janata Party splits again; members with RSS links form the Bhartiya Janata Party (BJP). A. B. Vajpayee becomes its first President.",
        "1985": "Bombay beat Delhi by 90 runs to win the Ranji Trophy final.",
        "1990": "Bhalchandra Tryambak Randive, senior Marxist leader and founder President of WTU, died.",
        "1992": "Nagpur edition of Marathi newspaper 'Loksatta' was started.",
        "1993": "Divya Bharati, famous Hindi film actress (Deewana), died at the age of 19.",
        "1997": "Gen. Kofi Annan,UN Secretary, arrives in New Delhi for NAM conference.",
        "1998": "The Sonia Gandhi era begins in the Congress(I) with a special AICC session ratifying the decision of the CWC appointing her president in place of  Sitaram Kesri.",
        "2000": "The Government permits use of LPG as auto fuel."
    }
}