{
    "title": "Events for May 6",
    "events": {
        "1529": "Babur Shah, Mughal Emperior, defeated Afghan Nawab Nasrat Shah, king of Bengal, on the banks of the Gand and the Ghaghra river.",
        "1589": "Mian Tansen, a prominent figure of North Indian (Hindustani) classical music and  famous singer of Akbar's court, died at Gwalior. Tansen is remembered for his epic Dhrupad compositions, creating several new ragas, as well as for writing two classic books on music Sri Ganesh Stotra and Sangita Sara.",
        "1680": "Chatrapati Rajaram Maharaj was crowned.",
        "1775": "Nanda Kumar, king of Calcutta, was arrested.",
        "1861": "Motilal Gangadhar Nehru, great Indian lawyer, political leader and social reformer, was born at Agra.",
        "1910": "Edward VII, King of Great Britain and Emperor of India, died suddenly of pneumonia at Buckingham Palace tonight. He ruled Britain for nine years. Power passed immediately to his son George, the Prince of Wales, who will rule as King George V. The 68-year-old monarch's sudden death threw his country into a state of shock. Edward had apparently caught a cold during a visit the past weekend to the wet grounds of his estate at Sandringham.",
        "1922": "Chhatrapati Rajarshi Shahu, great revolutionary, freedom fighter and social reformer of Kolhapur, passed away at Bombay. He was 48.",
        "1944": "Mahatma Gandhi was released unconditionally from his last imprisonment from Aga Khan Palace at Pune.",
        "1946": "Bhulabhai Desai, great politician, passed away.",
        "1948": "India rejected the Security Council's plan for UN supervision over plebiscite in Kashmir.",
        "1952": "Maria Montessori, pioneer in mordern education, who spent almost 10 years in India, died in Noordwijk aan Zee. The principles and techiques advocated by her are also applied to the education of handicapped children and adult education.",
        "1967": "Dr. Zakir Hussain elected President.",
        "1971": "India refutes allegations that it has meddled in Pakistan's civil war.",
        "1993": "Violence in Orissa state secretariat, CM manhandled.",
        "1997": "12 persons killed and eight seriously injured in two blasts in east Delhi.",
        "2000": "Benoy Krishna Chowdhury (89), veteran freedom fighter and prominent CPI(M) leader, died at a Government Hospital in Calcutta."
    }
}