{
    "title": "Events for June 6",
    "events": {
        "1596": "Sikh Guru Har Govindji, the sixth sikh guru, was born. He fashioned a military role for the Sikhs.",
        "1867": "Baba Kharak Singh, freedom fighter, was born at Sialkot.",
        "1890": "Gopinath Bardoloi, architect of modern Assam, freedom fighter and leader, was born.",
        "1891": "Vanktesh Iyengar Masti, famous Kannad poet, story writer, novelist, playwright and critic, was born.",
        "1903": "Hiralal Sen shot the first Indian Advertisment sequences for Jabakusum (hair tonic) and Edward's Tonic.",
        "1907": "John Morley, U.K. Government State Secretary, declares \"it will not withdraw from India under any circumstances\".",
        "1909": "Morappakam Joysam Gopalan, cricketer (1 Test India v England 1933-34), was born in Maduranthakam, Madras.",
        "1916": "Lord Kitchener, the premier soldier of the British Empire, passed away tragically last night as the ''Hampshire'', the cruiser on which he was traveling to Russia to boost sagging morale, struck a mine or was torpedoed off the Orkney Islands and sank, drowning all aboard. Life in London came to a standstill, while Paris and Washington were shocked by the news. In the last half-century, through tireless energy and devotion to imperial duty, Horatio Herbert Kitchener, 66, commanded in Palestine, Cyprus, Egypt, Sudan, South Africa, and India. Two years ago, he had become the War Secretary.",
        "1922": "Gopalan Morappakam Joysam, cricketer, was born at Maduranthakan, in Tamil Nadu. He received the Padmashree in 1964.",
        "1924": "S. R. Bommai, former President of Janata Dal, was born.",
        "1935": "Harry Crews, great US writer and actor (Indian Runner), was born.",
        "1947": "Gandhiji writes to Mountbatten, with Pakistan conceded, to persuade Jinnah to amicable settle all outstanding points with Congress.",
        "1961": "Central Institute of Fisheries Education, a deemed university, was established in Mumbai to impart post-graduate education and training, mainly to the in-service fisheries personnel of the country to provide trained manpower for the fisheries developmental activities.",
        "1962": "General Election ( 3rd) of India ends.",
        "1969": "Sunil Bandacharya Joshi, cricketer (Indian Test left-arm spinner 1996), was born in Gadag.",
        "1981": "The worst-ever railway accident took place in Bihar when a train plunged in Samastipur river.",
        "1982": "Devraj Ars, former Chief Minister of Karnataka, passed away.",
        "1986": "Militant Sikhs in Amritsar call for the murder of Surjit Singh Barnala, Chief Minister of Punjab and  J.F. Ribeiro, the Chief of Police.",
        "1990": "GOI decides to extend validity of passports to 10 years.",
        "1992": "Ordinance issued to attach the properties of persons involved in the security scam.",
        "1994": "The 20-day old Limboo Ministry in Sikkim wins vote of confidence.",
        "1996": "Benazir Bhutto,Pakistan PM, gives green signal for opening up trade with India.",
        "1997": "U.S. Congress honours Mother Teresa with a gold medal.",
        "1998": "All IAF Meteorological Sections were put on high alert from 06 Jun 98, and constant interaction with India Meteorological Department (IMD) at Mumbai and the (IMD) Centre at Ahmedabad resulted in 24 hours tracking and plotting of the cyclone, which was passed down as forecasts to Service and civil authorities in the Saurashtra and Kutch region.",
        "1999": "Paes-Bhupathi bagged their maiden Grand Slam doubles crown, defeating Goran Ivanisevic and Jeff Tarango in the final.",
        "2000": "Abhijit Kunte wins the National `A' chess championship at Mumbai."
    }
}