{
    "title": "Events for July 6",
    "events": {
        "1787": "Robert founded Indian Botanic Garden near Calcutta by Kyd on 273 acres of land.",
        "1837": "Ramkrishna Gopal Bhandarkar, a reputed oriental scholar and famous Indian Scientist, was born in Malvan in Ratnagiri district. He was a social reformer and an active member of Prathana Samaj of Bombay.",
        "1881": "Saint Gulabrao Maharaj was born in Vidarbha.",
        "1901": "Dr. Shyama Prasad Mukherjee, great social reformer, politician and leader, was born at Calcutta. He was the founder of the \"Bharatiya Jana Sangh\", of which BJP is the successor party. His father Sir Asutosh was widely known in Bengal.",
        "1917": "Bhandarkar Prachyavidya Sanshodhak Mandir' was established.",
        "1927": "Prabhjot Kaur, great poet and author, was born at Langrayal (Pakistan).",
        "1930": "Balmurlikrishna, famous singer, was born.",
        "1935": "Dalai Lama, the 14th incarnate and religious leader of Tibet, was born. He was born to Tenzin Gyotso (His Holiness the VIVth Dalai Lama) in Taksten Village, Chhija Nangso, Tibet. He was awarded with Nobel Prize for Peace in 1989.",
        "1939": "Manmohan Sood, cricketer (scored 0 & 3 in his only Test for India), was born in Lahore.",
        "1942": "Urmila Devi Shastri, freedom fighter and editor of \"Janma Bhoomi\", died due to non-medical facility and mal-nutrition in Jail. She has also written \"Karagaar Ke Anubhav\" in 1930. She was arrested for Satyagrah and forcefully closing of Foreign Goods.",
        "1944": "Mahatama Gandhi was for the first time addressed as 'Father of Nation'.",
        "1955": "Marshall Tito and Nehru's joint declaration in Belgrade.",
        "1960": "The President promulgates the ESMA, 1960.",
        "1986": "Babu Jagjivan Ram, valiant freedom fighter, passed away. He held many prominent ministerial portfolios such as Communication Minister (1952-56), Railway Minister (1956-62), Food and Agriculture Minister (1967-70), Defence Minister (1970-74). After 1977, he became the Deputy Prime Minister (Defence) in Janta regime. Thereafter, he established Congress (J). His uninterrupted representation in the Parliament from 1936 to 1986 is a world record.(5-4-91).",
        "1992": "The centre decides to allow TV and Radio time slots for private producers.",
        "1993": "JPC decides to send 'interrogatory letters' to PM's aide R. K. Khandekar, Sunil Mittal and 7 others.",
        "1995": "Five foreign tourists trekking in Kashmir 10 km uphill from Pahalgam were abducted by militants.",
        "1998": "Moshood Abiola, the detained Nigerian politician and presumed winner of the 1993 elections, died in Abuja.",
        "1999": "The Indian High Commission staff member  Yog Raj Vij, who was beaten up and abducted by Pakistani intelligence operatives, is released. India strongly condemns this assault.",
        "2000": "Mohan Lal bags Best Actor Award for his sensitive portrayal of a Kathakali artist in ''Vaanasprastham'' and the film wins the Best Feature Film and Best Editing Awards at the 47th National Film Festival-2000."
    }
}