{
    "title": "Events for August 6",
    "events": {
        "1905": "Chittaranjan Das \"Desh Bandhu\", freedom fighter and advocate, started an organisation named \"Swadeshi Mandali\".\r\nHe also founded magazine named Narayana in 1914 and a Bengali weekly in 1922 and the daily 'Forward'.",
        "1920": "Film Censor Board at Bombay started working. The first film censored and granted a Censor Certificate No. 1 was a short film of 600 ft., produced by Gaumont Company and it was titled as 'Gaumont Graphic No. 963-964'. The Regional Film Censor Boards were also set-up in Calcutta, Madras and Rangoon.",
        "1925": "Surendra Nath Banerjee died. He was one of the founders of mordern India and proponent of autonomy within the British Commonwealth. He was President of Indian National Congress twice, in 1895 at Pune and in 1902 at Ahmedabad.",
        "1932": "Ramsay McDonald came out with his 'Communal Award'  to fix seats for the various communities in the provincial legislatures.",
        "1933": "Kripal Singh Govindsingh, Amritsar, India, 100* on debut v NZ 1959, was born at Madras.",
        "1951": "Rukmini Lakshmipathi, great social reformer and leader, died.",
        "1962": "Peking agrees to talks with India to settle border disputes.",
        "1965": "Indian troops invade Pakistan.",
        "1989": "Six top Cricket stars banned for one year from all cricket activities on the issue of American tour.",
        "1991": "Ramakrishna Hegde disqualified as MLA.",
        "1992": "A 30-member JPC constituted to probe the security scam.",
        "1993": "Medha Patkar suspends anti-Narmada stir and drops her ''jal samarpan'' threat.",
        "1994": "Hajratbal' was handed over to Muslim Auwkaf Trust.",
        "1996": "SC asks Harshad Mehta to pay Rs. 217 crore to I.T. department.",
        "1997": "Cabinet approves a proposal to amend the Hindu Marriage Act and the Special Marriage Act, with a view to removing epilepsy as a ground for annulling marriage or for declaring marriage as null and void.",
        "1998": "The Maharashtra Government rejects the Srikrishna Commission findings on the 1992-93 communal riots and the serial blasts in Mumbai, but agrees to act on the panel's suggestions to refurbish the police force.",
        "1999": "Kalpnath Rai (58), former Union Minister, died in New Delhi.",
        "2000": "Sundararajan Kidambi becomes the new International Master in the Beil Open chess championship at Biel."
    }
}