{
    "title": "Events for September 6",
    "events": {
        "1657": "Shahjahan fell ill. His four sons Dara Shikoh, Suja, Aurangzeb and Murad advanced towards Delhi to capture the throne.",
        "1674": "Faced with a critical situation, De la Haye had to capitulate and surrender St Thome to the Dutch who allowed the Sultan of Golconda to re-occupy it.",
        "1774": "British Government supported Peshwa Raghunath Rao to re-conqure Pune.",
        "1889": "Sarat Chandra Bose, freedom fighter, journalist and leader, was born.",
        "1903": "Russia increases import duties on Indian and Ceylon tea in retaliation for British import policies in Moscow.",
        "1905": "Satyacharan Chaterjee, great Indian Geologist, was born.",
        "1947": "Indian government creates a new ministry of relief and rehabilitation of refugees.",
        "1961": "D. N. Kohli was appointed as the Narcotics Commissioner of India. He headed this office till 28-05-1966.",
        "1965": "Full scale warfare broke out all along the international border between West Pakistan and India. Pakistani troops advanced towards the Indian town of Akhnur in Kashmir and Pakistani paratroopers raided Punjab.",
        "1972": "Allauddin Khan, famous Sarod player, passed away.",
        "1975": "Dularelal Bhargav, veteran writer, passed away. He was associated with 'Chand' and 'Madhuri' magazines.",
        "1990": "Prasar Bharti' bill passed in Parliament.",
        "1993": "CPI (M) wrests Congress (I) bastion of Chowringhee in the by-elections to the WB Assembly; Durgapur and Kurseong also won by CPI (M).",
        "1994": "Prime Minister Narsimha Rao meets with his counterpart Vo Van Kiet at Hanoi. Both countries decide to boost ties.",
        "1995": "Meenatai Thackrey, social worker and Matoshree of Shivsainik's, passed away.",
        "1996": "CBI arrests four Jharkhand Mukti Morcha leaders in bribery case.",
        "1999": "Vyjayanthimala Bali, former Congress (I) MP, joins the BJP.",
        "2000": "Telecom workers launch a nation-wide strike in protest against inadequate safeguards prior to the corporatisation of the department from October 1."
    }
}