{
    "title": "Events for January 7",
    "events": {
        "7\tJanuary\t1685": "Gerard George Clifford, Dutch director of East India Company, was born.",
        "7\tJanuary\t1761": "Third Battle of Panipat: Ahmed Shah Abdali, the ruler of Afghanistan, defeats the Marathas; Maratha imperialism checked.",
        "7\tJanuary\t1831": "Heinrich Von Stephan, famous general of postal union and freedom fighter, was born at Pomerania.",
        "7\tJanuary\t1858": "The hearing of the case began that was filed against the last Mughal Emperor Bahadhur Shah II for taking part in the first armed revolution against the British.",
        "7\tJanuary\t1859": "The Bahadur Shah II case trial was started, which ended on March 29.",
        "7\tJanuary\t1883": "Martyer Sohanlal Pathak was born.",
        "7\tJanuary\t1885": "Madhav Narayan Joshi, comedy drama writer, was born.",
        "7\tJanuary\t1900": "Raghukul Tilak, educationist and social worker, was born at Meerut, UP.",
        "7\tJanuary\t1928": "Rajindranath, cricketer (4 stumpings in his only Test for India), was born at Amritsar.",
        "7\tJanuary\t1956": "Vinoo Mankad scores 231 vs New Zealand, 413 opening stand with Roy.",
        "7\tJanuary\t1987": "Kapil Dev takes his 300th Test wicket. At 28, he was the youngest cricketer to accomplish this feat.",
        "7\tJanuary\t1988": "Mrs. Janaki Ramachandran sworn in as CM of Tamil Nadu.",
        "7\tJanuary\t1990": "President returns the Indian Post Office (Amendment) Bills of 1986 to Parliament at the instance of the Government.",
        "7\tJanuary\t1993": "The union govt. acquires 67.703 acres of land in and around the disputed area at Ayodhya and refers the issue to the Supreme Court.",
        "7\tJanuary\t1994": "Malhotra Committee recommends privatisation and foreign participation of LIC and GIC.",
        "7\tJanuary\t1997": "Jaspal Rana bags six gold medals in the men's standard pistol and air pistol and set two more records on the penultimate day of the National shooting."
    }
}