{
    "title": "Events for October 7",
    "events": {
        "1586": "The Mughal army entered Srinagar where 'Khutbah' was being recited in the name of the emperor.",
        "1708": "Guru Govind Singh, tenth and the last Sikh Guru, was assassinated.",
        "1737": "40 feet waves sink 20,000 small craft & kill 300,000 (Bengal, India).",
        "1914": "Begam Akhtar, famous gazal singer, was born.",
        "1919": "Mahatma Gandhij started publication of 'Navjeevan' newspaper.",
        "1950": "Mother Teresa, started Missionaries of Charity, in Calcutta.",
        "1952": "Chandigarh became the capital of Punjab.",
        "1953": "Chandigarh was inaugurated as capital of Punjab.",
        "1955": "Heavy floods in India and Pakistan caused 1,700 lives in India alone.",
        "1971": "K. Kelappan, freedom fighter, social reformer, revolutionary, educationist and journalist, died.",
        "1980": "Vijay Agrawal, Soccer(Football) player, was born in College Station, Texas, United States.",
        "1987": "Indian peace-keeping troops in Sri Lanka ordered to shoot at sight after the massacre of 179 people by Tamil rebels.",
        "1991": "Telugu Desam decides not to oppose PM Narasimha Rao in Nandyal.",
        "1992": "Vijaya Bhaskara Reddy, Union Law Minister, selected to become the new Chief Minister of Andhra Pradesh.",
        "1993": "The Supreme Court rejected private management's plea for 50\\% quota in private professional colleges.",
        "1995": "Keshubhai Patel ministry in Gujarat won the vote of confidence in the state assembly following a compromise reached between the party leadership and dissidents.",
        "1996": "Final phase of UP election.",
        "1997": "Lalram Sanga and Purnima Mohato emerge men's and women's individual champions in National Archery.",
        "1999": "Laloo Prasad Yadav, former Bihar Chief Minister and RJD president, loses in Madhepura.",
        "2000": "WWF-India bags the first Rajiv Gandhi Wildlife Conservation Award."
    }
}