{
    "title": "Events for November 7",
    "events": {
        "1858": "Bipinchandra Ramchandra Pal, powerful revolutionary and journalist, was born in a place called Silhat (now in Bangladesh). He was amoung the trio which was known as \"Lal - Bal - Pal\" during the freedom struggle. He started as newspaper called \"Swaraj\" for the Indians in England. He also edited several other newspapers like \"Tribune\", \"New India\", \"Vande Mataram\", \"Swaraj\", \"Hindu Review\", \"Democrat\", \"Independent Bengali\", etc.",
        "1862": "Bahadurshah Jafar -II died at Rangoon in British prision.",
        "1867": "Madam Marie Sklodowska, great scientist, professor and Nobel Prize awardee, was born in Poland.",
        "1888": "Sir Chandrasekhara Venkata Raman, Indian physicist, was born in Tiruchirapalli, South India. His work was influential in the growth of science in India. He was the recipient of the 1930 Nobel Prize for Physics for the 1928 discovery now called 'Raman scattering'--a change in frequency observed when light is scattered in a transparent material. When monochromatic or laser light is passed through a transparent gas, liquid, or solid and is observed with the spectroscope, the normal spectral line has associated with it lines of longer and of shorter wavelength called the Raman spectrum. Thus the Raman effect is applied in spectrographic chemical analysis and in the determination of molecular structure.",
        "1893": "Constantly Lievens, Flemish missionaries in India, passed away at the age of 37.",
        "1900": "Ranga N.G, professor and politician, was born.",
        "1907": "Murlidhar Shankar Deshpande, journalist and social worker, was born at Kadanachi Girvi Phaltan, Maharashtra.",
        "1908": "N. R. Shede (Annasaheb), litterateur and editor, was born.",
        "1912": "Chithira Tirunal Bala Rama Varma, social reformer, was born at Travancore.",
        "1933": "Gaandhiji commences Harijan-upliftment tour.",
        "1936": "Chandrakant Devtale, famous Hindi poet, was born.",
        "1950": "King Tribhubana Bir Bikram of Nepal flees palace for refuge in Indian Embassy at Kathmandu.",
        "1958": "Nehru said the role of Gen. Mohammed Ayub Khan in Pakistan had increased the 'risk and danger of war' between India and Pakistan.",
        "1966": "Riots over slaughtered cow claims seven lives.",
        "1971": "India admits forces entered Bangladesh to silence artillery.",
        "1974": "South Africa beats India in Women's Open in 63rd Tennis Davis Cup.",
        "1975": "Indian Supreme Court validates election of Indira Gandhi at New Delhi.",
        "1990": "Lawrence Durrell, great Indian English and author (Mount Olive), passed away at the age of 78.",
        "1991": "Salauddin and his wife Neena create a world record by travelling in a Nissan car.",
        "1995": "Lukose Leelamma at Pune sets record for 10,000m (Women) in 34.33.50.",
        "1996": "Cyclonic storm hits Andhra Pradesh.",
        "1997": "RBI Governor Dr. Chakravarti Rangarajan  appointed new Governor of Andhra Pradesh. Dr. Bimal Jalan, Member-Secretary, Planning Commission, will take over as RBI Governor.",
        "1998": "The Kalidas Samman awards, instituted by the Madhya Pradesh Government, are presented to Tapas Sen, Akbar Padamsee, Shriram Lagoo, Pandit Jasraj and Kalyani Kutti Amma.",
        "2000": "The BJP firebrand Uma Bharti makes a triumphant return to the Union Ministry as Minister for Sports and Youth Affairs and  Arun Jaitley gets elevated as Cabinet Minister in a mini expansion. Maj.Gen. (Retd) B. C. Khanduri takes oath as Minister of State for Transport and Highways."
    }
}