{
    "title": "Events for December 7",
    "events": {
        "7\tDecember\t1782": "Hyder Ali, warrior of Mysore, passed away in a camp near Chittur.",
        "7\tDecember\t1825": "First Steam Engine Ship \"Enterprise\" reached Calcutta.",
        "7\tDecember\t1856": "First Hindu widow married officially.",
        "7\tDecember\t1902": "Janardhan Gyanoba Navle, cricketer, India's first Test wicket-keeper, was born at Fulgaon, Maharashtra. He played against England at Lord's in 1932.",
        "7\tDecember\t1979": "Ramandeep Singh Gill, Soccer(Football) player, was born in Oslo, Norway.",
        "7\tDecember\t1989": "Hemananda Biswal sworn in as Orissa Chief Minister.",
        "7\tDecember\t1992": "Religious riots swept across India in the wake of the destruction of the ancient Babri Masjid mosque by rampaging Hindu fanatics in the northern Indian town of Ayodhya yesterday. More than 800 people had been killed and hundreds injured as Muslim and Hindu mobs stabbed, shooted and beat each other. The violence had thrown the government into chaos and had spilled into the neighboring states of Pakistan and Bangladesh. The army had been called out to restore order in Bombay, where street battles left 41 dead. The stock market had been closed down and Parliament forced to adjourn. Advani quit as the leader of opposition in the Lok Sabha.",
        "7\tDecember\t1993": "Lalthanhwala sworn in CM of Mizoram.",
        "7\tDecember\t1995": "Indian National Satellite (INSAT-2C), third indigenous satellite in the INSAT-2 series, launched. This has additional capabilities such as mobile satellite service, business communication and television outreach beyond Indian boundaries. This is still in service. It was launched by Ariane launch vehicle at French Guyana.",
        "7\tDecember\t1997": "Leander Paes awarded 'The Sportstar' award.",
        "7\tDecember\t1998": "A. B. Vajpayee questions Pakistan's decision to hand over part of occupied Kashmir to China and says the area belongs to India.",
        "7\tDecember\t1999": "A. B. Vajpayee, Prime Minister, rejects the Opposition demand for resignation of three Central Ministers  L. K. Advani, Murli Manohar Joshi and  Uma Bharati in the Ayodhya case.",
        "7\tDecember\t2000": "A five-member ULFA group guns down 26 non-Assamese people, mostly Hindi and Bengali-speaking, at Sonpura near Arunachal Pradesh Border in Upper Assam."
    }
}