{
    "title": "Events for February 7",
    "events": {
        "1273": "Shrichakradhar Swami, founder of 'Mahanubhav Panth', passed away.",
        "1687": "Mughal army won the Gowalkonda fort. Kutubshahi came to end.",
        "1795": "Dutch Prince William V accepts British occupation of Dutch Indies.",
        "1856": "Wajid Ali Shah, ruler of Oudh, was asked to abdicate by the British Resident on grounds of chronic misrule.",
        "1864": "P. S. S. Iyyer, famous lawyer and educationalist, was born.",
        "1908": "Manmanath Gupta was born.",
        "1922": "Britain threatens crackdown in India to combat Gandhi's civil disobedience campaign.",
        "1931": "Shila Kaul, the chief minister of New Delhi, was born.",
        "1954": "The present cres: the motto \"Shastra Se Shakti\" was adopted. In 1989, Hindi lettering of \"Shastra Se Shakti\" was adopted.",
        "1975": "Banke Bihar, mystery and religious story writer, passed away.",
        "1981": "61 die in circus fire in Bangalore.",
        "1983": "Eastern News Agency was established in Calcutta .",
        "1985": "Uday Merchant, cricketer (brother of Vijay, prolific scorer), passed away.",
        "1990": "Krishan Kant became the Governor of Andhra Pradesh till 21/08/1997.",
        "1992": "Shalki', the first submarine designed in India, joined Indian Navy.",
        "1993": "Medium-range surface to surface missile, 'Prithvi' successfully launched for the 10th time.",
        "1994": "C. T. Kamdar, famous industrialist and close friend of Mahatma Gandhi, passed away.",
        "1995": "Cong-I Disciplinary Action Committee expels Arjun Singh from the primary membership for 6 years for anti-party activities.",
        "1997": "Bal Thackeray, Shiv Sena supremo, found guilty of contempt of court and sentenced to simple imprisonment of one week and a fine of Rs. 2000 by Nagpur bench of Mumbai HC for his statement that ''a judge had demanded a bribe of Rs. 35 lakhs for favouring a litigant''.",
        "1999": "Indian leg-spinner Anil Kumble became  the second only bowler in Test history after J.C. Laker (England) to take all ten wickets in an innings against Pakistan in the second Test in Delhi.",
        "2000": "Kamaluddin Ahmed, former APCC(I) president and four times Congress MP, joins the BJP."
    }
}