{
    "title": "Events for April 7",
    "events": {
        "1506": "Saint Francis Xavier, Jesuit priest, Spanish missionary teaching in India and Japan, was born in the Spanish kingdom of Navarre.",
        "1541": "Father Francis Xavier, Spanish founder of the Jesuits, 35, and three friends set sail from Lisbon, Portugal for Goa. They became the first Roman Catholic missionaries to travel to India.",
        "1818": "British Government imposed 'State Prisoners Regulation III -1818' for detention and deportion of political prisoners and revolutionaries without any trial. This black act was in force till 1947 when India got independence.",
        "1920": "Ravi Shankar Bhattacharya, renowned Sitar player (Sounds of India), was born in Banaras, India.",
        "1929": "England's Imperial Airways had extended its flight to London-Karachi instead of London-Kahira. It was the first commercial air service in undivided India.",
        "1934": "Mahatma Gandhi suspended his campaign of civil disobedience in India.",
        "1935": "Shankar Abaji Bhise, famous Indian scientist, died.",
        "1938": "Kashiram Chhabildas Rana was born in Surat (Gujarat).",
        "1942": "Anandshankar Bapubhai Dhruv, famous Gujarati expert, Sanskrit Pandit and editor of a monthly magzine, died.",
        "1962": "Umrigar slams 172* vs WI at Port-of-Spain in 248 minutes.",
        "1986": "Charles Sobhraj and his associate David Hall were nabbed at Mapusa in Goa.",
        "1987": "In a case filed by Saira Banu of Kerela, Supreme Court held that all wives, including Muslim women, whose husbands have either married again or taken a mistress are entitled to maintenance.",
        "1993": "Narsimha Rao,PM, arrives in Bangkok on a three-day visit to Thailand.",
        "1997": "NAM foreign ministers two-day conference begins in New Delhi.",
        "1998": "Soli Sorabjee is appointed Attorney-General of India.",
        "2000": "The Delhi police unearth a multicrore cricket betting and match- fixing racket involving five South African cricketers, including the captain Hansie Cronje. A Delhi-based Indian operator Rajesh Kalra put behind bars."
    }
}