{
    "title": "Events for May 7",
    "events": {
        "1834": "East India Company annexed Coorg. King Raja Veer Rajendra, who was a cruel ruler, after formally declaring a war had captured Durg State.",
        "1849": "Bethune College of Calcutta was established in the upper class families and it was started for female education.",
        "1861": "Guru Dev Rabindranath Thakur alias Tagore, novelist, painter, educationist and freedom fighter, was born in Calcutta.",
        "1889": "Dr. Narayan Subbarao Hardikar, freedom fighter, journalist and Padmabhushan awardee, was born.",
        "1907": "Rajbali Pandey, famous poet, was born.",
        "1908": "Sudhabala alias Ermaline was born in Bombay. She was a film actress. Her first film was 'Hothal Padmini' (1925). Some of her films are Kicks of Kismet, Tained Virtue, Red Signal, Wise Fool, Hoor-E-Bagdad.",
        "1912": "Pannalal Patel, great Gujrati novelist and story writer, was born.",
        "1950": "Punjab Mail train crashed near Jasidh killing 81 persons.",
        "1958": "Acharya Kripalani elected leader of a new opposition group in the Lok Sabha.",
        "1973": "Shivkumar Batalvi, famous Punjabi poet, died.",
        "1985": "Adoor Gopalakrishnan adjudged Best Director (Mukhamukham) in national film awards.",
        "1990": "Government of India bans strikes in any service in any oil field or refinery under the Essential Services Maintenance Act.",
        "1991": "Haryana beat Bombay in the cricket Ranji Trophy final by 2 runs.",
        "1993": "Jankiraman panel's final report finds that an additional aggregate of Rs. 12,85,549 crore was transacted in banks without any documentation; it indicts 12 more banks for involving in the scam.",
        "1994": "Ustad Jahiruddin Dagar Nasir, famous classical singer of Dhrupad-Dhamar, passed away at the age of 62 in Bareilly.",
        "1996": "Third and final phase of polling begins for 185 LS constituencies and 154 assembly constituencies; 55 to 60\\% turnout was witnessed and there was widespread violence in Bihar.",
        "2000": "Ranjit Singh Gill, one of the prime accused in the murder of Lalit Maken and his wife Geetanjali, who was the daughter of the late President Dr. Shankar Dayal Sharma, on July 31, 1985, was extradited to Delhi from the US to stand trial in the case."
    }
}