{
    "title": "Events for June 7",
    "events": {
        "1539": "Sher Shah defeats Humayun near Buxar at Chausa and becomes emperor of Delhi.",
        "1606": "Guru Arjundev, fifth Guru of Sikhs, passed away.",
        "1631": "Begum Mumtaj Mahal, wife of Shah Jahan, Emperor of India, passed away at Burhanpur a few hours after the birth of a daughter. She was married in 1612 and the Taj Mahal was built for her.",
        "1955": "Jawaharlal Nehru, Indian Prime Minister, visited U.S.S.R.",
        "1965": "Ashutosh Kali, great revolutionary, passed away.",
        "1974": "Mahesh Bhupathi, Tennis star, was born. He is the winner of French Open 1997 (mixed doubles) and 1999 (doubles) and Wimbledon 1999.",
        "1979": "Bhaskara-I, first experimental satellite for Earth resources/meteorology remote sensing and the Second Satellite of India, launched. This satellite carried TV and microwave cameras. It was launched by Russian launch vehicle 'Intercosmos'.",
        "1984": "Indian Army troops, sent to Punjab to quell Sikh violence, stormed the Golden Temple in Amritsar, the holiest of Sikh shrines. More than 400 persons were reported killed in the assault at the shrine, including Jarnail Singh Bhindranwale.",
        "1989": "Sheetal Pandya set up a world record at the age of 5 years.",
        "1993": "Sai Baba escapes attempt on life. Four assailants and two bodyguards were killed.",
        "1996": "Sq. Ldr. Sanjay Thapar of IAF becomes the first Indian to jump from a parachute and hoist the national flag at the North Pole.",
        "1997": "Mahesh Bhupathi becomes the first Indian to win a Grand Slam title when he and Japan's Rika Hiraki claim the mixed doubles.",
        "1998": "India emerges World Bank's single largest borrower with cumulative loans of 44 billion dollars.",
        "1999": "Supreme Court, through an interim order, stayed the execution of the four accused in the Rajiv Gandhi assassination case till July 19, 1999.",
        "2000": "Telecom Commission approves the free phone bonanza for all telecom employees announced by the Union Communications Minister Ram Vilas Paswan."
    }
}