{
    "title": "Events for July 7",
    "events": {
        "1763": "Britishers declared Mir Jafer as Nawab of Bengal.",
        "1799": "Ranjit Singh captured Lahore in Punjab from Sikh rulers.",
        "1855": "As many as 30,000, people went to Calcutta alongwith weapons to fight the British army.",
        "1896": "The premier show of the 'Marvel of the Century', first cinema show India, arranged by the Representatives of French Lumiere brothers- Louis and August Lumiere, was held at Watson Hotel in Bombay. The regular shows, however, started from July 14, 1896 at the Novelty Theatre. This show advertisment appeared in the 'Times of India', carrying details of a film show to be held for the first time on Indian soil.",
        "1901": "J. Watsan Harod started a branch of Gramophone Company at Calcutta.",
        "1905": "Six Language penel were started on the Rs. five denomination again. The printing colour of note changed to Red with Special text mentioned, 'At any office of issue not situated in Burma'.",
        "1910": "'Bharat History Research Mandal' was established.",
        "1917": "Ram Subhagsingh, great politician and former Rail Minister, was born.",
        "1937": "Jagdish Prasad Goenka, great industrialist, was born in Calcutta.",
        "1943": "Rasbehari Bose handed over the command of  'Azad Hind Fauz' to Netaji Subhashchandra Bose at Singapore.",
        "1946": "Gandhiji addressed the A.I.C.C. meeting at Bombay; Congress accepted the Cabinet Mission plan of May 16.",
        "1948": "Damodar Valley Corporation, first public corporation, was established.",
        "1962": "94 people died in an Italian DC-8 air crash near Bombay.",
        "1973": "78 drowned as flash flood sweeped a bus into a river (India).",
        "1992": "Truckers call off strike.",
        "1995": "Rajan Pillai, 47, died because of denial of timely medical attention by Tihar jail authorities and also within 24 hours of rejection of his plea for medical treatment at Escorts Hospital by the court.",
        "1997": "Armed Kuki militants shot dead 25 persons and injured five seriously in an attack on Paites village in Manipur.",
        "1998": "Nag, indigenously developed anti-tank missile, is test-fired again.",
        "1999": "The Indian Army recaptures Jubar height in the Batalik sector."
    }
}