{
    "title": "Events for August 7",
    "events": {
        "1868": "Pratham Chaudhary (Birbal), modern Bengali poet and critic, was born.",
        "1871": "Abanindranath Tagore, great modern artist and painter, was born at Jorasanko in Calcutta.",
        "1887": "Kasturi Shriniwas Iyengar, politician and journalist, was born.",
        "1888": "Navalram (Navalram Laxmiram Pandya), literature critic and versatile Gujarati author, died.",
        "1905": "The first political documentary ootage was the Great Bengal Partition Movement: Meeting and Procession shot by Jyotish Sarkar and Jamshedji F. Madan in Calcutta.",
        "1906": "First Tricoloured National Flag consisting of Green, Yellow and Red, with eight Lotuses on the top, second strip carrying \"Vande Matara\" in Devnagri and the third strip having Sun and Cresent Moon, was hoisted at Green Park in Calcutta by Surendranath Banerjee.",
        "1925": "Monkombu Sambasivan Swaminathan was born in Kumbakonam. He went to Britain and took his Ph.D from the school of Agriculture in Cambridge in 1952. He developed high yielding strains of wheat and rice and accomplished difficult crosses in potato and jute species. In 1971, he was awarded The Ramon Magsaysay Award for generating a new confidence in the agricultural capabilities of the country. He was the Director of the International Rice Research Institute, Philippines. He is also the first agriculture scientist to win the Albert Einstein world science Award in 1986.",
        "1934": "Gandhi begins a fast for penance following the violent treatment of a Hindu leader by some of his followers.",
        "1941": "Rabindranath Devendranath Tagore \"Gurudev\", great Indian poet, voluminous playwright, Noble Laureate, social reformer, freedom fighter, painter and philosopher, passed away at Calcutta at the age on 80 years. He will be always remembered for the national song \"Jana Gana Mana\" and as a founder of Vishwa Bharati, Shantiniketen, etc.",
        "1947": "BEST services were started by Mumbai Mahanagarpalika.",
        "1980": "Mother Teresa visits the poor in Bronx at New York.",
        "1982": "Krishnakanta Radhakant Handique, linguist, educationist, Sanskrit scholar, principal of J.B. College and Padma Bhushan awardee, passed away. He also authored the learned works 'Naisadhacarita', 'Yasastilaka and Indian Culture' etc. His original treatise written in Sanskrit by Somaveda in the 10th century is an encyclopedic work dealing with Jainism and Indian thoughts and culture.",
        "1985": "Geet Sethi, national champion, was the third Indian to become World Amateur Billiards Champion by beating Robert Marshal of Australia.",
        "1986": "Lok Sabha passes Constitution 53rd Amendment bill conferring statehood on Mizoram.",
        "1988": "N. T. Ramarao elected chairman and V.P. Singh the convenor of the National Front.",
        "1990": "Union Cabinet approves setting up of Indian Broadcasting (Programme) Service.",
        "1991": "India successfully launches Prithvi-III, surface-to-air missile from Sriharikota.",
        "1998": "The Government announces a banking and foreign exchange package for development of the information technology and software industry following the recommendations of the National Task Force.",
        "1999": "A. B. Vajpayee, Prime Minister, appeals to the United States to name Pakistan as a terrorist state."
    }
}