{
    "title": "Events for January 8",
    "events": {
        "1025": "Sultan Mehmood completely destroyed the Temple of Somnath.",
        "1872": "Hemchandra Goswami, ancient Asamia literature expert, historian, editor and poet, was born.",
        "1884": "Keshav Chunder Sen, nationalist leader of Bengal, social worker and good orator of Brahma Samaj, passed away at his home in Lily Cottage, Calcutta. He was one of the first Indians to sow the seeds of secularism in our country. He strongly believed that education was the basic necessity to change the society.",
        "1890": "Ramchandra Varma, renowned editor, was born. He also has the credit in making the Hindi Dictionary.",
        "1895": "Ramchandra Sakharam Ruikar, freedom fighter, pioneer of the labour movement in India and President of All India Trade Union Congress, was born at Rui village, district Kolhapur, Maharashtra.",
        "1906": "Howrah Railway Station, Calcutta, was inaugurated.",
        "1908": "Mary Nadia Wadia (Fearless Nadia), great actress, was born.",
        "1925": "Mohan Rakesh, veteran Hindi playright, was born. His noted books are \"Aadhe Adhure\" and \"Aashaad Ka Ek Din\".",
        "1927": "The first scheduled London-Delhi flight arrives after 63 hrs. Air Minister Sir Samuel Hoare is on board.",
        "1941": "Swami Pranabananda Maharaj, father of Bharat Sevashram Sangha, passed away.",
        "1947": "Rajasthan University established at Jaipur.",
        "1956": "Tryambak Sitaram Karkhanis, founder of 'Maharashtra Drama Group' (Maharashtra Natak Mandali), died.",
        "1964": "Jack \"Murph the Surf\" Murphy, 27, and a companion were arrested in Miami as suspects in the theft of $410,000 rare gems from the American Museum of Natural History in October of last year. The world's largest sapphire, the Star of India, and eight of the other 22 stolen gems were returned to New York in an attorney's coat pocket, having been recovered in two water-logged suede pouches from a Miami bus terminal locker with the help of a third suspect. The three described themselves as \"beach boys.\" Murphy is a sometimes an aquatic clown, but mainly they were notorious jewel thieves. Murphy was also accused of pistol-whipping actress Eva Gabor and stealing jewels worth $50,000 from her a year ago.",
        "1965": "Star of India', world's largest sapphire, returned to American Museum of Natural History.",
        "1968": "The Official Languages Act, 1963 was amended. Accordingly, a provision was made in Section 3 (4) of the Act of the effect that employees of the Union Government proficient either in Hindi or in English may carry out their work effectively and that their interests may no be adversely affected merely because they are not proficient in both the languages. According to Section 3 (5), it is necessary for bringing to an end the use of English language for the Official purposes of the union that resolutions to this effect are passed by the legislatures of the states (i.e. states where Hindi is not the Official Language) and after considring these resolutions, a resolution is passed by both the houses of the Parliament to put an end to the use of English language.",
        "1973": "Nanasaheb Parulekar, father of 'Sakal' newspaper, died.",
        "1981": "India all out for 63 runs in one-day international vs Australia.",
        "1984": "Sushma Mukhopadhyay, first Indian women pilot, died at the of 74.",
        "1987": "P. G. Joshi, cricketer (12 Tests for India 1951-60, ct 18 stp 9), passed away.",
        "1992": "D. P. Sahastrabuddhe 'Anand', editor of  monthly magzine, passed away.",
        "1993": "FERA restrictions removed, resident Indians allowed to keep as much as $500.",
        "1994": "Kamkothi Parmacharya Shri Chandrashekhar Saraswati, 68th Shankaracharya of Kanchi maat and Indian Saint, passed away at the the of 99.",
        "1995": "Madhu Limaye, veteran national leader, socialist thinker, freedom fighter, politician, writer, close associate of Ram Manohar Lohia and Jaya Prakash Narayan, passed away.",
        "1996": "Maharashtra government clears Enron Dhabol power project at a tariff of Rs. 1.86 per unit.",
        "1999": "Farah Khan made it a double, adding the National ladies snooker title in Delhi.",
        "2000": "The Government reconstitutes the Indira Gandhi National Centre for Arts and Trust and retains Mrs. Sonia Gandhi as a trustee along with Mr. P. V. Narasimha Rao, Prof. Yashpal and Dr. Abid Hussain."
    }
}