{
    "title": "Events for November 8",
    "events": {
        "8\tNovember\t1661": "Guru Har Rai passed away. Second son Har Kishan became the eighth Sikh Guru age of 5 years 4 Months. He passed away at the age of 7 years 9 Months.",
        "8\tNovember\t1831": "Edward R L Bulwer-Lytton was born.",
        "8\tNovember\t1893": "Dwaram Venkataswamy Naidu, great musician and professor, was born in Bangalore.",
        "8\tNovember\t1919": "Madan Theatres Ltd. was founded under a Joint Stock Company at Calcutta. Their maiden venture 'Bilwamangal' was released on November 8, 1919 at the Cornwallis Theatre, Calcutta.",
        "8\tNovember\t1927": "Lal Krishna Adwani was born in Karachi (now in Pakistan).",
        "8\tNovember\t1932": "Sankhla Badluram, great industrialist, was born in Delhi.",
        "8\tNovember\t1947": "Junagadh accedes to India.  Addresses A.I.C.C.",
        "8\tNovember\t1948": "Nathuram Godse confesses to murder of Gandhi but denies conspiracy.",
        "8\tNovember\t1960": "Subroto Mukherjee died while having dinner in Tokyo, where he had gone with the Air India International Airlines which made its first inaugural flight to the city of Tokyo, Japan.",
        "8\tNovember\t1965": "Bashiruddin Ahmad, religious leader and litterateur, passed away.",
        "8\tNovember\t1966": "Rameshwari Nehru, freedom fighter and social worker, died at 80 years in New Delhi. She founded \"Stree-Darpan\" Magazine in 1909 and was president of \"Indian Women Association\". She had received Lenin Peace Prize in 1961 for her humanitarian services for upliftment of the downtrodden.",
        "8\tNovember\t1968": "Jansattak Party established.",
        "8\tNovember\t1977": "Bommi Narsing Reddy, famous film story writer and Dadasaheb Phalke awardee, passed away.",
        "8\tNovember\t1988": "Salman Rushdie's 'The Satanic Verses' awarded 1988 Whitbread Prize.",
        "8\tNovember\t1990": "Congress (I) extends support to Chandrasekhar to form Government, even as BJP and Left parties decline the request of President R. Venkataraman to form Government. Rajasthan BJP CM Bhairon Singh Shekhwat wins confidence motion with the help of Janata Dal rebels (116-80).",
        "8\tNovember\t1991": "K.P.S. Gill reappointed DGP in Punjab.",
        "8\tNovember\t1992": "Mother Teresa, nobel prize winner, was presented 'Bharat Ki Mahan Suputri' award.",
        "8\tNovember\t1997": "India lifts Asia Cup tennis title in Delhi.",
        "8\tNovember\t1999": "The Government announces waiver of telephone bills up to Rs. 1000 in the rural areas of cyclone-hit Orissa.",
        "8\tNovember\t2000": "India wins the men's team title in the World Carrom championship in New Delhi."
    }
}