{
    "title": "Events for December 8",
    "events": {
        "1857": "Mohsini from Delhi was hanged in jail.",
        "1875": "Tej Bahadur Sapru, great leader, was born.",
        "1879": "Jatindranath Mukherjee (Jatin Bagha), famous revolutionary, was born in Jessore.",
        "1897": "Balkrishna Sharma \"Navin\", famous Hindi poet, was born in Bhyana village of Shajapur district in MP.",
        "1900": "Udayshankar, famous dance master, was born.",
        "1911": "Gaandhiji invites Gokhale to South Africa.",
        "1920": "A. Adivi Reddy, social reformer and educationist, was born at Chandragiri, AP.",
        "1922": "Hari Prasad Sharma, cricket Test umpire for 3 tests from 1974-77, was born at Delhi.",
        "1930": "British Gen. Norman Simpson shot at desk by Indian nationalists.",
        "1932": "Indian Air Force Act was passed.",
        "1942": "Hemant Shamsunder Kanitkar, cricketer (batted in two Tests India v WI 1974), was born in Amravati, Maharashtra.",
        "1970": "Army Ordnance Corps was awarded the 'Colours' by the Vice President of India, Shri G S Pathak, at AOC Centre, Secunderabad. The Ordnance colour is a scarlet silken flag with the Ordnance crest in the center and surrounding it is a wreath of Ashoka Leaves and Lotus flowers.",
        "1980": "Soviet President Leonid Brezhnev visits New Delhi.",
        "1985": "The first summit was held at Dhaka. (7 0r 8).",
        "1992": "World-wide protest against Ayodhya demolition, temples burnt in Pakistan and Britain; Advani, Joshi, Singhal arrested; Nation observes 'bandh'.",
        "1994": "At 1730 hrs, a rocket propelled grenade fired by Somalia militia during inter clan fighting exploded on the roof of the barrack which housed IAF officers. In the explosion, two officers and an airman were injured.",
        "1996": "Sachin Tendulkar became the youngest cricketer to make 3000 runs in test cricket (at the age of 23 yrs and 228 days).",
        "1998": "An Indian film, 'The Terrorist' wins all top awards including the Golden Pyramid award for the best film at the 23rd Cairo International Film Festival. Santosh Sivan gets the best director award, while its actress Ayesha Dharker bags the best actress award.",
        "1999": "The Opposition attacks Prime Minister Vajpayee for \"withholding'' information on ministers' resignation.",
        "2000": "EC nod for Paswans's party to be known as Lok Janshakti Party."
    }
}