{
    "title": "Events for February 8",
    "events": {
        "1785": "Warren Hastings, British Viceroy, left  India.",
        "1872": "Lord Mayo, Viceroy of India, was assassinated by prisoner Sher Ali during his visit to Andaman Islands.",
        "1881": "Faiyaj Khan, famous Indian classical singer, was born.",
        "1897": "Dr. Zakir Hussain, third President of India and Educationist, was born in Hyderabad, Andhra Pradesh.",
        "1907": "Madhavravji Golwalkar, sarsanghchalak of 'Rashtriya Swayansewak Sangh' (RSS), was born.",
        "1912": "Girishchandra Ghosh, famous Bengali actor and dramatist, passed away.",
        "1921": "Chamber prince of a Royal Proclamation was inaugurated.",
        "1936": "Manohar Shankar Hardikar, cricketer (batted in 2 Tests India vs West Indies in 1958-59), was born in Baroda.",
        "1943": "Subhashchandra Bose started his journey to Japan from Kiel along with his secretary Major Abid Hassan in a submarine.",
        "1948": "Indian govt. bans Muslim groups 'Khaksars' and 'League National Guard'.",
        "1959": "The Report of the Committee of Parliament constituted under Article 344 (4) of the constitution was submitted to the President.",
        "1967": "Indira Gandhi was hit in face by a stone while addressing crowd.",
        "1971": "Kanhaiyalal Maniklal Munshi, writer, administrator, leader and founder of Bhartiya Vidya Bhavan, died.",
        "1985": "P. K. Kaul was appointed as the Cabinet Secretary of India. He held this office till 22-08-1986.",
        "1986": "For the first time in the country, pre-paid taxi sevice  scheme was established at New Delhi airport.",
        "1989": "Mrs. Gro Harlem Brundtland, PM of Norway, was awarded 1988 Indira Gandhi Prize for Peace, Disarmament and Development.",
        "1993": "India and Spain sign four agreements as the Spanish PM, Felipe Gonzalez, began a two-day visit to New Delhi.",
        "1994": "Gopalrao Deuskar, internationally famed painter, passed away.",
        "1995": "Mulayam Singh wins the crucial vote of strength.",
        "1999": "Gen. K. Sundarji (69), former Chief of Army Staff, died in New Delhi."
    }
}