{
    "title": "Events for April 8",
    "events": {
        "1674": "Chhatrapati Shivaji Maharaj honoured Hansaji Mohite with the degree of 'Hambirrao' and appointed him as Chief General of his Army.",
        "1759": "British troops chase French out of Masulipatam, India.",
        "1774": "Narayan Rao's posthumous son, Madhav Rao, was seen as a challenge to Raghunath Rao only when he was 10 days old.",
        "1831": "Ram Mohan Roy landed in England.",
        "1835": "Raja Ram Mohan Roy reached England.",
        "1857": "Mangal Pandey, the first revolutionary of Indian mutiny and freedom fighter, was hanged till death at Barrackpore. He struck the first bullet during the time of mutiny against the British Empire.",
        "1887": "Ramnarayan Vishwanath Pathak, famous Gujrati litterateur critic, poet and story writer, was born.",
        "1894": "Bankim Chandra Chatterjee, famous novelist and writer of national song 'Vande Mataram', died at the age of 55. Some of his writings are 'Anandmath' and 'Kapal Kundala'.",
        "1897": "Henrich Von Stephan, famous General Postal Union and freedom fighter, passed away.",
        "1919": "Gandhiji arrested on way to Delhi for refusal to comply with order not to enter Punjab; escorted back to Bombay; outbreaks of violence in several towns.",
        "1923": "Plague in India killed 1,000 in past week.",
        "1925": "Kumar Gandharva (Shivputra Siddharamaiya Komkali), famous music director and singer, was born.",
        "1929": "Bhagat Singh and Batukeshwar Dutt threw two bombs on the Assembly Hall.",
        "1937": "R. Gundurao, former Chief Minister of Karnataka and senior leader of Indira Congress, was born.",
        "1946": "HMS Vengeance, sailed with 22 aircraft of No. 4 Sqn, halted at Singapore for re-fueling and set course for Iwakuni, a port of Kyushu island.",
        "1950": "Nehru and Ali Khan sign the Indo-Pakistani Pact.",
        "1953": "Walchand Hirachand, great Industrialist, passed away.",
        "1973": "India takes control over Sikkim after anti-government riots.",
        "1985": "India files suit against Union Carbide in New York for Bhopal gas disaster.",
        "1991": "Prafulla Kumar Mahanta,Assam CM, steps down as party chief.",
        "1992": "Congress (I) government led by Rajkumar Dorendra Singh sworn in in Manipur.",
        "1993": "Dasarath Deb, veteran tribal leader, elected leader of the Left and Democratic Front legislature party in Tripura.",
        "1994": "Dr. Wilfred D'Souza re-installed as Goa CM.",
        "1997": "India creates history by entering the semi-finals of the 12th Jawaharlal Nehru Gold Cup international football series for the first time after holding Ghana 2-2 at Kochi.",
        "1998": "Sedapatti R. Muthiah resigns as the Union Surface Transport Minister at the behest of his party supremo Jayalalitha. He is involved in court cases.",
        "2000": "Air India wins the Rani of Jhansi women's cricket tournament in Chennai."
    }
}