{
    "title": "Events for July 8",
    "events": {
        "1497": "Vasco De Gama departed with his fleet from Lisbon Harbour for a trip to India .",
        "1888": "Fenardish Jyoki Antoniu, Konkani author and journalist, was born.",
        "1907": "Elphinstone Picture Palace was started by Jamshedji F. Madan at Calcutta.",
        "1914": "Jyoti Basu, former Chief Minister of West Bengal, was born.",
        "1918": "Montagu - Chelmsford Report was published. This report was prepared to reform the legislature of India. This report was made by Edwin Montagu who was the Secretary of States for India and Lord Chelmsford, who was the Viceroy.",
        "1928": "Eighteen died when an East Indian Railroad train was derailed after saboteurs removed part of the tracks.",
        "1930": "The King opens India House in the Aldwych, appealing for peace in India at London.",
        "1954": "Jawaharlal Nehru, Prime Minister of India, inaugurated world's longest Bhakra-Nangal Dam canal at Punjab.",
        "1958": "Lord Canning declared that since peace was established, it is better known as end of Indian Mutiny, 1857.",
        "1971": "Krishnarao Arkgudun, versatile Kannad author, died.",
        "1972": "Sourav Chandidas Ganguly, cricketer (centuries in 1st two Tests for India 1996), was born in Calcutta.",
        "1985": "Sri Lanka Peace talks open in Thimphu.",
        "1988": "More than 100 people were killed and several injured as Bangalore-Trivandrum Island Express fell into Ashtamudi lake at Perumon in Quilon district of Kerala.",
        "1991": "L.K. Advani recognised as the leader of the Opposition of BJP in the 10th Lok Sabha.",
        "1996": "U.N. says India is leading in HIV infections.",
        "1997": "33 persons killed and 67 injured as blast rips through part of Ambala-bound train at Lehra Khana station in Bhatinda district, Punjab.",
        "1999": "The bodies of 12 soldiers, who martyred in Kargil battle, were brought to New Delhi. So far 321 soldiers were killed and 476 wounded in operation Vijay."
    }
}