{
    "title": "Events for August 8",
    "events": {
        "1911": "Following the end of a heavy monsoon, parts of India were hit by a cholera epidemic.",
        "1912": "Prabhulal Bhatnagar, mathematician and Padmabhushan awardee, was born.",
        "1923": "Floods on the Ganges and Jumna rivers cause loss of life in Benares, India.",
        "1932": "Dada Kondke, famous Marathi actor, was born.",
        "1936": "Corbett National Park was established. It was the first country in the country.",
        "1940": "Dilip Narayan Sardesai, cricketer (high scoring Indian batsman of sixties), was born in Margao, Goa. He has received Arjun Award (1970).",
        "1942": "'Britishers Quit India', this resolution was announced in public at Bombay Congress Session. This resolution was passed by All Indian National Congress Committee and Gandhiji gave the 'Do or Die' call for Independence struggle.",
        "1946": "India agrees to give Bhutan 32 miles.",
        "1948": "Dr. Yellapragada Subbarow, saintly scientist and nobel prize winner, passed away at Pearl River, New York.",
        "1949": "India concludes a treaty with Bhutan.",
        "1955": "Dr. Homi J. Bhabha elected chairman of the international conference on the Peaceful Uses of Atomic Energy.",
        "1966": "India endorses the Partial Nuclear Ban Treaty.",
        "1967": "Central government, for the first time since independence, suffered a token defeat in the Lok Sabha.",
        "1968": "Abey Kuruvila, cricketer (promising Bombay fast bowler), was born in Mannar.",
        "1972": "Olympics open at Munich (26).",
        "1984": "P.T. Usha at Los Angeles sets record for 400m H. (Women) in 55.42.",
        "1990": "Naval Godrej, famous Industrialist, died.",
        "1991": "India and Soviet Union extend their treaty of peace, friendship and co-operation for 20 more years.",
        "2000": "The Government appoints Air Marshal P. Rajkumar to head the court of enquiry to probe the Alliance Air crash near Patna."
    }
}