{
    "title": "Events for September 8",
    "events": {
        "1790": "Lord Edward Alanbaro, Governor General of India (1842 to 1844), was born.",
        "1887": "Swami Sivananda, (1887-1963), religious leader, Hindu universalist renaissance guru, author of 200 books and founder of Divine Life Society with 400 branches worldwide, was born in the quiet village of Pattamadai, District Tirunelveli.",
        "1897": "Lokmanya Tilak charged in anti-national activity case.",
        "1910": "Saint Shri Gajanan Maharaj died.",
        "1911": "Anand Gopal Sheorey, great Hindi writer, litterateur and journalist, was born at Sausar in Madhya Pradesh.",
        "1933": "Asha Bhosle (born Asha Mangeshkar), famous playback singer, was born in Sangli, Maharashtra.",
        "1947": "There was little time to celebrate independence in India and Pakistan as large parts of the dominions were paralyzed with fear. Mobs ran wild as Muslims and Hindus battled to  death and turned streets into rivers of blood.",
        "1951": "The office of Controller of Military Accounts (Pensions) was re-designated as CDA(P), Allahabad.",
        "1952": "The Copyright bill was signed during the first world convention by 35 nations including India at Geneva.",
        "1953": "Sheikh Mohammad Abdullah, Premier of Kashmir, was shot at.",
        "1960": "Feroz Gandhi, a prominent member of the Lok Sabha,died in New Delhi.",
        "1962": "Chinese army infiltrated in the north-east border of India exceeding the Mac-Mahon line (Tibet-India boundary). This was the first ocassion of Chinese infiltration.",
        "1965": "Pakistan commenced its drive into the Indian Punjab using its 1-armoured division with the aim to foreclose India's options north of the Beas-Sutlej river line, after foiling the southern most divisional attack mounted by 4-Mountain Division.",
        "1972": "Vijay Singh Chauhan sets record for decathlon by 7378/7306 points at Munich.",
        "1982": "Sheikh Mohammad Abdullah, former Chief Minister of Kashmir, who dominated the political scene of Jammu and Kashmir for 50 years, died. He was 77.",
        "1990": "Mother Teresa re-elected head of Missionaries of Charity.",
        "1991": "Hostage ONGC engineer T.S. Raju and mediator Bipul Mahanta, an Amnesty International member, killed by ULFA in Assam.",
        "1993": "Mandal Commission recommendation of 27\\% job reservation for the backward classes brought into effect; 'Creamy' layer excluded.",
        "1995": "Harcharan Singh Brar sworn in as the Chief Minister of Punjab.",
        "1997": "English chosen as the official language of Dravidian University which was set up at Kuppam (Andhra Pradesh) jointly by the southern states.",
        "2000": "Dr. Surinder K. Vasal, Indian maize breeder, and Dr. Evagelina Villegas, Mexican cereal chemist, jointly awarded the World Food Prize-2000 for their decades-long scientific quest to produce quality protein maize for developing countries."
    }
}