{
    "title": "Events for January 9",
    "events": {
        "1664": "Shivaji started Surat campaign and left the city after plundering the place.",
        "1841": "John Gil Christ, founder of  Fort William College Calcutta,  passed away at Paris.",
        "1854": "Govind Vasudev Kanitkar, noted poem writier, novelist and translator, was born.",
        "1889": "Dr. Vrindavanlal Varma, famous Hindi writer and social reformer, was born in Jhansi. He mainly wrote historical and social novels, most famouse being \"Mriganainee\".",
        "1904": "Pratab Singh Chaudhari, social worker, was born at Multan, Punjab .",
        "1915": "Gandhiji reached Bombay on his return from South Africa. He became a member of the Indian National Congress. He was awarded Kaiseri-e-Hind Gold Medal for Ambulance service on Jan, 11.",
        "1916": "Ramkrishna Ramnarayan Ruia, great industrialist, was born.",
        "1918": "Harprasad Nanda, famous Industrialist, was born.",
        "1919": "Theophane A. Mathias, educationist, was born.",
        "1922": "Har Gobind Khurana, scientist of Biology, was born in India. He did his M.Sc from University of Punjab and, for higher education went to University of Liverpool. In 1959, he produced a chemical called \"Coenzymea\", which is essential for certain processes in the human body. He was awarded Nobel Prize for medicine in 1968 along with Marshall W. Nirenberg and Robert W. Halley.",
        "1923": "Satyendranath Tagore, Bengali litterateur, passed away.",
        "1935": "Harishankar Sharma, great educationist, was born at Jaipur.",
        "1946": "Nanalal Dalpatram Kavi, famous Hindi poet, Gujarati litterateur, writer, headmaster and innovator of duel meaning phrases, passed away.",
        "1971": "Muslim leader Sheik Mohammed Abdullah was barred from returning to Kashmir.",
        "1972": "In 1971, 433  feature films produced in the world with a record and a top position in film production.",
        "1976": "President suspends seven freedoms guaranteed by Article 19 of the Constitution.",
        "1982": "A group of 21 Indian scientists team led by S. Z. Qasim started for the first ever Antarctica expedition on December 1981 - Jan 1982.",
        "1993": "An Indian Airlines TU-154 plane crash lands in Delhi, all the 165 on board escape; Civil Aviation Minister Scindia resigns; PM cancels Dhaka visit; SAARC summit put off.",
        "1994": "Indian diplomats and staff members evacuated from war-ravaged Kabul.",
        "1995": "Manipur Assembly removes Dr.H. Borobabu (Speaker) and suspends his membership until state election.",
        "1996": "PM unveils India's state-of-the-art Main Battle Rank (MBT) `Arjun' at a New Delhi function.",
        "1997": "John Major, British Prime Minister, addresses plenary session of the 'Partnership Summit' organised in Calcutta by the Confederation of Indian Industry.",
        "1998": "Three RJD ministers in the Gujral Cabinet - Mr. Raghuvansh Prasad Singh, Capt. Jai Narayan Nishad and Mrs. Kanti Singh - resign."
    }
}