{
    "title": "Events for October 9",
    "events": {
        "1874": "Nicholas Roerich, great professor, master, artist, scientist, educator, writer, designer, poet, explorer and humanitarian, was born in St. Petersburg, Russia. He led artistic and scientific expedition in Himalayas and settled in Kulu valley.",
        "1877": "Utkalmani Pandit Gopabandhu Das, great freedom fighter, social reformer, educationist, poet, author, lawyer of modern Orrisa, was born in Puri District, Orissa.",
        "1931": "Air Force was established.",
        "1942": "Bibi Amar Kaur, freedom fighter, successfully hoisted the national flag at Jail Gate of Lahore. She was then arrested and send to Ambala Jail.",
        "1945": "British troops occupy Andaman  in Gulf of Bengal.",
        "1946": "Jinnah's 9-point demands conveyed to Congress.",
        "1947": "P. C. Joshi, General Secretary, Communist Party of India (CPI), appealed to all LEFT parties to rally around Nehru to fight for peace.",
        "1949": "The Territorial Army of India inaugurated by the Governor General.",
        "1963": "Saifuddin Azizuddin Kitchlew, freedom fighter, President of Punjab and the first Indian to win the Lenin Award for International Peace, died.",
        "1964": "K. M. George established the Kerala Congress Party.",
        "1968": "Olympic Games open in Mexico City.",
        "1970": "Production of Uranium 233 started at Bhabha Atomic Research Centre in Bombay.",
        "1976": "International Dialing Telephone Service started between Mumbai and London.",
        "1978": "Asian Games begin in Bangkok.",
        "1987": "Official Languages Rules, 1976 amended.",
        "1992": "Sukha and Jinda, assassins of former army chief Gen. A. S. Vaidya, hanged in Pune jail.",
        "1993": "C. R. Rangachari, cricketer (4 Tests for India, 8 runs @ 2.66, 9 wkts @ 54.78), passed away.",
        "1994": "Kamal Bose, great photographer, died.",
        "1996": "PVN Rao granted anticipatory bail in St. Kitts forgery case till Oct. 14.",
        "1997": "Forest brigand Veerappan kidnapped 21 persons and later released 13 tourists. He detained six people --Dr. Mythi of Indian Institute of Horticulture Research Centre, Bangalore, two drivers, pumpset attender and two photographers.",
        "1999": "Sunil Kumar and Sai Jayalakshmy won the men's and women's titles respectively in the National Tennis championship in Delhi. Akshay Vishal Rao emerged boys' under-18 champion.",
        "2000": "The Centre appoints Yogendra Narain as the new defence secretary and K. Sibal as the secretary in the Ministry of External Affairs while effecting a major bureaucratic reshuffle."
    }
}