{
    "title": "Events for November 9",
    "events": {
        "1236": "Ruknud-din Firuz Shah, son of Emperor Iltutmish, was assassinated.",
        "1710": "Reynier de Klerk, governor-general of Dutch-Indies, baptized.",
        "1841": "Edward VII,  King of England (1901-10), was born.",
        "1871": "Padmnath Gohain, litterateur of modern Assamia Barua, was born.",
        "1877": "Muhammad Iqbal, Urdu poet, was born in Sialkot (now in Pakistan).",
        "1897": "Kotamaraju Rama Rao, founder-editor of Lucknow's \"National Herald\", was born at Chirala. He was referred by Gandhiji as 'Fighting Editor'.",
        "1904": "Panchanan Maheshwari was born in Jaipur, Rajasthan. He studied the morphology, anatomy and embryology of some angiosperms, the class of plants which produce flowers with different embryological studies. He discovered species of plants like \"Panchanania Jaipuriensis and Isoeted Panchananil\".",
        "1909": "The Times reports failure of Gandhi Government negotiations on Transvaal laws.",
        "1913": "Weekly 'Pratap' was published from Kanpur which was edited by Ganesh Shankar Vidyrarthi.",
        "1924": "Pandit C. R. Vyas, veteran singer, was born.",
        "1942": "Jami, last evergreen poet of Parsi language, died.",
        "1948": "Administration of Mayurbhanj State taken over by the Government of India.",
        "1960": "Subroto Mukherji, first Air Chief Marshall of Indian Air Force, suddenly died.",
        "1962": "Dhondo Keshav Karve, social reformer and educationist Bharat Ratna awardee, died.",
        "1967": "Bhartiya Kranti Dal, a new political party founded.",
        "1972": "Laxmi Poruri, guntur India and tennis star (1994 Futures-College Park), was born.",
        "1977": "Keshavrao Bhole, great music director, passed away.",
        "1980": "P. C. Joshi, former General Secretary of Indian Communist Party, passed away.",
        "1990": "Vishwanath Pratap Singh resigned from the post of Prime Minister of India after losing the Vote of Confidence moved against him.",
        "1992": "Chandralekha resigns from IAS and joins Tamizhaga Wellatchi Iyyakkam (Tamil Movement for Good Government) led by Dr. Subramaniam Swamy.",
        "1993": "Tamil Nadu Assembly urges the Centre to amend Constitution to retain 69\\% reservation for backward classes.",
        "1997": "Poonam Chibber, Miss Canada, crowned seventh Miss India Worldwide.",
        "1998": "India rejects Pakistan's bid to internalise the Sir Creek issue at the bilaternal talks in New Delhi.",
        "1999": "Prof. Romila Thapar, historian, is elected to the highest British academic honour.",
        "2000": "The 17-day old Manohar Parrikar led BJP Government in Goa wins the trust vote."
    }
}