{
    "title": "Events for December 9",
    "events": {
        "9\tDecember\t1484": "Surdas (1483-1563), blind Hindi bard and singer of Agra whose hymns to Krishna are compiled in the 'Sursagar', was born in Sihi village near Delhi.",
        "9\tDecember\t1658": "Dutch troops occupy harbour city Quilon (Coilan), India.",
        "9\tDecember\t1761": "Maharani Tarabai of Pune, the regent of Maratha empire of India from 1700 until 1708, died at Satara. She was the queen of Chhatrapati Rajaram Bhosale and daughter-in-law of the empire's founder Shivaji and mother of Shivaji II. She is acclaimed for her role in keeping alive the resistance against Mughal occupation of Maratha territories after the death of her spouse, and acted as regent during the minority of her son.",
        "9\tDecember\t1825": "Tula Ram Rao, one of the revolutionary heroes of the 1857 and Sepoy Mutiny, was born.",
        "9\tDecember\t1873": "Lord Northbrook, Viceroy and Governor General of India laid the foundation stone of the building.",
        "9\tDecember\t1942": "Dr. Dwarkanath Kotnis, doctor of international fame, died at Kokun village, China.",
        "9\tDecember\t1946": "The first meeting of Constitutional Committee Assembly was held in Parliment after a gap of two years, 11 months and 17 days. The Congress started its work of framing the Indian Constitution. Muslim League boycott failed to prevent Constituent Assembly opening. From 16th August 1946, the country witnessed communal riots on an unprecedented scale. At this crucial juncture, on 20th February 1947, Clement Atlee the British prime minister, fixed June 1948 as a deadline for transfer of power and Lord Mountbatten was appointed as the new Viceroy.",
        "9\tDecember\t1947": "India's agreement with Pakistan on outstanding issues like assets, liabilities, division of sterling balance and military stores, etc. signed.",
        "9\tDecember\t1977": "Ravishankar Mahashankar Rawal, famous painter, passed away.",
        "9\tDecember\t1989": "Shyama Charan Shukla sworn in as Chief Minister of Madhya Pradesh.",
        "9\tDecember\t1992": "More than 700 die in clashes in Ayodhya; BJP bandh partial.",
        "9\tDecember\t1993": "Virbhadra Singh sworn in as Congress CM of Himachal Pradesh.",
        "9\tDecember\t1994": "Gorprasad Ghosh, famous Orriya film actor, director and producer, passed away.",
        "9\tDecember\t1997": "Dr. K. Shivarama Karanth (95), doyen of Kannada literature and Jnanpith Award winner, died in Manipal.",
        "9\tDecember\t1999": "Several MPs in the Lok Sabha demand resignation of the CBI chief in the Priyadarshini Matto murder case."
    }
}