{
    "title": "Events for February 9",
    "events": {
        "1757": "In a treaty between Lord Clive and Siraj Ud Daulah, Clive was authorised to safe guard (Killa Bandi) and open mint at Calcutta. Nawab had paid compensation to British Army.",
        "1874": "Govind Tryambak Darekar, Marathi poet, was born.",
        "1898": "The Rower of Persia', a short film produced at Calcutta was released on February 9 at Star Theatre, Calcutta.",
        "1917": "Homi Talyarkhan, great politician, was born.",
        "1929": "Abdul Rehman Abdul Gafur Antule, former Chief Minister of Maharashtra and Central Minister for Health, was born.",
        "1931": "A set of six stamps were issued during the inauguration of New Delhi.",
        "1942": "Chiang Kai-Shek meets Sir Stafford Cripps, British Viceroy in India.",
        "1946": "Demonstrations were held against the trial of the INA men. The ratings and a few units of the Royal Indian Navy rise in open Mutiny in Mumbai harbours.",
        "1951": "The first census of free India of enumeration work was started.",
        "1964": "Hanumant Singh scores 105 runs on his debut match during the India vs England cricket tournament at Delhi.",
        "1984": "Balasarasvati, eminent classical Karnatic singer and Bharat Natyam dancer of worldwide acclaim, passed away in Madras.",
        "1985": "Editor of 'Sakal', a Marathi daily newspaper, passed away.",
        "1989": "Sanjay Khan, actor-director, critically injured in a fire accident.",
        "1991": "India holds the last decennial census of the century.",
        "1992": "Publication of daily newspaper `Lokpatra' started from Nanded.",
        "1993": "Silver prices crash as the govt allows passengers to import upto 100 k and reduces customs duty on 35 baggage items from 255 to 150 \\%.",
        "1994": "Supreme Court sets aside disqualification (under anti-defection law in 1991) of former Goa CM Ravi Naik.",
        "2000": "The Madras High Court suspends the one-year jail sentence passed by a Special Court against the former Tamil Nadu Chief Minister, Ms. Jayalalitha, in the 'Pleasant Stay Hotel Case'."
    }
}