{
    "title": "Events for April 9",
    "events": {
        "1669": "Aurangzeb issued a general order all the schools and temples of the infidels.",
        "1695": "Waman Pandit, famous pandit poet, took samadhee at Bhogav.",
        "1756": "Ali Bardi Khan of Bengal passed away in Murshidabad. His youngest daughter's son Siraj-ud-Daulah was crowned as King of Bengal when he was merely 20 years old after the death of King Tartar.",
        "1783": "Tipu Sultan drives out English from Bednoor, India.",
        "1893": "Maha Pandit Rahul Sanskrityayan, politician, professor and Hindi writer, was born at Pandaha, Azamgarh.",
        "1936": "SikhdevSingh RattanSingh Dhindsa was born in Ubhawal village, Distt. Sangrur (Punjab).",
        "1954": "India reports only 43\\% of population speaks 15 recognized languages, noting 720 dialects, 23 tribal tongues.",
        "1965": "Fighting breaks out in the Rann of Kutch between Indian and Pakistani troops. Pakistan attacked Indian borders, Sardar Post, Chhar Bet and Beria Bet, this was manned by the State Armed Police Batallions. In Kutch launched its 8th Infantry Division supported by two regiments of M47/48 Pattons. Operation 'Desert Hawk' was launched to draw away reserves from other vulnerable areas, and possibly to test India's resolve. The Indian Army did not rise to the bait.",
        "1974": "India, Pakistan, Bangladesh reach pact to exchange prisoners of 1971 war in New Delhi.",
        "1984": "Captain H.J. Singh of Indian Army crossed the Banihal Darsh with the help of Hand Glider and set a new record.",
        "1986": "First University in India devoted to hygiene established at Vijaywada.",
        "1991": "Rajendra Mathur, editor of Hindi daily newspaper 'Navbharat Times', passed away.",
        "1993": "Lt. Gen. B.C. Joshi to be the next army chief.",
        "1994": "C. Rajeshwara Rao, 80, former General Secretary of Communist Party of India, passed away in Hyderabad.",
        "1997": "Mumbai regains Ranji Trophy in Gwalior.",
        "1999": "K. Sasikiran won the National 'A' chess title with a round to spare in Nagpur."
    }
}