{
    "title": "Events for June 9",
    "events": {
        "1659": "Dara Shikoh was handed over to Aurangzeb's army by Jiwan Khan, a Baluchi whose life was saved by Dara.",
        "1752": "French army surrenders to the English in Trichinopoly, India.",
        "1834": "Dr. William Carey, great writer and social worker, died.",
        "1900": "Birsa Munda, freedom fighter and leader, died in Ranchi Jail.",
        "1909": "Baburao Arnalkar, famous detective story writer, was born.",
        "1923": "K. Alagirisami, famous journalist, playwright and story writer, was born.",
        "1948": "Laloo Prasad Yadav, former Chief Minister of Bihar, was born.",
        "1949": "Kiran Bedi, the first woman Indian Police Service Officer, was born in Amritsar, Punjab.",
        "1957": "General Election ( 2nd) of India ends.",
        "1964": "Lal Bahadur Shastri became the second Prime Minister of India when the country was shocked of Jawaharlal Nehru's death and Indo-China war. Shastri gave the quotation \"Jai Jawan Jai Kisan\" which motivated the war-affected Indians to boost their morale. He remained in this office till he died on January 11, 1966 at Taskent. In his cabinet, Indira Gandhi served as Minister of Information and Broadcasting.",
        "1967": "Narayan Shripad Rajhans, alias Bal Gandharva, went into a coma in Bombay and never regained his consciousness.",
        "1980": "M. G. Ramachandran's second AIADMK ministry takes office.",
        "1986": "First AIDS death reported from a private hospital in Mumbai.",
        "1991": "Raj Khosla, famous film producer and director, passed away.",
        "1992": "Rajesh Khanna (Congress-I) defeats Shatrughan Sinha to wrest the New Delhi Lok Sabha seat from the BJP.",
        "1994": "Yogi Dhirendra Bhramachari, [controversial Flying Swami], hindu saint, died in an air crash near Jammu. He was 70.",
        "1997": "At least 50 persons were killed and 5,000 families affected in a landslide triggered by heavy rains in Gangktok.",
        "1998": "The rupee plunges to an all-time low of Rs. 42.23/25 against the dollar.",
        "1999": "The Indian army occupies two key positions in the Batalik sector.",
        "2000": "The CBI-designated court frames charges against Bihar Chief Minister Rabri Devi and  RJD president Laloo Prasad Yadav in the disproportionate assets case."
    }
}