{
    "title": "Events for August 9",
    "events": {
        "1788": "Gulam Kadir removed the eyes of Shah Alam 2nd, King of Delhi with a knife.",
        "1892": "Shri Shiyali Ramamrita Ranganathan, prolific author and first librarian of the University of Madras, was born.",
        "1893": "Shivpujan Sahai, famous Hindi story writer and novelist, was born at Bihar in a middle class family.",
        "1902": "King Edward VII was crowned the emperor of Great Britain at Westminster Abbey after the death of his mother Queen Victoria. Earlier, he had held a grand function in which nearly 4,56,000 invitees celebrated this royal feast.",
        "1909": "Vinayak Krishna Gokak, famous Kannad poet, play writer, critic of literature, educationist and Gyanpeeth awardee, was born at Savanur.",
        "1911": "Khorshedji Rustomji Meher-Homji, cricketer (Indian wicket-keeper 1936), was born in Bombay.",
        "1925": "Government Treasury from Postal Train was looted near Kakuri Station just about 22 km. away from Lucknow by the members of 'Hindustan Socialist Republican Association'.",
        "1942": "Subhash Chandra Bose (Netaji) forms the Indian National Army in Malaya with the help of the Japanese. He inaugurates the Government of Free India at Singapore.",
        "1952": "New Delhi reports that 20 mil. Indian peasants were imperiled by crop failures.",
        "1963": "India is the first country to add its signature to the test-ban treaty at Moscow.",
        "1965": "Pakistan chose to persist while the Indian Army Corps on the ceasefire line got down to neutralizing the Gibraltar Force. As a first step, main infiltration routes were blocked and Pakistan was forced out of the Haji Fir bulge (known to them as Bedori).",
        "1966": "Heroes of the 1942 movement were honoured at a rally in Red Fort.",
        "1969": "Ochterlony Memorial in Calcutta was renamed as 'Shahid Minar'.",
        "1970": "Trailokyanath Chakravarty died in Delhi.",
        "1971": "Vinodnand Jha, former Chief Minister of Bihar, died.",
        "1992": "Golden jubilee celebrations of the Quit India Movement begin in Bombay.",
        "1995": "India celebrated 53rd anniversary of Quit India movement.",
        "1996": "Unofficial estimates put black money in the country at Rs. 70,000 crore, i.e. 6\\% of GDP.",
        "1997": "Sonia Gandhi addresses Congress plenary session at Calcutta.",
        "1998": "India moves the World Trade Organisation against the European Union reimposing anti-dumping duties on unbleached cotton gray fabric imports.",
        "1999": "India's Manisha Malhotra won the $10,000 ITF women's circuit tournament at Harrisonburg, Virginia for her maiden tour title.",
        "2000": "Parliament approves the Madhya Pradesh Reorganisation Bill 2000, paving the way for the creation of a separate Chhattisgarh State."
    }
}