{
    "title": "Events for September 9",
    "events": {
        "1812": "The first paper currency was issued by the Bank of Bengal. The notes of this bank were later printed by Perkins, Heath & Co. in England. They can be distinguished into at least 10 different types. They were issued in a wide range of denominations from Rs. 10 to Rs. 1000.",
        "1850": "Bhartendu Harish Chander, father of modern Hindi literature, poet and dramatist, was born.",
        "1872": "Sarladevi Chaudharani, Bengali poet, was born.",
        "1896": "Shyam Lal Gupt 'Parshad', freedom fighter, social worker and Padamshree awardee, was born in Narwal village near Kanpur in Uttar Pradesh.",
        "1898": "Explosive Department of India was established at Nagpur. This is presently under the Ministry of Commerce and Industry, Government of India.",
        "1920": "Anglo Oriental College of Aligargh became Aligarh Muslim University. It was the first university to use the regional language.",
        "1923": "First magazine 'Kiran' was published by Ravikiran Mandal.",
        "1941": "Syed Abid Ali, great Indian medium pace-bowler and all-rounder, was born at Hyderabad.",
        "1942": "Shirish Kumar, martyr, died.",
        "1944": "Mahatma Gandhi conducted several talks between 9th September to 27the September with Mohammed Ali Jinnah regarding Pakistan.",
        "1947": "Ananda Kentish Coomaraswamy, great philosopher, linguist, art historian, painter and critic, died at Needham, Boston.",
        "1949": "Hindi was accepted as the national language of India.",
        "1952": "Kishorlal Ghanshamlal Mashruwala, great thinker and philosopher of Gandhi era, passed away.",
        "1981": "Phiroz Edulji Palia, cricketer (two Tests for India, 29 runs & 0/13), died.",
        "1991": "Gold ornaments pledged by the Goans to the Portugese bank returned to owners.",
        "1993": "Narsimha Rao, Prime Minister, arrived in Seoul for a three-day visit.",
        "1997": "Pravin Thipsay becomes India's third chess Grand Master.",
        "1999": "Mr. V. Sudarshan, Foreign Editor of The Pioneer till recently gets the Appan Menon Award.",
        "2000": "Venus Williams wins the women's singles in the U.S. Open championship."
    }
}